// 트리맵 + 메트릭 데이터 (window 전역 할당 전용)
// 자동 생성 일시: 2025-11-17 17:33:55

(function(){
  var brandNames = {
  "M": "MLB",
  "I": "MLB KIDS",
  "X": "DISCOVERY",
  "V": "DUVETICA",
  "ST": "SERGIO",
  "W": "SUPRA"
};
  var channelItemSalesData = {
  "I": {
    "기타": {
      "Acc_etc": 34250,
      "Headwear": 13270,
      "Shoes": 593500,
      "과시즌의류": 674350,
      "당시즌의류": 1988300
    },
    "대리점": {
      "Acc_etc": 2205840,
      "Bag": 26775660,
      "Headwear": 36018210,
      "Shoes": 71229720,
      "과시즌의류": 511000,
      "당시즌의류": 360948870
    },
    "면세점": {
      "Acc_etc": 5387800,
      "Bag": 27648000,
      "Headwear": 106149940,
      "Shoes": 29643000,
      "과시즌의류": 354000,
      "당시즌의류": 171366970
    },
    "백화점": {
      "Acc_etc": 12578120,
      "Bag": 42751550,
      "Headwear": 121941380,
      "Shoes": 256748010,
      "과시즌의류": 59722530,
      "당시즌의류": 1111659140
    },
    "사입": {
      "Acc_etc": 6552050,
      "Bag": 5525130,
      "Headwear": 79288930,
      "Shoes": 88820830,
      "과시즌의류": 956117400
    },
    "자사몰": {
      "Acc_etc": 4955550,
      "Bag": 2859500,
      "Headwear": 15960930,
      "Shoes": 46480560,
      "과시즌의류": 305940,
      "당시즌의류": 208684340
    },
    "제휴몰": {
      "Acc_etc": 10443200,
      "Bag": 13020470,
      "Headwear": 39409080,
      "Shoes": 177363410,
      "과시즌의류": 79087760,
      "당시즌의류": 425411860
    },
    "직영몰": {
      "Acc_etc": 2320030,
      "Bag": 3652100,
      "Headwear": 24318570,
      "Shoes": 34395410,
      "과시즌의류": 665400,
      "당시즌의류": 103623710
    },
    "직영점(가두)": {
      "Acc_etc": 1189500,
      "Bag": 1851340,
      "Headwear": 10377160,
      "Shoes": 10623000,
      "과시즌의류": 354000,
      "당시즌의류": 56237010
    }
  },
  "M": {
    "RF": {
      "Acc_etc": 7273940,
      "Bag": 37277010,
      "Headwear": 224573990,
      "Shoes": 255254290,
      "과시즌의류": 2142390,
      "당시즌의류": 629662610
    },
    "기타": {
      "Acc_etc": 122800,
      "Bag": 500500,
      "Headwear": 860000,
      "Shoes": 3047480,
      "과시즌의류": 2427040,
      "당시즌의류": 12949500
    },
    "대리점": {
      "Acc_etc": 10838330,
      "Bag": 98048310,
      "Headwear": 965058080,
      "Shoes": 823735280,
      "과시즌의류": 20280660,
      "당시즌의류": 1523702390
    },
    "면세점": {
      "Acc_etc": 50039010,
      "Bag": 358097180,
      "Headwear": 3561810830,
      "Shoes": 600255160,
      "과시즌의류": 43736000,
      "당시즌의류": 1239628930
    },
    "백화점": {
      "Acc_etc": 23964500,
      "Bag": 312904750,
      "Headwear": 823211970,
      "Shoes": 908767350,
      "과시즌의류": 12756850,
      "당시즌의류": 2195406610
    },
    "사입": {
      "Bag": -52020,
      "Headwear": -167370,
      "Shoes": 82534400,
      "과시즌의류": 1285465380
    },
    "아울렛": {
      "Shoes": 0,
      "당시즌의류": 0
    },
    "자사몰": {
      "Acc_etc": 2830666,
      "Bag": 14224162,
      "Headwear": 181207288,
      "Shoes": 138857745,
      "과시즌의류": 8289331,
      "당시즌의류": 318786899
    },
    "제휴몰": {
      "Acc_etc": 3078800,
      "Bag": 17057900,
      "Headwear": 456186510,
      "Shoes": 147026010,
      "과시즌의류": 5894500,
      "당시즌의류": 503362980
    },
    "직영몰": {
      "Acc_etc": 826350,
      "Bag": 7078770,
      "Headwear": 81705870,
      "Shoes": 39848200,
      "과시즌의류": 1020960,
      "당시즌의류": 174233330
    },
    "직영점(가두)": {
      "Acc_etc": 12032380,
      "Bag": 45500470,
      "Headwear": 441708570,
      "Shoes": 215266040,
      "과시즌의류": 10157140,
      "당시즌의류": 509437430
    }
  },
  "ST": {
    "기타": {
      "Shoes": 100540,
      "과시즌의류": 272490,
      "차시즌의류": 40370
    },
    "면세점": {
      "Acc_etc": 706430,
      "Bag": 1078200,
      "Headwear": 309600,
      "Shoes": 4266940,
      "과시즌의류": 21951450,
      "당시즌의류": 9690300,
      "차시즌의류": 589500
    },
    "백화점": {
      "Acc_etc": 51430,
      "Bag": 62100,
      "Headwear": 528500,
      "Shoes": 644970,
      "과시즌의류": 2237140,
      "당시즌의류": 3543400,
      "차시즌의류": 393300
    },
    "아울렛": {
      "Acc_etc": 1153550,
      "Bag": 763900,
      "Headwear": 1602480,
      "Shoes": 285930,
      "과시즌의류": 70980620,
      "당시즌의류": 1175600
    },
    "자사몰": {
      "Acc_etc": 1407860,
      "Bag": 1968710,
      "Headwear": 1500380,
      "Shoes": 250490,
      "과시즌의류": 12652880,
      "당시즌의류": 27513780,
      "차시즌의류": 273560
    },
    "제휴몰": {
      "Acc_etc": 1350700,
      "Bag": 3166800,
      "Headwear": 1991100,
      "Shoes": 8013800,
      "과시즌의류": 118509370,
      "당시즌의류": 12486000,
      "차시즌의류": 109000
    },
    "직영몰": {
      "Acc_etc": 573520,
      "Bag": 3738610,
      "Headwear": 1556700,
      "Shoes": 2158780,
      "과시즌의류": 29793270,
      "당시즌의류": 26135900,
      "차시즌의류": 1383000
    },
    "직영점(가두)": {
      "Acc_etc": 285710,
      "Bag": 1578600,
      "Headwear": 1106200,
      "Shoes": 645000,
      "과시즌의류": 16295300,
      "당시즌의류": 29303700,
      "차시즌의류": 1480000
    }
  },
  "V": {
    "기타": {
      "Shoes": 0,
      "당시즌의류": 375420
    },
    "백화점": {
      "Acc_etc": 6870290,
      "Bag": 18758310,
      "Headwear": 11927400,
      "Shoes": 12040720,
      "과시즌의류": 189926890,
      "당시즌의류": 1274864750
    },
    "아울렛": {
      "Acc_etc": 388800,
      "Bag": 5066000,
      "Headwear": 2142680,
      "Shoes": 4602060,
      "과시즌의류": 504210790,
      "당시즌의류": 87666000
    },
    "자사몰": {
      "Acc_etc": 425390,
      "Bag": 6746780,
      "Headwear": 875060,
      "Shoes": 9032900,
      "과시즌의류": 32028520,
      "당시즌의류": 154321010
    },
    "제휴몰": {
      "Acc_etc": 4087900,
      "Bag": 13767000,
      "Headwear": 9386600,
      "Shoes": 29128000,
      "과시즌의류": 326097010,
      "당시즌의류": 249837500
    },
    "직영몰": {
      "Acc_etc": 207000,
      "Bag": 1188000,
      "Headwear": 893500,
      "Shoes": 3142800,
      "과시즌의류": 6994400,
      "당시즌의류": 125897500
    },
    "직영점(가두)": {
      "Acc_etc": 380000,
      "Bag": 350000,
      "Headwear": 360000,
      "Shoes": 390000,
      "과시즌의류": 1865000,
      "당시즌의류": 28430000
    }
  },
  "W": {
    "기타": {
      "과시즌의류": 0
    },
    "대리점": {
      "Bag": 126000,
      "Headwear": 39000,
      "Shoes": -532000,
      "과시즌의류": 188000
    },
    "자사몰": {
      "Acc_etc": 27000,
      "Bag": 1648864,
      "Headwear": 2773121,
      "Shoes": 3063530,
      "과시즌의류": 45866914,
      "당시즌의류": 19000
    },
    "제휴몰": {
      "Acc_etc": 99000,
      "Bag": 2561000,
      "Headwear": 1749000,
      "Shoes": 4879000,
      "과시즌의류": 61098000,
      "당시즌의류": 38000
    }
  },
  "X": {
    "기타": {
      "Acc_etc": 19880,
      "Bag": 101380,
      "Headwear": 114600,
      "Shoes": 2461690,
      "과시즌의류": 2173310,
      "당시즌의류": 11562000
    },
    "대리점": {
      "Acc_etc": 62016560,
      "Bag": 240731230,
      "Headwear": 109474080,
      "Shoes": 538266100,
      "과시즌의류": 1523900620,
      "당시즌의류": 7414381940
    },
    "면세점": {
      "Acc_etc": 360100,
      "Bag": 27447700,
      "Headwear": 3423110,
      "Shoes": 166949320,
      "과시즌의류": 108000,
      "당시즌의류": 1084307860
    },
    "백화점": {
      "Acc_etc": 83073630,
      "Bag": 192271040,
      "Headwear": 46886060,
      "Shoes": 462782900,
      "과시즌의류": 2861763000,
      "당시즌의류": 4677371070
    },
    "사입": {
      "Shoes": -93060,
      "과시즌의류": 945290410
    },
    "아울렛": {
      "Acc_etc": 28526750,
      "Bag": 99732080,
      "Headwear": 44468580,
      "Shoes": 173948980,
      "과시즌의류": 6501803370,
      "당시즌의류": 1567752660
    },
    "자사몰": {
      "Acc_etc": 12547690,
      "Bag": 24488510,
      "Headwear": 7444510,
      "Shoes": 168579050,
      "과시즌의류": 8713459,
      "당시즌의류": 1035115810
    },
    "제휴몰": {
      "Acc_etc": 135177890,
      "Bag": 87662250,
      "Headwear": 16481900,
      "Shoes": 261769500,
      "과시즌의류": 1140970230,
      "당시즌의류": 1413057720
    },
    "직영몰": {
      "Acc_etc": 2092600,
      "Bag": 9546270,
      "Headwear": 4884850,
      "Shoes": 46073050,
      "과시즌의류": 66947400,
      "당시즌의류": 619304230
    },
    "직영점(가두)": {
      "Acc_etc": 2124680,
      "Bag": 7441500,
      "Headwear": 8645290,
      "Shoes": 20473280,
      "과시즌의류": 21500,
      "당시즌의류": 284614000
    }
  }
};
  var channelMetrics = {
  "I": {
    "기타": {
      "sales": 3303670,
      "tag": 8273500,
      "discountRate": 0.6006925726717833
    },
    "대리점": {
      "sales": 497689300,
      "tag": 516175800,
      "discountRate": 0.03581434852234455
    },
    "면세점": {
      "sales": 340549710,
      "tag": 340768800,
      "discountRate": 0.0006429285779684379
    },
    "백화점": {
      "sales": 1605400730,
      "tag": 1713814400,
      "discountRate": 0.06325869942509532
    },
    "사입": {
      "sales": 1136304340,
      "tag": 4318681100,
      "discountRate": 0.7368862590942407
    },
    "자사몰": {
      "sales": 279246820,
      "tag": 330176900,
      "discountRate": 0.15425088793310493
    },
    "제휴몰": {
      "sales": 744735780,
      "tag": 812935200,
      "discountRate": 0.08389281212081845
    },
    "직영몰": {
      "sales": 168975220,
      "tag": 184909000,
      "discountRate": 0.08617092732100651
    },
    "직영점(가두)": {
      "sales": 80632010,
      "tag": 80825000,
      "discountRate": 0.002387751314568476
    }
  },
  "M": {
    "RF": {
      "sales": 1156184230,
      "tag": 1359442600,
      "discountRate": 0.14951596338087392
    },
    "기타": {
      "sales": 19907320,
      "tag": 38586600,
      "discountRate": 0.4840872219889806
    },
    "대리점": {
      "sales": 3441663050,
      "tag": 3624481600,
      "discountRate": 0.050439916704226095
    },
    "면세점": {
      "sales": 5853567110,
      "tag": 5884926000,
      "discountRate": 0.005328680428606902
    },
    "백화점": {
      "sales": 4277012030,
      "tag": 4535320200,
      "discountRate": 0.056954781274318855
    },
    "사입": {
      "sales": 1367780390,
      "tag": 6115794000,
      "discountRate": 0.7763527695667971
    },
    "아울렛": {
      "sales": 0,
      "tag": 0,
      "discountRate": 0.0
    },
    "자사몰": {
      "sales": 664196091,
      "tag": 808813800,
      "discountRate": 0.17880222741006646
    },
    "제휴몰": {
      "sales": 1132606700,
      "tag": 1165436500,
      "discountRate": 0.0281695313301068
    },
    "직영몰": {
      "sales": 304713480,
      "tag": 318609900,
      "discountRate": 0.043615782183792806
    },
    "직영점(가두)": {
      "sales": 1234102030,
      "tag": 1253970900,
      "discountRate": 0.01584476162883841
    }
  },
  "ST": {
    "기타": {
      "sales": 413400,
      "tag": 972000,
      "discountRate": 0.5746913580246913
    },
    "면세점": {
      "sales": 38592420,
      "tag": 53181600,
      "discountRate": 0.2743275869849723
    },
    "백화점": {
      "sales": 7460840,
      "tag": 8645000,
      "discountRate": 0.1369762868710237
    },
    "아울렛": {
      "sales": 75962080,
      "tag": 167318500,
      "discountRate": 0.5460031018685919
    },
    "자사몰": {
      "sales": 45567660,
      "tag": 51713600,
      "discountRate": 0.118845719501253
    },
    "제휴몰": {
      "sales": 145626770,
      "tag": 306198500,
      "discountRate": 0.5244040385566879
    },
    "직영몰": {
      "sales": 65339780,
      "tag": 102408600,
      "discountRate": 0.3619697955054556
    },
    "직영점(가두)": {
      "sales": 50694510,
      "tag": 58079300,
      "discountRate": 0.12715012061095776
    }
  },
  "V": {
    "기타": {
      "sales": 375420,
      "tag": 1750000,
      "discountRate": 0.7854742857142857
    },
    "백화점": {
      "sales": 1514388360,
      "tag": 1890537000,
      "discountRate": 0.1989639134277721
    },
    "아울렛": {
      "sales": 604076330,
      "tag": 1331241000,
      "discountRate": 0.546230674986723
    },
    "자사몰": {
      "sales": 203429660,
      "tag": 252644000,
      "discountRate": 0.19479718497173892
    },
    "제휴몰": {
      "sales": 632304010,
      "tag": 890600000,
      "discountRate": 0.29002469121940266
    },
    "직영몰": {
      "sales": 138323200,
      "tag": 158112000,
      "discountRate": 0.1251568508399109
    },
    "직영점(가두)": {
      "sales": 31775000,
      "tag": 31970000,
      "discountRate": 0.006099468251485773
    }
  },
  "W": {
    "기타": {
      "sales": 0,
      "tag": 0,
      "discountRate": 0.0
    },
    "대리점": {
      "sales": -179000,
      "tag": -831000,
      "discountRate": 0.0
    },
    "자사몰": {
      "sales": 53398429,
      "tag": 228890000,
      "discountRate": 0.7667070252086154
    },
    "제휴몰": {
      "sales": 70424000,
      "tag": 276510000,
      "discountRate": 0.7453112003182525
    }
  },
  "X": {
    "기타": {
      "sales": 16432860,
      "tag": 55531000,
      "discountRate": 0.7040777223532801
    },
    "대리점": {
      "sales": 9888770530,
      "tag": 11483983000,
      "discountRate": 0.138907595909886
    },
    "면세점": {
      "sales": 1282596090,
      "tag": 1371234000,
      "discountRate": 0.06464098031408205
    },
    "백화점": {
      "sales": 8324147700,
      "tag": 10821544000,
      "discountRate": 0.23078003471593334
    },
    "사입": {
      "sales": 945197350,
      "tag": 7271276000,
      "discountRate": 0.87000942475571
    },
    "아울렛": {
      "sales": 8416232420,
      "tag": 12838524000,
      "discountRate": 0.34445482829646146
    },
    "자사몰": {
      "sales": 1256889029,
      "tag": 1429308000,
      "discountRate": 0.12063108231395892
    },
    "제휴몰": {
      "sales": 3055119490,
      "tag": 3902653000,
      "discountRate": 0.21716855431420623
    },
    "직영몰": {
      "sales": 748848400,
      "tag": 819890000,
      "discountRate": 0.08664772103574869
    },
    "직영점(가두)": {
      "sales": 323320250,
      "tag": 369282000,
      "discountRate": 0.12446247041556313
    }
  }
};
  var channelItemMetrics = {
  "I": {
    "기타": {
      "Acc_etc": {
        "sales": 34250,
        "tag": 68500,
        "discountRate": 0.5
      },
      "Headwear": {
        "sales": 13270,
        "tag": 39000,
        "discountRate": 0.6597435897435897
      },
      "Shoes": {
        "sales": 593500,
        "tag": 732000,
        "discountRate": 0.18920765027322406
      },
      "과시즌의류": {
        "sales": 674350,
        "tag": 1899000,
        "discountRate": 0.6448920484465508
      },
      "당시즌의류": {
        "sales": 1988300,
        "tag": 5535000,
        "discountRate": 0.640776874435411
      }
    },
    "대리점": {
      "Acc_etc": {
        "sales": 2205840,
        "tag": 2310800,
        "discountRate": 0.04542149904794879
      },
      "Bag": {
        "sales": 26775660,
        "tag": 27830000,
        "discountRate": 0.03788501616960116
      },
      "Headwear": {
        "sales": 36018210,
        "tag": 36941000,
        "discountRate": 0.024980103408137277
      },
      "Shoes": {
        "sales": 71229720,
        "tag": 73752000,
        "discountRate": 0.03419947933615364
      },
      "과시즌의류": {
        "sales": 511000,
        "tag": 590000,
        "discountRate": 0.13389830508474576
      },
      "당시즌의류": {
        "sales": 360948870,
        "tag": 374752000,
        "discountRate": 0.036832705362479734
      }
    },
    "면세점": {
      "Acc_etc": {
        "sales": 5387800,
        "tag": 5387800,
        "discountRate": 0.0
      },
      "Bag": {
        "sales": 27648000,
        "tag": 27867000,
        "discountRate": 0.007858757670362815
      },
      "Headwear": {
        "sales": 106149940,
        "tag": 106150000,
        "discountRate": 5.652378709530836e-07
      },
      "Shoes": {
        "sales": 29643000,
        "tag": 29643000,
        "discountRate": 0.0
      },
      "과시즌의류": {
        "sales": 354000,
        "tag": 354000,
        "discountRate": 0.0
      },
      "당시즌의류": {
        "sales": 171366970,
        "tag": 171367000,
        "discountRate": 1.7506287675050913e-07
      }
    },
    "백화점": {
      "Acc_etc": {
        "sales": 12578120,
        "tag": 12989400,
        "discountRate": 0.031662740388316624
      },
      "Bag": {
        "sales": 42751550,
        "tag": 49293000,
        "discountRate": 0.1327054551356176
      },
      "Headwear": {
        "sales": 121941380,
        "tag": 125241000,
        "discountRate": 0.026346164594661547
      },
      "Shoes": {
        "sales": 256748010,
        "tag": 270114000,
        "discountRate": 0.04948277393989209
      },
      "과시즌의류": {
        "sales": 59722530,
        "tag": 96598000,
        "discountRate": 0.3817415474440464
      },
      "당시즌의류": {
        "sales": 1111659140,
        "tag": 1159579000,
        "discountRate": 0.041325222343626455
      }
    },
    "사입": {
      "Acc_etc": {
        "sales": 6552050,
        "tag": 50019100,
        "discountRate": 0.869009038547275
      },
      "Bag": {
        "sales": 5525130,
        "tag": 49902000,
        "discountRate": 0.8892803895635446
      },
      "Headwear": {
        "sales": 79288930,
        "tag": 302711000,
        "discountRate": 0.7380705359237028
      },
      "Shoes": {
        "sales": 88820830,
        "tag": 355282000,
        "discountRate": 0.749999071160374
      },
      "과시즌의류": {
        "sales": 956117400,
        "tag": 3560767000,
        "discountRate": 0.7314855479170639
      }
    },
    "자사몰": {
      "Acc_etc": {
        "sales": 4955550,
        "tag": 5822900,
        "discountRate": 0.14895498806436658
      },
      "Bag": {
        "sales": 2859500,
        "tag": 3975000,
        "discountRate": 0.2806289308176101
      },
      "Headwear": {
        "sales": 15960930,
        "tag": 19519000,
        "discountRate": 0.1822875147292382
      },
      "Shoes": {
        "sales": 46480560,
        "tag": 54182000,
        "discountRate": 0.14214019416042223
      },
      "과시즌의류": {
        "sales": 305940,
        "tag": 364000,
        "discountRate": 0.15950549450549456
      },
      "당시즌의류": {
        "sales": 208684340,
        "tag": 246314000,
        "discountRate": 0.1527710970549786
      }
    },
    "제휴몰": {
      "Acc_etc": {
        "sales": 10443200,
        "tag": 10443200,
        "discountRate": 0.0
      },
      "Bag": {
        "sales": 13020470,
        "tag": 20483000,
        "discountRate": 0.36432797929990723
      },
      "Headwear": {
        "sales": 39409080,
        "tag": 39422000,
        "discountRate": 0.0003277357820505866
      },
      "Shoes": {
        "sales": 177363410,
        "tag": 178482000,
        "discountRate": 0.006267242635111692
      },
      "과시즌의류": {
        "sales": 79087760,
        "tag": 138693000,
        "discountRate": 0.42976386695795754
      },
      "당시즌의류": {
        "sales": 425411860,
        "tag": 425412000,
        "discountRate": 3.290927382826325e-07
      }
    },
    "직영몰": {
      "Acc_etc": {
        "sales": 2320030,
        "tag": 2422000,
        "discountRate": 0.04210156895127992
      },
      "Bag": {
        "sales": 3652100,
        "tag": 3879000,
        "discountRate": 0.058494457334364536
      },
      "Headwear": {
        "sales": 24318570,
        "tag": 25104000,
        "discountRate": 0.03128704588910136
      },
      "Shoes": {
        "sales": 34395410,
        "tag": 35508000,
        "discountRate": 0.031333502309338734
      },
      "과시즌의류": {
        "sales": 665400,
        "tag": 939000,
        "discountRate": 0.29137380191693296
      },
      "당시즌의류": {
        "sales": 103623710,
        "tag": 117057000,
        "discountRate": 0.11475853643951239
      }
    },
    "직영점(가두)": {
      "Acc_etc": {
        "sales": 1189500,
        "tag": 1190000,
        "discountRate": 0.00042016806722688926
      },
      "Bag": {
        "sales": 1851340,
        "tag": 1897000,
        "discountRate": 0.02406958355297839
      },
      "Headwear": {
        "sales": 10377160,
        "tag": 10391000,
        "discountRate": 0.0013319218554518342
      },
      "Shoes": {
        "sales": 10623000,
        "tag": 10623000,
        "discountRate": 0.0
      },
      "과시즌의류": {
        "sales": 354000,
        "tag": 354000,
        "discountRate": 0.0
      },
      "당시즌의류": {
        "sales": 56237010,
        "tag": 56370000,
        "discountRate": 0.0023592336349121945
      }
    }
  },
  "M": {
    "RF": {
      "Acc_etc": {
        "sales": 7273940,
        "tag": 8680600,
        "discountRate": 0.16204640232242007
      },
      "Bag": {
        "sales": 37277010,
        "tag": 41405000,
        "discountRate": 0.09969786257698343
      },
      "Headwear": {
        "sales": 224573990,
        "tag": 255983000,
        "discountRate": 0.12269959333236968
      },
      "Shoes": {
        "sales": 255254290,
        "tag": 290714000,
        "discountRate": 0.12197455230914234
      },
      "과시즌의류": {
        "sales": 2142390,
        "tag": 2557000,
        "discountRate": 0.16214704732107943
      },
      "당시즌의류": {
        "sales": 629662610,
        "tag": 760103000,
        "discountRate": 0.17160883459215392
      }
    },
    "기타": {
      "Acc_etc": {
        "sales": 122800,
        "tag": 245600,
        "discountRate": 0.5
      },
      "Bag": {
        "sales": 500500,
        "tag": 902000,
        "discountRate": 0.44512195121951215
      },
      "Headwear": {
        "sales": 860000,
        "tag": 1274000,
        "discountRate": 0.3249607535321821
      },
      "Shoes": {
        "sales": 3047480,
        "tag": 6219000,
        "discountRate": 0.5099726644155009
      },
      "과시즌의류": {
        "sales": 2427040,
        "tag": 4285000,
        "discountRate": 0.43359626604434076
      },
      "당시즌의류": {
        "sales": 12949500,
        "tag": 25661000,
        "discountRate": 0.49536261252484315
      }
    },
    "대리점": {
      "Acc_etc": {
        "sales": 10838330,
        "tag": 11427600,
        "discountRate": 0.05156550806818583
      },
      "Bag": {
        "sales": 98048310,
        "tag": 103262000,
        "discountRate": 0.05048991884720422
      },
      "Headwear": {
        "sales": 965058080,
        "tag": 1002131000,
        "discountRate": 0.03699408560357875
      },
      "Shoes": {
        "sales": 823735280,
        "tag": 868033000,
        "discountRate": 0.05103229946326926
      },
      "과시즌의류": {
        "sales": 20280660,
        "tag": 22570000,
        "discountRate": 0.10143287549844926
      },
      "당시즌의류": {
        "sales": 1523702390,
        "tag": 1617058000,
        "discountRate": 0.0577317634865292
      }
    },
    "면세점": {
      "Acc_etc": {
        "sales": 50039010,
        "tag": 67114000,
        "discountRate": 0.25441770718479007
      },
      "Bag": {
        "sales": 358097180,
        "tag": 368057000,
        "discountRate": 0.027060536819025316
      },
      "Headwear": {
        "sales": 3561810830,
        "tag": 3561822000,
        "discountRate": 3.1360354335596696e-06
      },
      "Shoes": {
        "sales": 600255160,
        "tag": 604568000,
        "discountRate": 0.0071337550118432125
      },
      "과시즌의류": {
        "sales": 43736000,
        "tag": 43736000,
        "discountRate": 0.0
      },
      "당시즌의류": {
        "sales": 1239628930,
        "tag": 1239629000,
        "discountRate": 5.646850786966695e-08
      }
    },
    "백화점": {
      "Acc_etc": {
        "sales": 23964500,
        "tag": 30853200,
        "discountRate": 0.22327343679099731
      },
      "Bag": {
        "sales": 312904750,
        "tag": 339627000,
        "discountRate": 0.0786811708138635
      },
      "Headwear": {
        "sales": 823211970,
        "tag": 856103000,
        "discountRate": 0.03841947756286335
      },
      "Shoes": {
        "sales": 908767350,
        "tag": 958263000,
        "discountRate": 0.05165142554810109
      },
      "과시즌의류": {
        "sales": 12756850,
        "tag": 19453000,
        "discountRate": 0.3442219709042307
      },
      "당시즌의류": {
        "sales": 2195406610,
        "tag": 2331021000,
        "discountRate": 0.05817810736153817
      }
    },
    "사입": {
      "Bag": {
        "sales": -52020,
        "tag": -208000,
        "discountRate": 0.0
      },
      "Headwear": {
        "sales": -167370,
        "tag": -653000,
        "discountRate": 0.0
      },
      "Shoes": {
        "sales": 82534400,
        "tag": 126072000,
        "discountRate": 0.34533917126721236
      },
      "과시즌의류": {
        "sales": 1285465380,
        "tag": 5990583000,
        "discountRate": 0.78541898509711
      }
    },
    "아울렛": {
      "Shoes": {
        "sales": 0,
        "tag": 0,
        "discountRate": 0.0
      },
      "당시즌의류": {
        "sales": 0,
        "tag": 0,
        "discountRate": 0.0
      }
    },
    "자사몰": {
      "Acc_etc": {
        "sales": 2830666,
        "tag": 3632800,
        "discountRate": 0.220803237172429
      },
      "Bag": {
        "sales": 14224162,
        "tag": 16875000,
        "discountRate": 0.15708669629629635
      },
      "Headwear": {
        "sales": 181207288,
        "tag": 237865000,
        "discountRate": 0.2381927227629117
      },
      "Shoes": {
        "sales": 138857745,
        "tag": 190572000,
        "discountRate": 0.27136334298847675
      },
      "과시즌의류": {
        "sales": 8289331,
        "tag": 9373000,
        "discountRate": 0.1156160247519471
      },
      "당시즌의류": {
        "sales": 318786899,
        "tag": 350496000,
        "discountRate": 0.0904692236145348
      }
    },
    "제휴몰": {
      "Acc_etc": {
        "sales": 3078800,
        "tag": 3111500,
        "discountRate": 0.010509400610637987
      },
      "Bag": {
        "sales": 17057900,
        "tag": 18031000,
        "discountRate": 0.053968165936442825
      },
      "Headwear": {
        "sales": 456186510,
        "tag": 457618000,
        "discountRate": 0.003128133071688577
      },
      "Shoes": {
        "sales": 147026010,
        "tag": 177306000,
        "discountRate": 0.17077814625562582
      },
      "과시즌의류": {
        "sales": 5894500,
        "tag": 6007000,
        "discountRate": 0.018728150491093776
      },
      "당시즌의류": {
        "sales": 503362980,
        "tag": 503363000,
        "discountRate": 3.973275752855443e-08
      }
    },
    "직영몰": {
      "Acc_etc": {
        "sales": 826350,
        "tag": 1267900,
        "discountRate": 0.3482530167994321
      },
      "Bag": {
        "sales": 7078770,
        "tag": 7454000,
        "discountRate": 0.05033941507915218
      },
      "Headwear": {
        "sales": 81705870,
        "tag": 83097000,
        "discountRate": 0.016741037582584162
      },
      "Shoes": {
        "sales": 39848200,
        "tag": 41531000,
        "discountRate": 0.04051913028821841
      },
      "과시즌의류": {
        "sales": 1020960,
        "tag": 1723000,
        "discountRate": 0.40745211839814277
      },
      "당시즌의류": {
        "sales": 174233330,
        "tag": 183537000,
        "discountRate": 0.05069097784098031
      }
    },
    "직영점(가두)": {
      "Acc_etc": {
        "sales": 12032380,
        "tag": 12103900,
        "discountRate": 0.005908839299729851
      },
      "Bag": {
        "sales": 45500470,
        "tag": 45642000,
        "discountRate": 0.0031008720038561144
      },
      "Headwear": {
        "sales": 441708570,
        "tag": 445959000,
        "discountRate": 0.009530988274706886
      },
      "Shoes": {
        "sales": 215266040,
        "tag": 217369000,
        "discountRate": 0.009674608614843927
      },
      "과시즌의류": {
        "sales": 10157140,
        "tag": 10160000,
        "discountRate": 0.0002814960629921037
      },
      "당시즌의류": {
        "sales": 509437430,
        "tag": 522737000,
        "discountRate": 0.02544218220634853
      }
    }
  },
  "ST": {
    "기타": {
      "Shoes": {
        "sales": 100540,
        "tag": 398000,
        "discountRate": 0.7473869346733668
      },
      "과시즌의류": {
        "sales": 272490,
        "tag": 465000,
        "discountRate": 0.41400000000000003
      },
      "차시즌의류": {
        "sales": 40370,
        "tag": 109000,
        "discountRate": 0.6296330275229358
      }
    },
    "면세점": {
      "Acc_etc": {
        "sales": 706430,
        "tag": 780600,
        "discountRate": 0.09501665385600822
      },
      "Bag": {
        "sales": 1078200,
        "tag": 1282000,
        "discountRate": 0.15897035881435262
      },
      "Headwear": {
        "sales": 309600,
        "tag": 344000,
        "discountRate": 0.09999999999999998
      },
      "Shoes": {
        "sales": 4266940,
        "tag": 13029000,
        "discountRate": 0.6725044132320208
      },
      "과시즌의류": {
        "sales": 21951450,
        "tag": 26324000,
        "discountRate": 0.1661050752165324
      },
      "당시즌의류": {
        "sales": 9690300,
        "tag": 10767000,
        "discountRate": 0.09999999999999998
      },
      "차시즌의류": {
        "sales": 589500,
        "tag": 655000,
        "discountRate": 0.09999999999999998
      }
    },
    "백화점": {
      "Acc_etc": {
        "sales": 51430,
        "tag": 57000,
        "discountRate": 0.09771929824561398
      },
      "Bag": {
        "sales": 62100,
        "tag": 69000,
        "discountRate": 0.09999999999999998
      },
      "Headwear": {
        "sales": 528500,
        "tag": 561000,
        "discountRate": 0.0579322638146168
      },
      "Shoes": {
        "sales": 644970,
        "tag": 715000,
        "discountRate": 0.09794405594405597
      },
      "과시즌의류": {
        "sales": 2237140,
        "tag": 2887000,
        "discountRate": 0.22509871839279527
      },
      "당시즌의류": {
        "sales": 3543400,
        "tag": 3919000,
        "discountRate": 0.0958407757080888
      },
      "차시즌의류": {
        "sales": 393300,
        "tag": 437000,
        "discountRate": 0.09999999999999998
      }
    },
    "아울렛": {
      "Acc_etc": {
        "sales": 1153550,
        "tag": 1279500,
        "discountRate": 0.09843688940992579
      },
      "Bag": {
        "sales": 763900,
        "tag": 1660000,
        "discountRate": 0.5398192771084338
      },
      "Headwear": {
        "sales": 1602480,
        "tag": 2007000,
        "discountRate": 0.2015545590433483
      },
      "Shoes": {
        "sales": 285930,
        "tag": 776000,
        "discountRate": 0.6315335051546391
      },
      "과시즌의류": {
        "sales": 70980620,
        "tag": 160295000,
        "discountRate": 0.5571875604354471
      },
      "당시즌의류": {
        "sales": 1175600,
        "tag": 1301000,
        "discountRate": 0.09638739431206766
      }
    },
    "자사몰": {
      "Acc_etc": {
        "sales": 1407860,
        "tag": 1688600,
        "discountRate": 0.16625607011725685
      },
      "Bag": {
        "sales": 1968710,
        "tag": 2197000,
        "discountRate": 0.10390987710514332
      },
      "Headwear": {
        "sales": 1500380,
        "tag": 1692000,
        "discountRate": 0.11325059101654844
      },
      "Shoes": {
        "sales": 250490,
        "tag": -20000,
        "discountRate": 0.0
      },
      "과시즌의류": {
        "sales": 12652880,
        "tag": 16124000,
        "discountRate": 0.21527660630116596
      },
      "당시즌의류": {
        "sales": 27513780,
        "tag": 29744000,
        "discountRate": 0.07498050026896186
      },
      "차시즌의류": {
        "sales": 273560,
        "tag": 288000,
        "discountRate": 0.050138888888888844
      }
    },
    "제휴몰": {
      "Acc_etc": {
        "sales": 1350700,
        "tag": 1385500,
        "discountRate": 0.025117286178275022
      },
      "Bag": {
        "sales": 3166800,
        "tag": 4925000,
        "discountRate": 0.356994923857868
      },
      "Headwear": {
        "sales": 1991100,
        "tag": 2472000,
        "discountRate": 0.1945388349514563
      },
      "Shoes": {
        "sales": 8013800,
        "tag": 25085000,
        "discountRate": 0.6805341837751644
      },
      "과시즌의류": {
        "sales": 118509370,
        "tag": 259736000,
        "discountRate": 0.5437314426956602
      },
      "당시즌의류": {
        "sales": 12486000,
        "tag": 12486000,
        "discountRate": 0.0
      },
      "차시즌의류": {
        "sales": 109000,
        "tag": 109000,
        "discountRate": 0.0
      }
    },
    "직영몰": {
      "Acc_etc": {
        "sales": 573520,
        "tag": 748600,
        "discountRate": 0.23387656959658032
      },
      "Bag": {
        "sales": 3738610,
        "tag": 4922000,
        "discountRate": 0.24042868752539615
      },
      "Headwear": {
        "sales": 1556700,
        "tag": 1860000,
        "discountRate": 0.16306451612903228
      },
      "Shoes": {
        "sales": 2158780,
        "tag": 3093000,
        "discountRate": 0.3020433236340123
      },
      "과시즌의류": {
        "sales": 29793270,
        "tag": 57172000,
        "discountRate": 0.4788835443923599
      },
      "당시즌의류": {
        "sales": 26135900,
        "tag": 32677000,
        "discountRate": 0.20017443461762097
      },
      "차시즌의류": {
        "sales": 1383000,
        "tag": 1936000,
        "discountRate": 0.28564049586776863
      }
    },
    "직영점(가두)": {
      "Acc_etc": {
        "sales": 285710,
        "tag": 289300,
        "discountRate": 0.012409263740062237
      },
      "Bag": {
        "sales": 1578600,
        "tag": 1631000,
        "discountRate": 0.03212752912323724
      },
      "Headwear": {
        "sales": 1106200,
        "tag": 1181000,
        "discountRate": 0.06333615580016938
      },
      "Shoes": {
        "sales": 645000,
        "tag": 645000,
        "discountRate": 0.0
      },
      "과시즌의류": {
        "sales": 16295300,
        "tag": 22138000,
        "discountRate": 0.26392176348360286
      },
      "당시즌의류": {
        "sales": 29303700,
        "tag": 30715000,
        "discountRate": 0.04594823376200552
      },
      "차시즌의류": {
        "sales": 1480000,
        "tag": 1480000,
        "discountRate": 0.0
      }
    }
  },
  "V": {
    "기타": {
      "Shoes": {
        "sales": 0,
        "tag": 0,
        "discountRate": 0.0
      },
      "당시즌의류": {
        "sales": 375420,
        "tag": 1750000,
        "discountRate": 0.7854742857142857
      }
    },
    "백화점": {
      "Acc_etc": {
        "sales": 6870290,
        "tag": 7790000,
        "discountRate": 0.11806290115532736
      },
      "Bag": {
        "sales": 18758310,
        "tag": 21360000,
        "discountRate": 0.1218019662921348
      },
      "Headwear": {
        "sales": 11927400,
        "tag": 14890000,
        "discountRate": 0.19896574882471463
      },
      "Shoes": {
        "sales": 12040720,
        "tag": 13357000,
        "discountRate": 0.09854608070674553
      },
      "과시즌의류": {
        "sales": 189926890,
        "tag": 400410000,
        "discountRate": 0.5256689643115806
      },
      "당시즌의류": {
        "sales": 1274864750,
        "tag": 1432730000,
        "discountRate": 0.11018492667843904
      }
    },
    "아울렛": {
      "Acc_etc": {
        "sales": 388800,
        "tag": 720000,
        "discountRate": 0.45999999999999996
      },
      "Bag": {
        "sales": 5066000,
        "tag": 8310000,
        "discountRate": 0.39037304452466903
      },
      "Headwear": {
        "sales": 2142680,
        "tag": 4876000,
        "discountRate": 0.560566037735849
      },
      "Shoes": {
        "sales": 4602060,
        "tag": 11157000,
        "discountRate": 0.5875181500403335
      },
      "과시즌의류": {
        "sales": 504210790,
        "tag": 1208268000,
        "discountRate": 0.5826995418235028
      },
      "당시즌의류": {
        "sales": 87666000,
        "tag": 97910000,
        "discountRate": 0.1046266979879481
      }
    },
    "자사몰": {
      "Acc_etc": {
        "sales": 425390,
        "tag": 710000,
        "discountRate": 0.40085915492957747
      },
      "Bag": {
        "sales": 6746780,
        "tag": 7690000,
        "discountRate": 0.12265539661898572
      },
      "Headwear": {
        "sales": 875060,
        "tag": 1720000,
        "discountRate": 0.49124418604651165
      },
      "Shoes": {
        "sales": 9032900,
        "tag": 11304000,
        "discountRate": 0.20091118188251944
      },
      "과시즌의류": {
        "sales": 32028520,
        "tag": 60100000,
        "discountRate": 0.46707953410981695
      },
      "당시즌의류": {
        "sales": 154321010,
        "tag": 171120000,
        "discountRate": 0.09817081580177656
      }
    },
    "제휴몰": {
      "Acc_etc": {
        "sales": 4087900,
        "tag": 5528000,
        "discountRate": 0.2605101302460202
      },
      "Bag": {
        "sales": 13767000,
        "tag": 16100000,
        "discountRate": 0.1449068322981366
      },
      "Headwear": {
        "sales": 9386600,
        "tag": 12834000,
        "discountRate": 0.2686146174224716
      },
      "Shoes": {
        "sales": 29128000,
        "tag": 31128000,
        "discountRate": 0.0642508352608584
      },
      "과시즌의류": {
        "sales": 326097010,
        "tag": 574240000,
        "discountRate": 0.4321241815268877
      },
      "당시즌의류": {
        "sales": 249837500,
        "tag": 250770000,
        "discountRate": 0.003718546875623119
      }
    },
    "직영몰": {
      "Acc_etc": {
        "sales": 207000,
        "tag": 230000,
        "discountRate": 0.09999999999999998
      },
      "Bag": {
        "sales": 1188000,
        "tag": 1320000,
        "discountRate": 0.09999999999999998
      },
      "Headwear": {
        "sales": 893500,
        "tag": 1090000,
        "discountRate": 0.18027522935779816
      },
      "Shoes": {
        "sales": 3142800,
        "tag": 3492000,
        "discountRate": 0.09999999999999998
      },
      "과시즌의류": {
        "sales": 6994400,
        "tag": 10280000,
        "discountRate": 0.3196108949416342
      },
      "당시즌의류": {
        "sales": 125897500,
        "tag": 141700000,
        "discountRate": 0.11152081863091035
      }
    },
    "직영점(가두)": {
      "Acc_etc": {
        "sales": 380000,
        "tag": 380000,
        "discountRate": 0.0
      },
      "Bag": {
        "sales": 350000,
        "tag": 350000,
        "discountRate": 0.0
      },
      "Headwear": {
        "sales": 360000,
        "tag": 360000,
        "discountRate": 0.0
      },
      "Shoes": {
        "sales": 390000,
        "tag": 390000,
        "discountRate": 0.0
      },
      "과시즌의류": {
        "sales": 1865000,
        "tag": 2060000,
        "discountRate": 0.09466019417475724
      },
      "당시즌의류": {
        "sales": 28430000,
        "tag": 28430000,
        "discountRate": 0.0
      }
    }
  },
  "W": {
    "기타": {
      "과시즌의류": {
        "sales": 0,
        "tag": 0,
        "discountRate": 0.0
      }
    },
    "대리점": {
      "Bag": {
        "sales": 126000,
        "tag": 486000,
        "discountRate": 0.7407407407407407
      },
      "Headwear": {
        "sales": 39000,
        "tag": 63000,
        "discountRate": 0.38095238095238093
      },
      "Shoes": {
        "sales": -532000,
        "tag": -1852000,
        "discountRate": 0.0
      },
      "과시즌의류": {
        "sales": 188000,
        "tag": 472000,
        "discountRate": 0.6016949152542372
      }
    },
    "자사몰": {
      "Acc_etc": {
        "sales": 27000,
        "tag": 51000,
        "discountRate": 0.47058823529411764
      },
      "Bag": {
        "sales": 1648864,
        "tag": 7022000,
        "discountRate": 0.7651859868983195
      },
      "Headwear": {
        "sales": 2773121,
        "tag": 9936000,
        "discountRate": 0.7209016706924316
      },
      "Shoes": {
        "sales": 3063530,
        "tag": 12683000,
        "discountRate": 0.7584538358432548
      },
      "과시즌의류": {
        "sales": 45866914,
        "tag": 199149000,
        "discountRate": 0.7696854415538115
      },
      "당시즌의류": {
        "sales": 19000,
        "tag": 49000,
        "discountRate": 0.6122448979591837
      }
    },
    "제휴몰": {
      "Acc_etc": {
        "sales": 99000,
        "tag": 187000,
        "discountRate": 0.47058823529411764
      },
      "Bag": {
        "sales": 2561000,
        "tag": 10471000,
        "discountRate": 0.7554197306847483
      },
      "Headwear": {
        "sales": 1749000,
        "tag": 7147000,
        "discountRate": 0.7552819364768435
      },
      "Shoes": {
        "sales": 4879000,
        "tag": 18409000,
        "discountRate": 0.734966592427617
      },
      "과시즌의류": {
        "sales": 61098000,
        "tag": 240198000,
        "discountRate": 0.7456348512477207
      },
      "당시즌의류": {
        "sales": 38000,
        "tag": 98000,
        "discountRate": 0.6122448979591837
      }
    }
  },
  "X": {
    "기타": {
      "Acc_etc": {
        "sales": 19880,
        "tag": 52000,
        "discountRate": 0.6176923076923078
      },
      "Bag": {
        "sales": 101380,
        "tag": 338000,
        "discountRate": 0.7000591715976332
      },
      "Headwear": {
        "sales": 114600,
        "tag": 173000,
        "discountRate": 0.33757225433526017
      },
      "Shoes": {
        "sales": 2461690,
        "tag": 9851000,
        "discountRate": 0.7501076032890062
      },
      "과시즌의류": {
        "sales": 2173310,
        "tag": 7398000,
        "discountRate": 0.7062300621789672
      },
      "당시즌의류": {
        "sales": 11562000,
        "tag": 37719000,
        "discountRate": 0.6934701344150163
      }
    },
    "대리점": {
      "Acc_etc": {
        "sales": 62016560,
        "tag": 85913000,
        "discountRate": 0.27814696262498106
      },
      "Bag": {
        "sales": 240731230,
        "tag": 313288000,
        "discountRate": 0.23159766732208065
      },
      "Headwear": {
        "sales": 109474080,
        "tag": 125572000,
        "discountRate": 0.12819673175548685
      },
      "Shoes": {
        "sales": 538266100,
        "tag": 609166000,
        "discountRate": 0.11638847210776704
      },
      "과시즌의류": {
        "sales": 1523900620,
        "tag": 2288144000,
        "discountRate": 0.33400143522435655
      },
      "당시즌의류": {
        "sales": 7414381940,
        "tag": 8061900000,
        "discountRate": 0.08031829469479901
      }
    },
    "면세점": {
      "Acc_etc": {
        "sales": 360100,
        "tag": 559000,
        "discountRate": 0.3558139534883721
      },
      "Bag": {
        "sales": 27447700,
        "tag": 35814000,
        "discountRate": 0.2336041771374323
      },
      "Headwear": {
        "sales": 3423110,
        "tag": 3727000,
        "discountRate": 0.08153742956801713
      },
      "Shoes": {
        "sales": 166949320,
        "tag": 212826000,
        "discountRate": 0.21555956509073138
      },
      "과시즌의류": {
        "sales": 108000,
        "tag": 108000,
        "discountRate": 0.0
      },
      "당시즌의류": {
        "sales": 1084307860,
        "tag": 1118200000,
        "discountRate": 0.030309551064210294
      }
    },
    "백화점": {
      "Acc_etc": {
        "sales": 83073630,
        "tag": 181087000,
        "discountRate": 0.5412501725689862
      },
      "Bag": {
        "sales": 192271040,
        "tag": 259252000,
        "discountRate": 0.2583623655748075
      },
      "Headwear": {
        "sales": 46886060,
        "tag": 68341000,
        "discountRate": 0.31393950922579417
      },
      "Shoes": {
        "sales": 462782900,
        "tag": 623886000,
        "discountRate": 0.2582252206332567
      },
      "과시즌의류": {
        "sales": 2861763000,
        "tag": 4724939000,
        "discountRate": 0.39432805375900093
      },
      "당시즌의류": {
        "sales": 4677371070,
        "tag": 4964039000,
        "discountRate": 0.057748927838802255
      }
    },
    "사입": {
      "Shoes": {
        "sales": -93060,
        "tag": -198000,
        "discountRate": 0.0
      },
      "과시즌의류": {
        "sales": 945290410,
        "tag": 7271474000,
        "discountRate": 0.8700001664036755
      }
    },
    "아울렛": {
      "Acc_etc": {
        "sales": 28526750,
        "tag": 56028000,
        "discountRate": 0.4908483258370815
      },
      "Bag": {
        "sales": 99732080,
        "tag": 150395000,
        "discountRate": 0.33686572026995576
      },
      "Headwear": {
        "sales": 44468580,
        "tag": 79414000,
        "discountRate": 0.4400410506963508
      },
      "Shoes": {
        "sales": 173948980,
        "tag": 244344000,
        "discountRate": 0.28809800936384766
      },
      "과시즌의류": {
        "sales": 6501803370,
        "tag": 10659829000,
        "discountRate": 0.3900649466328212
      },
      "당시즌의류": {
        "sales": 1567752660,
        "tag": 1648514000,
        "discountRate": 0.048990387706746796
      }
    },
    "자사몰": {
      "Acc_etc": {
        "sales": 12547690,
        "tag": 16768000,
        "discountRate": 0.25168833492366416
      },
      "Bag": {
        "sales": 24488510,
        "tag": 32753000,
        "discountRate": 0.25232772570451567
      },
      "Headwear": {
        "sales": 7444510,
        "tag": 9353000,
        "discountRate": 0.2040511065968138
      },
      "Shoes": {
        "sales": 168579050,
        "tag": 223169000,
        "discountRate": 0.24461260300489762
      },
      "과시즌의류": {
        "sales": 8713459,
        "tag": 10327000,
        "discountRate": 0.15624489203059944
      },
      "당시즌의류": {
        "sales": 1035115810,
        "tag": 1136938000,
        "discountRate": 0.08955826087262453
      }
    },
    "제휴몰": {
      "Acc_etc": {
        "sales": 135177890,
        "tag": 152490000,
        "discountRate": 0.11352947734277663
      },
      "Bag": {
        "sales": 87662250,
        "tag": 126684000,
        "discountRate": 0.3080242966751918
      },
      "Headwear": {
        "sales": 16481900,
        "tag": 24792000,
        "discountRate": 0.3351928041303647
      },
      "Shoes": {
        "sales": 261769500,
        "tag": 328081000,
        "discountRate": 0.20211929371100434
      },
      "과시즌의류": {
        "sales": 1140970230,
        "tag": 1809383000,
        "discountRate": 0.369414750774159
      },
      "당시즌의류": {
        "sales": 1413057720,
        "tag": 1461223000,
        "discountRate": 0.032962306232518945
      }
    },
    "직영몰": {
      "Acc_etc": {
        "sales": 2092600,
        "tag": 2429000,
        "discountRate": 0.13849320708110335
      },
      "Bag": {
        "sales": 9546270,
        "tag": 10092000,
        "discountRate": 0.05407550535077288
      },
      "Headwear": {
        "sales": 4884850,
        "tag": 5114000,
        "discountRate": 0.044808369182635865
      },
      "Shoes": {
        "sales": 46073050,
        "tag": 49116000,
        "discountRate": 0.0619543529603388
      },
      "과시즌의류": {
        "sales": 66947400,
        "tag": 108166000,
        "discountRate": 0.3810679880923765
      },
      "당시즌의류": {
        "sales": 619304230,
        "tag": 644973000,
        "discountRate": 0.03979820860718197
      }
    },
    "직영점(가두)": {
      "Acc_etc": {
        "sales": 2124680,
        "tag": 2183000,
        "discountRate": 0.02671552908841046
      },
      "Bag": {
        "sales": 7441500,
        "tag": 7792000,
        "discountRate": 0.04498203285420943
      },
      "Headwear": {
        "sales": 8645290,
        "tag": 8787000,
        "discountRate": 0.01612723341299649
      },
      "Shoes": {
        "sales": 20473280,
        "tag": 21350000,
        "discountRate": 0.041064168618267005
      },
      "과시즌의류": {
        "sales": 21500,
        "tag": 35000,
        "discountRate": 0.3857142857142857
      },
      "당시즌의류": {
        "sales": 284614000,
        "tag": 329135000,
        "discountRate": 0.13526668388351282
      }
    }
  }
};
  var itemMetrics = {
  "I": {
    "Acc_etc": {
      "sales": 45666340,
      "tag": 90653700,
      "discountRate": 0.49625508942271523
    },
    "Bag": {
      "sales": 124083750,
      "tag": 185126000,
      "discountRate": 0.3297335328370947
    },
    "Headwear": {
      "sales": 433477470,
      "tag": 665518000,
      "discountRate": 0.3486615388314065
    },
    "Shoes": {
      "sales": 715897440,
      "tag": 1008318000,
      "discountRate": 0.29000827120015704
    },
    "과시즌의류": {
      "sales": 1097792380,
      "tag": 3800558000,
      "discountRate": 0.711149683809588
    },
    "당시즌의류": {
      "sales": 2439920200,
      "tag": 2556386000,
      "discountRate": 0.04555876929383906
    }
  },
  "M": {
    "Acc_etc": {
      "sales": 111006776,
      "tag": 138437100,
      "discountRate": 0.1981428677717173
    },
    "Bag": {
      "sales": 890637032,
      "tag": 941047000,
      "discountRate": 0.05356795994248964
    },
    "Headwear": {
      "sales": 6736155738,
      "tag": 6901199000,
      "discountRate": 0.02391515764144747
    },
    "Shoes": {
      "sales": 3214591955,
      "tag": 3480647000,
      "discountRate": 0.07643838774802503
    },
    "과시즌의류": {
      "sales": 1392170251,
      "tag": 6110447000,
      "discountRate": 0.7721655631740199
    },
    "당시즌의류": {
      "sales": 7107170679,
      "tag": 7533605000,
      "discountRate": 0.05660428453575683
    }
  },
  "ST": {
    "Acc_etc": {
      "sales": 5529200,
      "tag": 6229100,
      "discountRate": 0.11235973094026419
    },
    "Bag": {
      "sales": 12356920,
      "tag": 16686000,
      "discountRate": 0.25944384513963803
    },
    "Headwear": {
      "sales": 8594960,
      "tag": 10117000,
      "discountRate": 0.15044380745280217
    },
    "Shoes": {
      "sales": 16366450,
      "tag": 43721000,
      "discountRate": 0.6256615813910935
    },
    "과시즌의류": {
      "sales": 272692520,
      "tag": 545141000,
      "discountRate": 0.49977616800057234
    },
    "당시즌의류": {
      "sales": 109848680,
      "tag": 121609000,
      "discountRate": 0.09670600037826149
    },
    "차시즌의류": {
      "sales": 4268730,
      "tag": 5014000,
      "discountRate": 0.14863781412046273
    }
  },
  "V": {
    "Acc_etc": {
      "sales": 12359380,
      "tag": 15358000,
      "discountRate": 0.19524807917697617
    },
    "Bag": {
      "sales": 45876090,
      "tag": 55130000,
      "discountRate": 0.16785615817159438
    },
    "Headwear": {
      "sales": 25585240,
      "tag": 35770000,
      "discountRate": 0.2847291025999441
    },
    "Shoes": {
      "sales": 58336480,
      "tag": 70828000,
      "discountRate": 0.1763641497712769
    },
    "과시즌의류": {
      "sales": 1061122610,
      "tag": 2255358000,
      "discountRate": 0.5295103438123792
    },
    "당시즌의류": {
      "sales": 1921392180,
      "tag": 2124410000,
      "discountRate": 0.09556433080243454
    }
  },
  "W": {
    "Acc_etc": {
      "sales": 126000,
      "tag": 238000,
      "discountRate": 0.47058823529411764
    },
    "Bag": {
      "sales": 4335864,
      "tag": 17979000,
      "discountRate": 0.7588373101952277
    },
    "Headwear": {
      "sales": 4561121,
      "tag": 17146000,
      "discountRate": 0.7339833780473579
    },
    "Shoes": {
      "sales": 7410530,
      "tag": 29240000,
      "discountRate": 0.746561901504788
    },
    "과시즌의류": {
      "sales": 107152914,
      "tag": 439819000,
      "discountRate": 0.7563704296540168
    },
    "당시즌의류": {
      "sales": 57000,
      "tag": 147000,
      "discountRate": 0.6122448979591837
    }
  },
  "X": {
    "Acc_etc": {
      "sales": 325939780,
      "tag": 497509000,
      "discountRate": 0.3448565151585198
    },
    "Bag": {
      "sales": 689421960,
      "tag": 936408000,
      "discountRate": 0.26375900248609585
    },
    "Headwear": {
      "sales": 241822980,
      "tag": 325273000,
      "discountRate": 0.256553787126506
    },
    "Shoes": {
      "sales": 1841210810,
      "tag": 2321591000,
      "discountRate": 0.20691852699291136
    },
    "과시즌의류": {
      "sales": 13051691299,
      "tag": 26879803000,
      "discountRate": 0.5144424496340245
    },
    "당시즌의류": {
      "sales": 18107467290,
      "tag": 19402641000,
      "discountRate": 0.06675244416468873
    }
  }
};
  var itemChannelMetrics = {
  "I": {
    "Acc_etc": {
      "기타": {
        "sales": 34250,
        "tag": 68500,
        "discountRate": 0.5
      },
      "대리점": {
        "sales": 2205840,
        "tag": 2310800,
        "discountRate": 0.04542149904794879
      },
      "면세점": {
        "sales": 5387800,
        "tag": 5387800,
        "discountRate": 0.0
      },
      "백화점": {
        "sales": 12578120,
        "tag": 12989400,
        "discountRate": 0.031662740388316624
      },
      "사입": {
        "sales": 6552050,
        "tag": 50019100,
        "discountRate": 0.869009038547275
      },
      "자사몰": {
        "sales": 4955550,
        "tag": 5822900,
        "discountRate": 0.14895498806436658
      },
      "제휴몰": {
        "sales": 10443200,
        "tag": 10443200,
        "discountRate": 0.0
      },
      "직영몰": {
        "sales": 2320030,
        "tag": 2422000,
        "discountRate": 0.04210156895127992
      },
      "직영점(가두)": {
        "sales": 1189500,
        "tag": 1190000,
        "discountRate": 0.00042016806722688926
      }
    },
    "Bag": {
      "대리점": {
        "sales": 26775660,
        "tag": 27830000,
        "discountRate": 0.03788501616960116
      },
      "면세점": {
        "sales": 27648000,
        "tag": 27867000,
        "discountRate": 0.007858757670362815
      },
      "백화점": {
        "sales": 42751550,
        "tag": 49293000,
        "discountRate": 0.1327054551356176
      },
      "사입": {
        "sales": 5525130,
        "tag": 49902000,
        "discountRate": 0.8892803895635446
      },
      "자사몰": {
        "sales": 2859500,
        "tag": 3975000,
        "discountRate": 0.2806289308176101
      },
      "제휴몰": {
        "sales": 13020470,
        "tag": 20483000,
        "discountRate": 0.36432797929990723
      },
      "직영몰": {
        "sales": 3652100,
        "tag": 3879000,
        "discountRate": 0.058494457334364536
      },
      "직영점(가두)": {
        "sales": 1851340,
        "tag": 1897000,
        "discountRate": 0.02406958355297839
      }
    },
    "Headwear": {
      "기타": {
        "sales": 13270,
        "tag": 39000,
        "discountRate": 0.6597435897435897
      },
      "대리점": {
        "sales": 36018210,
        "tag": 36941000,
        "discountRate": 0.024980103408137277
      },
      "면세점": {
        "sales": 106149940,
        "tag": 106150000,
        "discountRate": 5.652378709530836e-07
      },
      "백화점": {
        "sales": 121941380,
        "tag": 125241000,
        "discountRate": 0.026346164594661547
      },
      "사입": {
        "sales": 79288930,
        "tag": 302711000,
        "discountRate": 0.7380705359237028
      },
      "자사몰": {
        "sales": 15960930,
        "tag": 19519000,
        "discountRate": 0.1822875147292382
      },
      "제휴몰": {
        "sales": 39409080,
        "tag": 39422000,
        "discountRate": 0.0003277357820505866
      },
      "직영몰": {
        "sales": 24318570,
        "tag": 25104000,
        "discountRate": 0.03128704588910136
      },
      "직영점(가두)": {
        "sales": 10377160,
        "tag": 10391000,
        "discountRate": 0.0013319218554518342
      }
    },
    "Shoes": {
      "기타": {
        "sales": 593500,
        "tag": 732000,
        "discountRate": 0.18920765027322406
      },
      "대리점": {
        "sales": 71229720,
        "tag": 73752000,
        "discountRate": 0.03419947933615364
      },
      "면세점": {
        "sales": 29643000,
        "tag": 29643000,
        "discountRate": 0.0
      },
      "백화점": {
        "sales": 256748010,
        "tag": 270114000,
        "discountRate": 0.04948277393989209
      },
      "사입": {
        "sales": 88820830,
        "tag": 355282000,
        "discountRate": 0.749999071160374
      },
      "자사몰": {
        "sales": 46480560,
        "tag": 54182000,
        "discountRate": 0.14214019416042223
      },
      "제휴몰": {
        "sales": 177363410,
        "tag": 178482000,
        "discountRate": 0.006267242635111692
      },
      "직영몰": {
        "sales": 34395410,
        "tag": 35508000,
        "discountRate": 0.031333502309338734
      },
      "직영점(가두)": {
        "sales": 10623000,
        "tag": 10623000,
        "discountRate": 0.0
      }
    },
    "과시즌의류": {
      "기타": {
        "sales": 674350,
        "tag": 1899000,
        "discountRate": 0.6448920484465508
      },
      "대리점": {
        "sales": 511000,
        "tag": 590000,
        "discountRate": 0.13389830508474576
      },
      "면세점": {
        "sales": 354000,
        "tag": 354000,
        "discountRate": 0.0
      },
      "백화점": {
        "sales": 59722530,
        "tag": 96598000,
        "discountRate": 0.3817415474440464
      },
      "사입": {
        "sales": 956117400,
        "tag": 3560767000,
        "discountRate": 0.7314855479170639
      },
      "자사몰": {
        "sales": 305940,
        "tag": 364000,
        "discountRate": 0.15950549450549456
      },
      "제휴몰": {
        "sales": 79087760,
        "tag": 138693000,
        "discountRate": 0.42976386695795754
      },
      "직영몰": {
        "sales": 665400,
        "tag": 939000,
        "discountRate": 0.29137380191693296
      },
      "직영점(가두)": {
        "sales": 354000,
        "tag": 354000,
        "discountRate": 0.0
      }
    },
    "당시즌의류": {
      "기타": {
        "sales": 1988300,
        "tag": 5535000,
        "discountRate": 0.640776874435411
      },
      "대리점": {
        "sales": 360948870,
        "tag": 374752000,
        "discountRate": 0.036832705362479734
      },
      "면세점": {
        "sales": 171366970,
        "tag": 171367000,
        "discountRate": 1.7506287675050913e-07
      },
      "백화점": {
        "sales": 1111659140,
        "tag": 1159579000,
        "discountRate": 0.041325222343626455
      },
      "자사몰": {
        "sales": 208684340,
        "tag": 246314000,
        "discountRate": 0.1527710970549786
      },
      "제휴몰": {
        "sales": 425411860,
        "tag": 425412000,
        "discountRate": 3.290927382826325e-07
      },
      "직영몰": {
        "sales": 103623710,
        "tag": 117057000,
        "discountRate": 0.11475853643951239
      },
      "직영점(가두)": {
        "sales": 56237010,
        "tag": 56370000,
        "discountRate": 0.0023592336349121945
      }
    }
  },
  "M": {
    "Acc_etc": {
      "RF": {
        "sales": 7273940,
        "tag": 8680600,
        "discountRate": 0.16204640232242007
      },
      "기타": {
        "sales": 122800,
        "tag": 245600,
        "discountRate": 0.5
      },
      "대리점": {
        "sales": 10838330,
        "tag": 11427600,
        "discountRate": 0.05156550806818583
      },
      "면세점": {
        "sales": 50039010,
        "tag": 67114000,
        "discountRate": 0.25441770718479007
      },
      "백화점": {
        "sales": 23964500,
        "tag": 30853200,
        "discountRate": 0.22327343679099731
      },
      "자사몰": {
        "sales": 2830666,
        "tag": 3632800,
        "discountRate": 0.220803237172429
      },
      "제휴몰": {
        "sales": 3078800,
        "tag": 3111500,
        "discountRate": 0.010509400610637987
      },
      "직영몰": {
        "sales": 826350,
        "tag": 1267900,
        "discountRate": 0.3482530167994321
      },
      "직영점(가두)": {
        "sales": 12032380,
        "tag": 12103900,
        "discountRate": 0.005908839299729851
      }
    },
    "Bag": {
      "RF": {
        "sales": 37277010,
        "tag": 41405000,
        "discountRate": 0.09969786257698343
      },
      "기타": {
        "sales": 500500,
        "tag": 902000,
        "discountRate": 0.44512195121951215
      },
      "대리점": {
        "sales": 98048310,
        "tag": 103262000,
        "discountRate": 0.05048991884720422
      },
      "면세점": {
        "sales": 358097180,
        "tag": 368057000,
        "discountRate": 0.027060536819025316
      },
      "백화점": {
        "sales": 312904750,
        "tag": 339627000,
        "discountRate": 0.0786811708138635
      },
      "사입": {
        "sales": -52020,
        "tag": -208000,
        "discountRate": 0.0
      },
      "자사몰": {
        "sales": 14224162,
        "tag": 16875000,
        "discountRate": 0.15708669629629635
      },
      "제휴몰": {
        "sales": 17057900,
        "tag": 18031000,
        "discountRate": 0.053968165936442825
      },
      "직영몰": {
        "sales": 7078770,
        "tag": 7454000,
        "discountRate": 0.05033941507915218
      },
      "직영점(가두)": {
        "sales": 45500470,
        "tag": 45642000,
        "discountRate": 0.0031008720038561144
      }
    },
    "Headwear": {
      "RF": {
        "sales": 224573990,
        "tag": 255983000,
        "discountRate": 0.12269959333236968
      },
      "기타": {
        "sales": 860000,
        "tag": 1274000,
        "discountRate": 0.3249607535321821
      },
      "대리점": {
        "sales": 965058080,
        "tag": 1002131000,
        "discountRate": 0.03699408560357875
      },
      "면세점": {
        "sales": 3561810830,
        "tag": 3561822000,
        "discountRate": 3.1360354335596696e-06
      },
      "백화점": {
        "sales": 823211970,
        "tag": 856103000,
        "discountRate": 0.03841947756286335
      },
      "사입": {
        "sales": -167370,
        "tag": -653000,
        "discountRate": 0.0
      },
      "자사몰": {
        "sales": 181207288,
        "tag": 237865000,
        "discountRate": 0.2381927227629117
      },
      "제휴몰": {
        "sales": 456186510,
        "tag": 457618000,
        "discountRate": 0.003128133071688577
      },
      "직영몰": {
        "sales": 81705870,
        "tag": 83097000,
        "discountRate": 0.016741037582584162
      },
      "직영점(가두)": {
        "sales": 441708570,
        "tag": 445959000,
        "discountRate": 0.009530988274706886
      }
    },
    "Shoes": {
      "RF": {
        "sales": 255254290,
        "tag": 290714000,
        "discountRate": 0.12197455230914234
      },
      "기타": {
        "sales": 3047480,
        "tag": 6219000,
        "discountRate": 0.5099726644155009
      },
      "대리점": {
        "sales": 823735280,
        "tag": 868033000,
        "discountRate": 0.05103229946326926
      },
      "면세점": {
        "sales": 600255160,
        "tag": 604568000,
        "discountRate": 0.0071337550118432125
      },
      "백화점": {
        "sales": 908767350,
        "tag": 958263000,
        "discountRate": 0.05165142554810109
      },
      "사입": {
        "sales": 82534400,
        "tag": 126072000,
        "discountRate": 0.34533917126721236
      },
      "아울렛": {
        "sales": 0,
        "tag": 0,
        "discountRate": 0.0
      },
      "자사몰": {
        "sales": 138857745,
        "tag": 190572000,
        "discountRate": 0.27136334298847675
      },
      "제휴몰": {
        "sales": 147026010,
        "tag": 177306000,
        "discountRate": 0.17077814625562582
      },
      "직영몰": {
        "sales": 39848200,
        "tag": 41531000,
        "discountRate": 0.04051913028821841
      },
      "직영점(가두)": {
        "sales": 215266040,
        "tag": 217369000,
        "discountRate": 0.009674608614843927
      }
    },
    "과시즌의류": {
      "RF": {
        "sales": 2142390,
        "tag": 2557000,
        "discountRate": 0.16214704732107943
      },
      "기타": {
        "sales": 2427040,
        "tag": 4285000,
        "discountRate": 0.43359626604434076
      },
      "대리점": {
        "sales": 20280660,
        "tag": 22570000,
        "discountRate": 0.10143287549844926
      },
      "면세점": {
        "sales": 43736000,
        "tag": 43736000,
        "discountRate": 0.0
      },
      "백화점": {
        "sales": 12756850,
        "tag": 19453000,
        "discountRate": 0.3442219709042307
      },
      "사입": {
        "sales": 1285465380,
        "tag": 5990583000,
        "discountRate": 0.78541898509711
      },
      "자사몰": {
        "sales": 8289331,
        "tag": 9373000,
        "discountRate": 0.1156160247519471
      },
      "제휴몰": {
        "sales": 5894500,
        "tag": 6007000,
        "discountRate": 0.018728150491093776
      },
      "직영몰": {
        "sales": 1020960,
        "tag": 1723000,
        "discountRate": 0.40745211839814277
      },
      "직영점(가두)": {
        "sales": 10157140,
        "tag": 10160000,
        "discountRate": 0.0002814960629921037
      }
    },
    "당시즌의류": {
      "RF": {
        "sales": 629662610,
        "tag": 760103000,
        "discountRate": 0.17160883459215392
      },
      "기타": {
        "sales": 12949500,
        "tag": 25661000,
        "discountRate": 0.49536261252484315
      },
      "대리점": {
        "sales": 1523702390,
        "tag": 1617058000,
        "discountRate": 0.0577317634865292
      },
      "면세점": {
        "sales": 1239628930,
        "tag": 1239629000,
        "discountRate": 5.646850786966695e-08
      },
      "백화점": {
        "sales": 2195406610,
        "tag": 2331021000,
        "discountRate": 0.05817810736153817
      },
      "아울렛": {
        "sales": 0,
        "tag": 0,
        "discountRate": 0.0
      },
      "자사몰": {
        "sales": 318786899,
        "tag": 350496000,
        "discountRate": 0.0904692236145348
      },
      "제휴몰": {
        "sales": 503362980,
        "tag": 503363000,
        "discountRate": 3.973275752855443e-08
      },
      "직영몰": {
        "sales": 174233330,
        "tag": 183537000,
        "discountRate": 0.05069097784098031
      },
      "직영점(가두)": {
        "sales": 509437430,
        "tag": 522737000,
        "discountRate": 0.02544218220634853
      }
    }
  },
  "ST": {
    "Acc_etc": {
      "면세점": {
        "sales": 706430,
        "tag": 780600,
        "discountRate": 0.09501665385600822
      },
      "백화점": {
        "sales": 51430,
        "tag": 57000,
        "discountRate": 0.09771929824561398
      },
      "아울렛": {
        "sales": 1153550,
        "tag": 1279500,
        "discountRate": 0.09843688940992579
      },
      "자사몰": {
        "sales": 1407860,
        "tag": 1688600,
        "discountRate": 0.16625607011725685
      },
      "제휴몰": {
        "sales": 1350700,
        "tag": 1385500,
        "discountRate": 0.025117286178275022
      },
      "직영몰": {
        "sales": 573520,
        "tag": 748600,
        "discountRate": 0.23387656959658032
      },
      "직영점(가두)": {
        "sales": 285710,
        "tag": 289300,
        "discountRate": 0.012409263740062237
      }
    },
    "Bag": {
      "면세점": {
        "sales": 1078200,
        "tag": 1282000,
        "discountRate": 0.15897035881435262
      },
      "백화점": {
        "sales": 62100,
        "tag": 69000,
        "discountRate": 0.09999999999999998
      },
      "아울렛": {
        "sales": 763900,
        "tag": 1660000,
        "discountRate": 0.5398192771084338
      },
      "자사몰": {
        "sales": 1968710,
        "tag": 2197000,
        "discountRate": 0.10390987710514332
      },
      "제휴몰": {
        "sales": 3166800,
        "tag": 4925000,
        "discountRate": 0.356994923857868
      },
      "직영몰": {
        "sales": 3738610,
        "tag": 4922000,
        "discountRate": 0.24042868752539615
      },
      "직영점(가두)": {
        "sales": 1578600,
        "tag": 1631000,
        "discountRate": 0.03212752912323724
      }
    },
    "Headwear": {
      "면세점": {
        "sales": 309600,
        "tag": 344000,
        "discountRate": 0.09999999999999998
      },
      "백화점": {
        "sales": 528500,
        "tag": 561000,
        "discountRate": 0.0579322638146168
      },
      "아울렛": {
        "sales": 1602480,
        "tag": 2007000,
        "discountRate": 0.2015545590433483
      },
      "자사몰": {
        "sales": 1500380,
        "tag": 1692000,
        "discountRate": 0.11325059101654844
      },
      "제휴몰": {
        "sales": 1991100,
        "tag": 2472000,
        "discountRate": 0.1945388349514563
      },
      "직영몰": {
        "sales": 1556700,
        "tag": 1860000,
        "discountRate": 0.16306451612903228
      },
      "직영점(가두)": {
        "sales": 1106200,
        "tag": 1181000,
        "discountRate": 0.06333615580016938
      }
    },
    "Shoes": {
      "기타": {
        "sales": 100540,
        "tag": 398000,
        "discountRate": 0.7473869346733668
      },
      "면세점": {
        "sales": 4266940,
        "tag": 13029000,
        "discountRate": 0.6725044132320208
      },
      "백화점": {
        "sales": 644970,
        "tag": 715000,
        "discountRate": 0.09794405594405597
      },
      "아울렛": {
        "sales": 285930,
        "tag": 776000,
        "discountRate": 0.6315335051546391
      },
      "자사몰": {
        "sales": 250490,
        "tag": -20000,
        "discountRate": 0.0
      },
      "제휴몰": {
        "sales": 8013800,
        "tag": 25085000,
        "discountRate": 0.6805341837751644
      },
      "직영몰": {
        "sales": 2158780,
        "tag": 3093000,
        "discountRate": 0.3020433236340123
      },
      "직영점(가두)": {
        "sales": 645000,
        "tag": 645000,
        "discountRate": 0.0
      }
    },
    "과시즌의류": {
      "기타": {
        "sales": 272490,
        "tag": 465000,
        "discountRate": 0.41400000000000003
      },
      "면세점": {
        "sales": 21951450,
        "tag": 26324000,
        "discountRate": 0.1661050752165324
      },
      "백화점": {
        "sales": 2237140,
        "tag": 2887000,
        "discountRate": 0.22509871839279527
      },
      "아울렛": {
        "sales": 70980620,
        "tag": 160295000,
        "discountRate": 0.5571875604354471
      },
      "자사몰": {
        "sales": 12652880,
        "tag": 16124000,
        "discountRate": 0.21527660630116596
      },
      "제휴몰": {
        "sales": 118509370,
        "tag": 259736000,
        "discountRate": 0.5437314426956602
      },
      "직영몰": {
        "sales": 29793270,
        "tag": 57172000,
        "discountRate": 0.4788835443923599
      },
      "직영점(가두)": {
        "sales": 16295300,
        "tag": 22138000,
        "discountRate": 0.26392176348360286
      }
    },
    "당시즌의류": {
      "면세점": {
        "sales": 9690300,
        "tag": 10767000,
        "discountRate": 0.09999999999999998
      },
      "백화점": {
        "sales": 3543400,
        "tag": 3919000,
        "discountRate": 0.0958407757080888
      },
      "아울렛": {
        "sales": 1175600,
        "tag": 1301000,
        "discountRate": 0.09638739431206766
      },
      "자사몰": {
        "sales": 27513780,
        "tag": 29744000,
        "discountRate": 0.07498050026896186
      },
      "제휴몰": {
        "sales": 12486000,
        "tag": 12486000,
        "discountRate": 0.0
      },
      "직영몰": {
        "sales": 26135900,
        "tag": 32677000,
        "discountRate": 0.20017443461762097
      },
      "직영점(가두)": {
        "sales": 29303700,
        "tag": 30715000,
        "discountRate": 0.04594823376200552
      }
    },
    "차시즌의류": {
      "기타": {
        "sales": 40370,
        "tag": 109000,
        "discountRate": 0.6296330275229358
      },
      "면세점": {
        "sales": 589500,
        "tag": 655000,
        "discountRate": 0.09999999999999998
      },
      "백화점": {
        "sales": 393300,
        "tag": 437000,
        "discountRate": 0.09999999999999998
      },
      "자사몰": {
        "sales": 273560,
        "tag": 288000,
        "discountRate": 0.050138888888888844
      },
      "제휴몰": {
        "sales": 109000,
        "tag": 109000,
        "discountRate": 0.0
      },
      "직영몰": {
        "sales": 1383000,
        "tag": 1936000,
        "discountRate": 0.28564049586776863
      },
      "직영점(가두)": {
        "sales": 1480000,
        "tag": 1480000,
        "discountRate": 0.0
      }
    }
  },
  "V": {
    "Acc_etc": {
      "백화점": {
        "sales": 6870290,
        "tag": 7790000,
        "discountRate": 0.11806290115532736
      },
      "아울렛": {
        "sales": 388800,
        "tag": 720000,
        "discountRate": 0.45999999999999996
      },
      "자사몰": {
        "sales": 425390,
        "tag": 710000,
        "discountRate": 0.40085915492957747
      },
      "제휴몰": {
        "sales": 4087900,
        "tag": 5528000,
        "discountRate": 0.2605101302460202
      },
      "직영몰": {
        "sales": 207000,
        "tag": 230000,
        "discountRate": 0.09999999999999998
      },
      "직영점(가두)": {
        "sales": 380000,
        "tag": 380000,
        "discountRate": 0.0
      }
    },
    "Bag": {
      "백화점": {
        "sales": 18758310,
        "tag": 21360000,
        "discountRate": 0.1218019662921348
      },
      "아울렛": {
        "sales": 5066000,
        "tag": 8310000,
        "discountRate": 0.39037304452466903
      },
      "자사몰": {
        "sales": 6746780,
        "tag": 7690000,
        "discountRate": 0.12265539661898572
      },
      "제휴몰": {
        "sales": 13767000,
        "tag": 16100000,
        "discountRate": 0.1449068322981366
      },
      "직영몰": {
        "sales": 1188000,
        "tag": 1320000,
        "discountRate": 0.09999999999999998
      },
      "직영점(가두)": {
        "sales": 350000,
        "tag": 350000,
        "discountRate": 0.0
      }
    },
    "Headwear": {
      "백화점": {
        "sales": 11927400,
        "tag": 14890000,
        "discountRate": 0.19896574882471463
      },
      "아울렛": {
        "sales": 2142680,
        "tag": 4876000,
        "discountRate": 0.560566037735849
      },
      "자사몰": {
        "sales": 875060,
        "tag": 1720000,
        "discountRate": 0.49124418604651165
      },
      "제휴몰": {
        "sales": 9386600,
        "tag": 12834000,
        "discountRate": 0.2686146174224716
      },
      "직영몰": {
        "sales": 893500,
        "tag": 1090000,
        "discountRate": 0.18027522935779816
      },
      "직영점(가두)": {
        "sales": 360000,
        "tag": 360000,
        "discountRate": 0.0
      }
    },
    "Shoes": {
      "기타": {
        "sales": 0,
        "tag": 0,
        "discountRate": 0.0
      },
      "백화점": {
        "sales": 12040720,
        "tag": 13357000,
        "discountRate": 0.09854608070674553
      },
      "아울렛": {
        "sales": 4602060,
        "tag": 11157000,
        "discountRate": 0.5875181500403335
      },
      "자사몰": {
        "sales": 9032900,
        "tag": 11304000,
        "discountRate": 0.20091118188251944
      },
      "제휴몰": {
        "sales": 29128000,
        "tag": 31128000,
        "discountRate": 0.0642508352608584
      },
      "직영몰": {
        "sales": 3142800,
        "tag": 3492000,
        "discountRate": 0.09999999999999998
      },
      "직영점(가두)": {
        "sales": 390000,
        "tag": 390000,
        "discountRate": 0.0
      }
    },
    "과시즌의류": {
      "백화점": {
        "sales": 189926890,
        "tag": 400410000,
        "discountRate": 0.5256689643115806
      },
      "아울렛": {
        "sales": 504210790,
        "tag": 1208268000,
        "discountRate": 0.5826995418235028
      },
      "자사몰": {
        "sales": 32028520,
        "tag": 60100000,
        "discountRate": 0.46707953410981695
      },
      "제휴몰": {
        "sales": 326097010,
        "tag": 574240000,
        "discountRate": 0.4321241815268877
      },
      "직영몰": {
        "sales": 6994400,
        "tag": 10280000,
        "discountRate": 0.3196108949416342
      },
      "직영점(가두)": {
        "sales": 1865000,
        "tag": 2060000,
        "discountRate": 0.09466019417475724
      }
    },
    "당시즌의류": {
      "기타": {
        "sales": 375420,
        "tag": 1750000,
        "discountRate": 0.7854742857142857
      },
      "백화점": {
        "sales": 1274864750,
        "tag": 1432730000,
        "discountRate": 0.11018492667843904
      },
      "아울렛": {
        "sales": 87666000,
        "tag": 97910000,
        "discountRate": 0.1046266979879481
      },
      "자사몰": {
        "sales": 154321010,
        "tag": 171120000,
        "discountRate": 0.09817081580177656
      },
      "제휴몰": {
        "sales": 249837500,
        "tag": 250770000,
        "discountRate": 0.003718546875623119
      },
      "직영몰": {
        "sales": 125897500,
        "tag": 141700000,
        "discountRate": 0.11152081863091035
      },
      "직영점(가두)": {
        "sales": 28430000,
        "tag": 28430000,
        "discountRate": 0.0
      }
    }
  },
  "W": {
    "Acc_etc": {
      "자사몰": {
        "sales": 27000,
        "tag": 51000,
        "discountRate": 0.47058823529411764
      },
      "제휴몰": {
        "sales": 99000,
        "tag": 187000,
        "discountRate": 0.47058823529411764
      }
    },
    "Bag": {
      "대리점": {
        "sales": 126000,
        "tag": 486000,
        "discountRate": 0.7407407407407407
      },
      "자사몰": {
        "sales": 1648864,
        "tag": 7022000,
        "discountRate": 0.7651859868983195
      },
      "제휴몰": {
        "sales": 2561000,
        "tag": 10471000,
        "discountRate": 0.7554197306847483
      }
    },
    "Headwear": {
      "대리점": {
        "sales": 39000,
        "tag": 63000,
        "discountRate": 0.38095238095238093
      },
      "자사몰": {
        "sales": 2773121,
        "tag": 9936000,
        "discountRate": 0.7209016706924316
      },
      "제휴몰": {
        "sales": 1749000,
        "tag": 7147000,
        "discountRate": 0.7552819364768435
      }
    },
    "Shoes": {
      "대리점": {
        "sales": -532000,
        "tag": -1852000,
        "discountRate": 0.0
      },
      "자사몰": {
        "sales": 3063530,
        "tag": 12683000,
        "discountRate": 0.7584538358432548
      },
      "제휴몰": {
        "sales": 4879000,
        "tag": 18409000,
        "discountRate": 0.734966592427617
      }
    },
    "과시즌의류": {
      "기타": {
        "sales": 0,
        "tag": 0,
        "discountRate": 0.0
      },
      "대리점": {
        "sales": 188000,
        "tag": 472000,
        "discountRate": 0.6016949152542372
      },
      "자사몰": {
        "sales": 45866914,
        "tag": 199149000,
        "discountRate": 0.7696854415538115
      },
      "제휴몰": {
        "sales": 61098000,
        "tag": 240198000,
        "discountRate": 0.7456348512477207
      }
    },
    "당시즌의류": {
      "자사몰": {
        "sales": 19000,
        "tag": 49000,
        "discountRate": 0.6122448979591837
      },
      "제휴몰": {
        "sales": 38000,
        "tag": 98000,
        "discountRate": 0.6122448979591837
      }
    }
  },
  "X": {
    "Acc_etc": {
      "기타": {
        "sales": 19880,
        "tag": 52000,
        "discountRate": 0.6176923076923078
      },
      "대리점": {
        "sales": 62016560,
        "tag": 85913000,
        "discountRate": 0.27814696262498106
      },
      "면세점": {
        "sales": 360100,
        "tag": 559000,
        "discountRate": 0.3558139534883721
      },
      "백화점": {
        "sales": 83073630,
        "tag": 181087000,
        "discountRate": 0.5412501725689862
      },
      "아울렛": {
        "sales": 28526750,
        "tag": 56028000,
        "discountRate": 0.4908483258370815
      },
      "자사몰": {
        "sales": 12547690,
        "tag": 16768000,
        "discountRate": 0.25168833492366416
      },
      "제휴몰": {
        "sales": 135177890,
        "tag": 152490000,
        "discountRate": 0.11352947734277663
      },
      "직영몰": {
        "sales": 2092600,
        "tag": 2429000,
        "discountRate": 0.13849320708110335
      },
      "직영점(가두)": {
        "sales": 2124680,
        "tag": 2183000,
        "discountRate": 0.02671552908841046
      }
    },
    "Bag": {
      "기타": {
        "sales": 101380,
        "tag": 338000,
        "discountRate": 0.7000591715976332
      },
      "대리점": {
        "sales": 240731230,
        "tag": 313288000,
        "discountRate": 0.23159766732208065
      },
      "면세점": {
        "sales": 27447700,
        "tag": 35814000,
        "discountRate": 0.2336041771374323
      },
      "백화점": {
        "sales": 192271040,
        "tag": 259252000,
        "discountRate": 0.2583623655748075
      },
      "아울렛": {
        "sales": 99732080,
        "tag": 150395000,
        "discountRate": 0.33686572026995576
      },
      "자사몰": {
        "sales": 24488510,
        "tag": 32753000,
        "discountRate": 0.25232772570451567
      },
      "제휴몰": {
        "sales": 87662250,
        "tag": 126684000,
        "discountRate": 0.3080242966751918
      },
      "직영몰": {
        "sales": 9546270,
        "tag": 10092000,
        "discountRate": 0.05407550535077288
      },
      "직영점(가두)": {
        "sales": 7441500,
        "tag": 7792000,
        "discountRate": 0.04498203285420943
      }
    },
    "Headwear": {
      "기타": {
        "sales": 114600,
        "tag": 173000,
        "discountRate": 0.33757225433526017
      },
      "대리점": {
        "sales": 109474080,
        "tag": 125572000,
        "discountRate": 0.12819673175548685
      },
      "면세점": {
        "sales": 3423110,
        "tag": 3727000,
        "discountRate": 0.08153742956801713
      },
      "백화점": {
        "sales": 46886060,
        "tag": 68341000,
        "discountRate": 0.31393950922579417
      },
      "아울렛": {
        "sales": 44468580,
        "tag": 79414000,
        "discountRate": 0.4400410506963508
      },
      "자사몰": {
        "sales": 7444510,
        "tag": 9353000,
        "discountRate": 0.2040511065968138
      },
      "제휴몰": {
        "sales": 16481900,
        "tag": 24792000,
        "discountRate": 0.3351928041303647
      },
      "직영몰": {
        "sales": 4884850,
        "tag": 5114000,
        "discountRate": 0.044808369182635865
      },
      "직영점(가두)": {
        "sales": 8645290,
        "tag": 8787000,
        "discountRate": 0.01612723341299649
      }
    },
    "Shoes": {
      "기타": {
        "sales": 2461690,
        "tag": 9851000,
        "discountRate": 0.7501076032890062
      },
      "대리점": {
        "sales": 538266100,
        "tag": 609166000,
        "discountRate": 0.11638847210776704
      },
      "면세점": {
        "sales": 166949320,
        "tag": 212826000,
        "discountRate": 0.21555956509073138
      },
      "백화점": {
        "sales": 462782900,
        "tag": 623886000,
        "discountRate": 0.2582252206332567
      },
      "사입": {
        "sales": -93060,
        "tag": -198000,
        "discountRate": 0.0
      },
      "아울렛": {
        "sales": 173948980,
        "tag": 244344000,
        "discountRate": 0.28809800936384766
      },
      "자사몰": {
        "sales": 168579050,
        "tag": 223169000,
        "discountRate": 0.24461260300489762
      },
      "제휴몰": {
        "sales": 261769500,
        "tag": 328081000,
        "discountRate": 0.20211929371100434
      },
      "직영몰": {
        "sales": 46073050,
        "tag": 49116000,
        "discountRate": 0.0619543529603388
      },
      "직영점(가두)": {
        "sales": 20473280,
        "tag": 21350000,
        "discountRate": 0.041064168618267005
      }
    },
    "과시즌의류": {
      "기타": {
        "sales": 2173310,
        "tag": 7398000,
        "discountRate": 0.7062300621789672
      },
      "대리점": {
        "sales": 1523900620,
        "tag": 2288144000,
        "discountRate": 0.33400143522435655
      },
      "면세점": {
        "sales": 108000,
        "tag": 108000,
        "discountRate": 0.0
      },
      "백화점": {
        "sales": 2861763000,
        "tag": 4724939000,
        "discountRate": 0.39432805375900093
      },
      "사입": {
        "sales": 945290410,
        "tag": 7271474000,
        "discountRate": 0.8700001664036755
      },
      "아울렛": {
        "sales": 6501803370,
        "tag": 10659829000,
        "discountRate": 0.3900649466328212
      },
      "자사몰": {
        "sales": 8713459,
        "tag": 10327000,
        "discountRate": 0.15624489203059944
      },
      "제휴몰": {
        "sales": 1140970230,
        "tag": 1809383000,
        "discountRate": 0.369414750774159
      },
      "직영몰": {
        "sales": 66947400,
        "tag": 108166000,
        "discountRate": 0.3810679880923765
      },
      "직영점(가두)": {
        "sales": 21500,
        "tag": 35000,
        "discountRate": 0.3857142857142857
      }
    },
    "당시즌의류": {
      "기타": {
        "sales": 11562000,
        "tag": 37719000,
        "discountRate": 0.6934701344150163
      },
      "대리점": {
        "sales": 7414381940,
        "tag": 8061900000,
        "discountRate": 0.08031829469479901
      },
      "면세점": {
        "sales": 1084307860,
        "tag": 1118200000,
        "discountRate": 0.030309551064210294
      },
      "백화점": {
        "sales": 4677371070,
        "tag": 4964039000,
        "discountRate": 0.057748927838802255
      },
      "아울렛": {
        "sales": 1567752660,
        "tag": 1648514000,
        "discountRate": 0.048990387706746796
      },
      "자사몰": {
        "sales": 1035115810,
        "tag": 1136938000,
        "discountRate": 0.08955826087262453
      },
      "제휴몰": {
        "sales": 1413057720,
        "tag": 1461223000,
        "discountRate": 0.032962306232518945
      },
      "직영몰": {
        "sales": 619304230,
        "tag": 644973000,
        "discountRate": 0.03979820860718197
      },
      "직영점(가두)": {
        "sales": 284614000,
        "tag": 329135000,
        "discountRate": 0.13526668388351282
      }
    }
  }
};
  if (typeof window !== 'undefined') {
    window.brandNames = brandNames;
    window.channelItemSalesData = channelItemSalesData;
    window.channelMetrics = channelMetrics;
    window.channelItemMetrics = channelItemMetrics;
    window.itemMetrics = itemMetrics;
    window.itemChannelMetrics = itemChannelMetrics;
  }
  console.log('[Data.js] window variables updated');
})();



