// 모든 대시보드 데이터 (window 전역 할당 전용)
// 자동 생성 일시: 2026-02-16 13:59:58

(function(){
  var brandNames = {
  "M": "MLB",
  "I": "MLB KIDS",
  "X": "DISCOVERY",
  "V": "DUVETICA",
  "ST": "SERGIO",
  "W": "SUPRA"
};
  var channelItemSalesData = {
  "I": {
    "기타": {
      "Acc_etc": 18800,
      "Bag": 198500,
      "Headwear": 102590,
      "Shoes": 130410,
      "과시즌의류": 44550,
      "당시즌의류": 258500,
      "차시즌의류": 273000
    },
    "대리점": {
      "Acc_etc": 954200,
      "Bag": 56380560,
      "Headwear": 24371460,
      "Shoes": 35528730,
      "과시즌의류": 808300,
      "당시즌의류": 36621790,
      "차시즌의류": 106209300
    },
    "면세점": {
      "Acc_etc": 1380650,
      "Bag": 143158280,
      "Headwear": 103598280,
      "Shoes": 41736000,
      "과시즌의류": 188400,
      "당시즌의류": 50655000,
      "차시즌의류": 125644980
    },
    "백화점": {
      "Acc_etc": 7772760,
      "Bag": 1207017240,
      "Headwear": 85054940,
      "Shoes": 188836290,
      "과시즌의류": 86647480,
      "당시즌의류": 175182010,
      "차시즌의류": 653145370
    },
    "사입": {
      "Acc_etc": 3534870,
      "Bag": 248650,
      "Headwear": 54773770,
      "Shoes": 199028930,
      "과시즌의류": 695791280
    },
    "자사몰": {
      "Acc_etc": 697040,
      "Bag": 40289230,
      "Headwear": 3792912,
      "Shoes": 13760490,
      "과시즌의류": 16707190,
      "당시즌의류": 13668500,
      "차시즌의류": 33972060
    },
    "제휴몰": {
      "Acc_etc": 2415700,
      "Bag": 84311730,
      "Headwear": 19841000,
      "Shoes": 49434680,
      "과시즌의류": 69321060,
      "당시즌의류": 110415860,
      "차시즌의류": 69780040
    },
    "직영몰": {
      "Acc_etc": 975400,
      "Bag": 42298710,
      "Headwear": 19749920,
      "Shoes": 26938640,
      "과시즌의류": 467200,
      "당시즌의류": 18463480,
      "차시즌의류": 70273150
    },
    "직영점(가두)": {
      "Acc_etc": 624300,
      "Bag": 6832500,
      "Headwear": 8475000,
      "Shoes": 7457000,
      "과시즌의류": 1357000,
      "당시즌의류": 11366280,
      "차시즌의류": 26486730
    }
  },
  "M": {
    "RF": {
      "Acc_etc": 7767420,
      "Bag": 45649680,
      "Headwear": 596010860,
      "Shoes": 571877290,
      "당시즌의류": 77023720,
      "차시즌의류": 202515570
    },
    "기타": {
      "Acc_etc": 159800,
      "Bag": 159000,
      "Headwear": 771180,
      "Shoes": 851860,
      "과시즌의류": 40460,
      "당시즌의류": 1322680,
      "차시즌의류": 892500
    },
    "대리점": {
      "Acc_etc": 9914270,
      "Bag": 216225080,
      "Headwear": 871297430,
      "Shoes": 1317825910,
      "과시즌의류": 790160,
      "당시즌의류": 205787540,
      "차시즌의류": 445248690
    },
    "면세점": {
      "Acc_etc": 5404110,
      "Bag": 560793510,
      "Headwear": 3997032700,
      "Shoes": 482163810,
      "과시즌의류": 119000,
      "당시즌의류": 183614010,
      "차시즌의류": 1151548560
    },
    "백화점": {
      "Acc_etc": 18871200,
      "Bag": 394843660,
      "Headwear": 646841880,
      "Shoes": 1950296100,
      "과시즌의류": 4349340,
      "당시즌의류": 361533510,
      "차시즌의류": 808911930
    },
    "사입": {
      "Acc_etc": 8537820,
      "Bag": 260751300,
      "Headwear": 352309620,
      "Shoes": 389571470,
      "과시즌의류": 912805070
    },
    "자사몰": {
      "Acc_etc": 2275936,
      "Bag": 11254298,
      "Headwear": 100591172,
      "Shoes": 48710172,
      "과시즌의류": 2018220,
      "당시즌의류": 25915836,
      "차시즌의류": 63962134
    },
    "제휴몰": {
      "Acc_etc": 4208910,
      "Bag": 17360400,
      "Headwear": 357289040,
      "Shoes": 273270320,
      "과시즌의류": 2150000,
      "당시즌의류": 185975000,
      "차시즌의류": 65106000
    },
    "직영몰": {
      "Acc_etc": 3013710,
      "Bag": 5485940,
      "Headwear": 72355050,
      "Shoes": 37429830,
      "과시즌의류": 108500,
      "당시즌의류": 29300400,
      "차시즌의류": 62625860
    },
    "직영점(가두)": {
      "Acc_etc": 23928540,
      "Bag": 68973430,
      "Headwear": 679807940,
      "Shoes": 240726700,
      "과시즌의류": 326000,
      "당시즌의류": 128133890,
      "차시즌의류": 286143530
    }
  },
  "ST": {
    "기타": {
      "Shoes": 59730,
      "과시즌의류": 126360,
      "당시즌의류": 252720
    },
    "면세점": {
      "Acc_etc": 294800,
      "Bag": 358000,
      "Headwear": 246000,
      "Shoes": 298800,
      "과시즌의류": 1433300,
      "당시즌의류": 3326000,
      "차시즌의류": 8560000
    },
    "백화점": {
      "Acc_etc": 55720,
      "Headwear": 87200,
      "Shoes": 232200,
      "과시즌의류": 288000,
      "당시즌의류": 1433500,
      "차시즌의류": 0
    },
    "아울렛": {
      "Acc_etc": 315460,
      "Bag": 330660,
      "Headwear": 651870,
      "Shoes": 316440,
      "과시즌의류": 49532770,
      "당시즌의류": 161100
    },
    "자사몰": {
      "Acc_etc": 591040,
      "Bag": 1781670,
      "Headwear": 1982370,
      "Shoes": 1638060,
      "과시즌의류": 1915400,
      "당시즌의류": 6607930,
      "차시즌의류": 17288800
    },
    "제휴몰": {
      "Acc_etc": 670900,
      "Bag": 3379700,
      "Headwear": 1245200,
      "Shoes": 6941800,
      "과시즌의류": 27330800,
      "당시즌의류": 2581000,
      "차시즌의류": 4591000
    },
    "직영몰": {
      "Acc_etc": 428130,
      "Bag": 2197670,
      "Headwear": 1067900,
      "Shoes": 1455980,
      "과시즌의류": 7892810,
      "당시즌의류": 2578690,
      "차시즌의류": 13009540
    },
    "직영점(가두)": {
      "Acc_etc": 108000,
      "Bag": 248000,
      "Headwear": 53100,
      "Shoes": 199000,
      "과시즌의류": 157000,
      "당시즌의류": 4258400,
      "차시즌의류": 7680600
    }
  },
  "V": {
    "기타": {
      "Acc_etc": 0,
      "Bag": 0,
      "Headwear": 136360,
      "Shoes": 152180,
      "과시즌의류": 703640,
      "당시즌의류": 0,
      "차시즌의류": 0
    },
    "백화점": {
      "Acc_etc": 1349000,
      "Bag": 8724000,
      "Headwear": 4126400,
      "Shoes": 5247290,
      "과시즌의류": 17118910,
      "당시즌의류": 496706130,
      "차시즌의류": 158266000
    },
    "아울렛": {
      "Acc_etc": 51000,
      "Bag": 2912100,
      "Headwear": 921200,
      "Shoes": 1721200,
      "과시즌의류": 242902180,
      "당시즌의류": 51881900,
      "차시즌의류": 7928000
    },
    "자사몰": {
      "Acc_etc": -75930,
      "Bag": 2524900,
      "Headwear": 1072910,
      "Shoes": 1381950,
      "과시즌의류": 10068810,
      "당시즌의류": 16813960,
      "차시즌의류": 14683330
    },
    "제휴몰": {
      "Acc_etc": 1967000,
      "Bag": 5511000,
      "Headwear": 1945000,
      "Shoes": 15694900,
      "과시즌의류": 72028600,
      "당시즌의류": 76030000,
      "차시즌의류": 13600000
    },
    "직영몰": {
      "Acc_etc": 342000,
      "Bag": 2340000,
      "Headwear": 324000,
      "Shoes": 817200,
      "과시즌의류": 187000,
      "당시즌의류": 71954900,
      "차시즌의류": 33606000
    },
    "직영점(가두)": {
      "Bag": 290000,
      "Headwear": 190000,
      "Shoes": 1419000,
      "당시즌의류": 16080000,
      "차시즌의류": 3380000
    }
  },
  "W": {
    "기타": {
      "과시즌의류": 152730
    },
    "자사몰": {
      "Acc_etc": 41060,
      "Bag": 566100,
      "Headwear": 1556400,
      "Shoes": 1346000,
      "과시즌의류": 11234118,
      "당시즌의류": 19000
    },
    "제휴몰": {
      "Acc_etc": 36000,
      "Bag": 787000,
      "Headwear": 410000,
      "Shoes": 1541000,
      "과시즌의류": 7115000
    }
  },
  "X": {
    "기타": {
      "Acc_etc": 27300,
      "Bag": 787160,
      "Headwear": 65460,
      "Shoes": 685460,
      "과시즌의류": 509180,
      "당시즌의류": 6195870,
      "차시즌의류": 698600
    },
    "대리점": {
      "Acc_etc": 28403050,
      "Bag": 397051990,
      "Headwear": 50286230,
      "Shoes": 309845830,
      "과시즌의류": 270372320,
      "당시즌의류": 2099484760,
      "차시즌의류": 517449330
    },
    "면세점": {
      "Acc_etc": 1071710,
      "Bag": 281486640,
      "Headwear": 5492460,
      "Shoes": 88630320,
      "당시즌의류": 667317730,
      "차시즌의류": 14151000
    },
    "백화점": {
      "Acc_etc": 16482710,
      "Bag": 1286401570,
      "Headwear": 28264720,
      "Shoes": 412467540,
      "과시즌의류": 1451403660,
      "당시즌의류": 1876474440,
      "차시즌의류": 354294950
    },
    "사입": {
      "Shoes": 169059990,
      "과시즌의류": 1023795740
    },
    "아울렛": {
      "Acc_etc": 2100550,
      "Bag": 413084920,
      "Headwear": 9771590,
      "Shoes": 141122570,
      "과시즌의류": 1183064050,
      "당시즌의류": 1271208890,
      "차시즌의류": 33342120
    },
    "자사몰": {
      "Acc_etc": 1844100,
      "Bag": 147065341,
      "Headwear": 3506170,
      "Shoes": 83107391,
      "과시즌의류": 16969270,
      "당시즌의류": 224153080,
      "차시즌의류": 34102920
    },
    "제휴몰": {
      "Acc_etc": 44777290,
      "Bag": 309006590,
      "Headwear": 10580900,
      "Shoes": 176081440,
      "과시즌의류": 280333400,
      "당시즌의류": 713999010,
      "차시즌의류": 19079000
    },
    "직영몰": {
      "Acc_etc": 815480,
      "Bag": 77762090,
      "Headwear": 4084720,
      "Shoes": 34236430,
      "과시즌의류": 11726400,
      "당시즌의류": 175617190,
      "차시즌의류": 47225620
    },
    "직영점(가두)": {
      "Acc_etc": 2639100,
      "Bag": 10819000,
      "Headwear": 5270600,
      "Shoes": 12133000,
      "과시즌의류": 448800,
      "당시즌의류": 180169280,
      "차시즌의류": 23126000
    }
  }
};
  var channelMetrics = {
  "I": {
    "기타": {
      "sales": 1026350,
      "tag": 1904600,
      "discountRate": 0.46112044523784523
    },
    "대리점": {
      "sales": 260874340,
      "tag": 274464100,
      "discountRate": 0.049513797979407914
    },
    "면세점": {
      "sales": 466361590,
      "tag": 467302700,
      "discountRate": 0.0020139194573453034
    },
    "백화점": {
      "sales": 2403656090,
      "tag": 2672366000,
      "discountRate": 0.10055131295638398
    },
    "사입": {
      "sales": 953377500,
      "tag": 4659411000,
      "discountRate": 0.7953866915796868
    },
    "자사몰": {
      "sales": 122887422,
      "tag": 146679100,
      "discountRate": 0.16220223603771766
    },
    "제휴몰": {
      "sales": 405520070,
      "tag": 482626700,
      "discountRate": 0.15976453436993854
    },
    "직영몰": {
      "sales": 179166500,
      "tag": 195375100,
      "discountRate": 0.08296144186234578
    },
    "직영점(가두)": {
      "sales": 62598810,
      "tag": 62738300,
      "discountRate": 0.002223362762459269
    }
  },
  "M": {
    "RF": {
      "sales": 1500844540,
      "tag": 1842195600,
      "discountRate": 0.18529577423808852
    },
    "기타": {
      "sales": 4197480,
      "tag": 7662600,
      "discountRate": 0.4522120429097173
    },
    "대리점": {
      "sales": 3067089080,
      "tag": 3219027500,
      "discountRate": 0.04720010003021102
    },
    "면세점": {
      "sales": 6380675700,
      "tag": 6665870000,
      "discountRate": 0.04278425771879735
    },
    "백화점": {
      "sales": 4185647620,
      "tag": 4397892000,
      "discountRate": 0.04826048024826435
    },
    "사입": {
      "sales": 1923975280,
      "tag": 8309072000,
      "discountRate": 0.768448837607858
    },
    "자사몰": {
      "sales": 254727768,
      "tag": 294068000,
      "discountRate": 0.1337793707577839
    },
    "제휴몰": {
      "sales": 905359670,
      "tag": 954877900,
      "discountRate": 0.051858179983011454
    },
    "직영몰": {
      "sales": 210319290,
      "tag": 215817800,
      "discountRate": 0.02547755560477405
    },
    "직영점(가두)": {
      "sales": 1428040030,
      "tag": 1527472300,
      "discountRate": 0.06509595624090858
    }
  },
  "ST": {
    "기타": {
      "sales": 438810,
      "tag": 636000,
      "discountRate": 0.31004716981132074
    },
    "면세점": {
      "sales": 14516900,
      "tag": 15564800,
      "discountRate": 0.06732498972039469
    },
    "백화점": {
      "sales": 2096620,
      "tag": 2245700,
      "discountRate": 0.06638464621276219
    },
    "아울렛": {
      "sales": 51308300,
      "tag": 111536300,
      "discountRate": 0.5399856369630336
    },
    "자사몰": {
      "sales": 31805270,
      "tag": 34791900,
      "discountRate": 0.08584268177363119
    },
    "제휴몰": {
      "sales": 46740400,
      "tag": 91156900,
      "discountRate": 0.48725329623978
    },
    "직영몰": {
      "sales": 28630720,
      "tag": 37204700,
      "discountRate": 0.23045421680594114
    },
    "직영점(가두)": {
      "sales": 12704100,
      "tag": 13154000,
      "discountRate": 0.03420252394708834
    }
  },
  "V": {
    "기타": {
      "sales": 992180,
      "tag": 1719000,
      "discountRate": 0.4228155904595695
    },
    "백화점": {
      "sales": 691537730,
      "tag": 781521000,
      "discountRate": 0.11513864630636927
    },
    "아울렛": {
      "sales": 308317580,
      "tag": 674742000,
      "discountRate": 0.5430585616428205
    },
    "자사몰": {
      "sales": 46469930,
      "tag": 58346000,
      "discountRate": 0.20354557296129983
    },
    "제휴몰": {
      "sales": 186776500,
      "tag": 267035000,
      "discountRate": 0.30055423446364704
    },
    "직영몰": {
      "sales": 109571100,
      "tag": 122058000,
      "discountRate": 0.10230300349014398
    },
    "직영점(가두)": {
      "sales": 21359000,
      "tag": 21359000,
      "discountRate": 0.0
    }
  },
  "W": {
    "기타": {
      "sales": 152730,
      "tag": 488000,
      "discountRate": 0.6870286885245902
    },
    "자사몰": {
      "sales": 14762678,
      "tag": 58824000,
      "discountRate": 0.7490364817081463
    },
    "제휴몰": {
      "sales": 9889000,
      "tag": 34959000,
      "discountRate": 0.7171257759089219
    }
  },
  "X": {
    "기타": {
      "sales": 8969030,
      "tag": 11630000,
      "discountRate": 0.22880223559759238
    },
    "대리점": {
      "sales": 3672893510,
      "tag": 4454115000,
      "discountRate": 0.17539320156753924
    },
    "면세점": {
      "sales": 1058149860,
      "tag": 1229095000,
      "discountRate": 0.1390821213982646
    },
    "백화점": {
      "sales": 5425789590,
      "tag": 7681459400,
      "discountRate": 0.29365120513427434
    },
    "사입": {
      "sales": 1192855730,
      "tag": 8235066000,
      "discountRate": 0.8551492204191199
    },
    "아울렛": {
      "sales": 3053694690,
      "tag": 4585355000,
      "discountRate": 0.33403309231237277
    },
    "자사몰": {
      "sales": 510748272,
      "tag": 619263800,
      "discountRate": 0.1752331203600146
    },
    "제휴몰": {
      "sales": 1553857630,
      "tag": 2082317000,
      "discountRate": 0.25378430373473393
    },
    "직영몰": {
      "sales": 351467930,
      "tag": 401535000,
      "discountRate": 0.12468918027071119
    },
    "직영점(가두)": {
      "sales": 234605780,
      "tag": 259568000,
      "discountRate": 0.09616832583369295
    }
  }
};
  var channelItemMetrics = {
  "I": {
    "기타": {
      "Acc_etc": {
        "sales": 18800,
        "tag": 37600,
        "discountRate": 0.5
      },
      "Bag": {
        "sales": 198500,
        "tag": 397000,
        "discountRate": 0.5
      },
      "Headwear": {
        "sales": 102590,
        "tag": 170000,
        "discountRate": 0.3965294117647059
      },
      "Shoes": {
        "sales": 130410,
        "tag": 188000,
        "discountRate": 0.3063297872340426
      },
      "과시즌의류": {
        "sales": 44550,
        "tag": 49000,
        "discountRate": 0.09081632653061222
      },
      "당시즌의류": {
        "sales": 258500,
        "tag": 517000,
        "discountRate": 0.5
      },
      "차시즌의류": {
        "sales": 273000,
        "tag": 546000,
        "discountRate": 0.5
      }
    },
    "대리점": {
      "Acc_etc": {
        "sales": 954200,
        "tag": 991100,
        "discountRate": 0.037231359095953986
      },
      "Bag": {
        "sales": 56380560,
        "tag": 61957000,
        "discountRate": 0.09000500347014861
      },
      "Headwear": {
        "sales": 24371460,
        "tag": 24961000,
        "discountRate": 0.023618444773847225
      },
      "Shoes": {
        "sales": 35528730,
        "tag": 36801000,
        "discountRate": 0.034571614901768966
      },
      "과시즌의류": {
        "sales": 808300,
        "tag": 826000,
        "discountRate": 0.021428571428571463
      },
      "당시즌의류": {
        "sales": 36621790,
        "tag": 38459000,
        "discountRate": 0.04777061286044881
      },
      "차시즌의류": {
        "sales": 106209300,
        "tag": 110469000,
        "discountRate": 0.038560139043532615
      }
    },
    "면세점": {
      "Acc_etc": {
        "sales": 1380650,
        "tag": 1371700,
        "discountRate": -0.0065247503098344595
      },
      "Bag": {
        "sales": 143158280,
        "tag": 144122000,
        "discountRate": 0.006686834764990768
      },
      "Headwear": {
        "sales": 103598280,
        "tag": 103619000,
        "discountRate": 0.00019996332718907883
      },
      "Shoes": {
        "sales": 41736000,
        "tag": 41736000,
        "discountRate": 0.0
      },
      "과시즌의류": {
        "sales": 188400,
        "tag": 154000,
        "discountRate": -0.22337662337662345
      },
      "당시즌의류": {
        "sales": 50655000,
        "tag": 50655000,
        "discountRate": 0.0
      },
      "차시즌의류": {
        "sales": 125644980,
        "tag": 125645000,
        "discountRate": 1.5917863827041856e-07
      }
    },
    "백화점": {
      "Acc_etc": {
        "sales": 7772760,
        "tag": 8338000,
        "discountRate": 0.06779083713120648
      },
      "Bag": {
        "sales": 1207017240,
        "tag": 1287142000,
        "discountRate": 0.06225013246401723
      },
      "Headwear": {
        "sales": 85054940,
        "tag": 90786000,
        "discountRate": 0.06312713413962501
      },
      "Shoes": {
        "sales": 188836290,
        "tag": 218030000,
        "discountRate": 0.13389767463193136
      },
      "과시즌의류": {
        "sales": 86647480,
        "tag": 169397000,
        "discountRate": 0.48849460143922263
      },
      "당시즌의류": {
        "sales": 175182010,
        "tag": 196628000,
        "discountRate": 0.10906885082490791
      },
      "차시즌의류": {
        "sales": 653145370,
        "tag": 702045000,
        "discountRate": 0.06965312764851261
      }
    },
    "사입": {
      "Acc_etc": {
        "sales": 3534870,
        "tag": 32135000,
        "discountRate": 0.8899993776256419
      },
      "Bag": {
        "sales": 248650,
        "tag": 1044000,
        "discountRate": 0.7618295019157089
      },
      "Headwear": {
        "sales": 54773770,
        "tag": 221953000,
        "discountRate": 0.753219059891058
      },
      "Shoes": {
        "sales": 199028930,
        "tag": 753674000,
        "discountRate": 0.7359217247775564
      },
      "과시즌의류": {
        "sales": 695791280,
        "tag": 3650605000,
        "discountRate": 0.8094038440203747
      }
    },
    "자사몰": {
      "Acc_etc": {
        "sales": 697040,
        "tag": 790100,
        "discountRate": 0.11778255916972535
      },
      "Bag": {
        "sales": 40289230,
        "tag": 48327000,
        "discountRate": 0.16632048337368344
      },
      "Headwear": {
        "sales": 3792912,
        "tag": 4636000,
        "discountRate": 0.18185677308024162
      },
      "Shoes": {
        "sales": 13760490,
        "tag": 16017000,
        "discountRate": 0.14088218767559468
      },
      "과시즌의류": {
        "sales": 16707190,
        "tag": 25978000,
        "discountRate": 0.3568715836477019
      },
      "당시즌의류": {
        "sales": 13668500,
        "tag": 14528000,
        "discountRate": 0.05916161894273131
      },
      "차시즌의류": {
        "sales": 33972060,
        "tag": 36403000,
        "discountRate": 0.06677856220641154
      }
    },
    "제휴몰": {
      "Acc_etc": {
        "sales": 2415700,
        "tag": 2415700,
        "discountRate": 0.0
      },
      "Bag": {
        "sales": 84311730,
        "tag": 103749000,
        "discountRate": 0.18734898649625542
      },
      "Headwear": {
        "sales": 19841000,
        "tag": 19841000,
        "discountRate": 0.0
      },
      "Shoes": {
        "sales": 49434680,
        "tag": 53757000,
        "discountRate": 0.08040478449318234
      },
      "과시즌의류": {
        "sales": 69321060,
        "tag": 122668000,
        "discountRate": 0.43488880555646137
      },
      "당시즌의류": {
        "sales": 110415860,
        "tag": 110416000,
        "discountRate": 1.26793218369059e-06
      },
      "차시즌의류": {
        "sales": 69780040,
        "tag": 69780000,
        "discountRate": -5.732301520122718e-07
      }
    },
    "직영몰": {
      "Acc_etc": {
        "sales": 975400,
        "tag": 1019100,
        "discountRate": 0.04288097340790897
      },
      "Bag": {
        "sales": 42298710,
        "tag": 49671000,
        "discountRate": 0.14842241952044455
      },
      "Headwear": {
        "sales": 19749920,
        "tag": 20581000,
        "discountRate": 0.04038093387104613
      },
      "Shoes": {
        "sales": 26938640,
        "tag": 29273000,
        "discountRate": 0.07974447443036248
      },
      "과시즌의류": {
        "sales": 467200,
        "tag": 479000,
        "discountRate": 0.024634655532359107
      },
      "당시즌의류": {
        "sales": 18463480,
        "tag": 19880000,
        "discountRate": 0.07125352112676053
      },
      "차시즌의류": {
        "sales": 70273150,
        "tag": 74472000,
        "discountRate": 0.056381593081963666
      }
    },
    "직영점(가두)": {
      "Acc_etc": {
        "sales": 624300,
        "tag": 624300,
        "discountRate": 0.0
      },
      "Bag": {
        "sales": 6832500,
        "tag": 6952000,
        "discountRate": 0.017189298043728374
      },
      "Headwear": {
        "sales": 8475000,
        "tag": 8475000,
        "discountRate": 0.0
      },
      "Shoes": {
        "sales": 7457000,
        "tag": 7457000,
        "discountRate": 0.0
      },
      "과시즌의류": {
        "sales": 1357000,
        "tag": 1357000,
        "discountRate": 0.0
      },
      "당시즌의류": {
        "sales": 11366280,
        "tag": 11372000,
        "discountRate": 0.0005029897995075805
      },
      "차시즌의류": {
        "sales": 26486730,
        "tag": 26501000,
        "discountRate": 0.0005384702464057423
      }
    }
  },
  "M": {
    "RF": {
      "Acc_etc": {
        "sales": 7767420,
        "tag": 8040600,
        "discountRate": 0.03397507648682929
      },
      "Bag": {
        "sales": 45649680,
        "tag": 53855000,
        "discountRate": 0.15235948379909015
      },
      "Headwear": {
        "sales": 596010860,
        "tag": 777352000,
        "discountRate": 0.23328059875063034
      },
      "Shoes": {
        "sales": 571877290,
        "tag": 687273000,
        "discountRate": 0.16790374421809096
      },
      "당시즌의류": {
        "sales": 77023720,
        "tag": 82913000,
        "discountRate": 0.07102963347122893
      },
      "차시즌의류": {
        "sales": 202515570,
        "tag": 232762000,
        "discountRate": 0.12994573856557345
      }
    },
    "기타": {
      "Acc_etc": {
        "sales": 159800,
        "tag": 319600,
        "discountRate": 0.5
      },
      "Bag": {
        "sales": 159000,
        "tag": 318000,
        "discountRate": 0.5
      },
      "Headwear": {
        "sales": 771180,
        "tag": 1427000,
        "discountRate": 0.45957953749124036
      },
      "Shoes": {
        "sales": 851860,
        "tag": 1599000,
        "discountRate": 0.46725453408380235
      },
      "과시즌의류": {
        "sales": 40460,
        "tag": 89000,
        "discountRate": 0.5453932584269663
      },
      "당시즌의류": {
        "sales": 1322680,
        "tag": 2125000,
        "discountRate": 0.37756235294117646
      },
      "차시즌의류": {
        "sales": 892500,
        "tag": 1785000,
        "discountRate": 0.5
      }
    },
    "대리점": {
      "Acc_etc": {
        "sales": 9914270,
        "tag": 10294500,
        "discountRate": 0.03693525669046582
      },
      "Bag": {
        "sales": 216225080,
        "tag": 219867000,
        "discountRate": 0.01656419562735656
      },
      "Headwear": {
        "sales": 871297430,
        "tag": 901274000,
        "discountRate": 0.03326021831318782
      },
      "Shoes": {
        "sales": 1317825910,
        "tag": 1402440000,
        "discountRate": 0.06033348307235964
      },
      "과시즌의류": {
        "sales": 790160,
        "tag": 1064000,
        "discountRate": 0.2573684210526316
      },
      "당시즌의류": {
        "sales": 205787540,
        "tag": 224393000,
        "discountRate": 0.08291461854870696
      },
      "차시즌의류": {
        "sales": 445248690,
        "tag": 459695000,
        "discountRate": 0.0314258584496242
      }
    },
    "면세점": {
      "Acc_etc": {
        "sales": 5404110,
        "tag": 5404000,
        "discountRate": -2.0355292376095235e-05
      },
      "Bag": {
        "sales": 560793510,
        "tag": 806219000,
        "discountRate": 0.3044154131817781
      },
      "Headwear": {
        "sales": 3997032700,
        "tag": 3997049000,
        "discountRate": 4.078008550845169e-06
      },
      "Shoes": {
        "sales": 482163810,
        "tag": 521928000,
        "discountRate": 0.07618711776336962
      },
      "과시즌의류": {
        "sales": 119000,
        "tag": 119000,
        "discountRate": 0.0
      },
      "당시즌의류": {
        "sales": 183614010,
        "tag": 183614000,
        "discountRate": -5.4462077958561395e-08
      },
      "차시즌의류": {
        "sales": 1151548560,
        "tag": 1151537000,
        "discountRate": -1.0038756896202372e-05
      }
    },
    "백화점": {
      "Acc_etc": {
        "sales": 18871200,
        "tag": 20022000,
        "discountRate": 0.05747677554689845
      },
      "Bag": {
        "sales": 394843660,
        "tag": 399277000,
        "discountRate": 0.011103419430620876
      },
      "Headwear": {
        "sales": 646841880,
        "tag": 664125000,
        "discountRate": 0.026023896103896105
      },
      "Shoes": {
        "sales": 1950296100,
        "tag": 2084020000,
        "discountRate": 0.06416632278001166
      },
      "과시즌의류": {
        "sales": 4349340,
        "tag": 8926000,
        "discountRate": 0.5127335872731347
      },
      "당시즌의류": {
        "sales": 361533510,
        "tag": 387013000,
        "discountRate": 0.06583626389811192
      },
      "차시즌의류": {
        "sales": 808911930,
        "tag": 834509000,
        "discountRate": 0.03067321023500047
      }
    },
    "사입": {
      "Acc_etc": {
        "sales": 8537820,
        "tag": 34153000,
        "discountRate": 0.7500125904020145
      },
      "Bag": {
        "sales": 260751300,
        "tag": 1026744000,
        "discountRate": 0.746040590449031
      },
      "Headwear": {
        "sales": 352309620,
        "tag": 1337705000,
        "discountRate": 0.7366313051083759
      },
      "Shoes": {
        "sales": 389571470,
        "tag": 1769559000,
        "discountRate": 0.7798482729312783
      },
      "과시즌의류": {
        "sales": 912805070,
        "tag": 4140911000,
        "discountRate": 0.7795641901021297
      }
    },
    "자사몰": {
      "Acc_etc": {
        "sales": 2275936,
        "tag": 2619000,
        "discountRate": 0.1309904543718977
      },
      "Bag": {
        "sales": 11254298,
        "tag": 14041000,
        "discountRate": 0.1984689124706217
      },
      "Headwear": {
        "sales": 100591172,
        "tag": 117711000,
        "discountRate": 0.14543949163629566
      },
      "Shoes": {
        "sales": 48710172,
        "tag": 61020000,
        "discountRate": 0.2017343166175024
      },
      "과시즌의류": {
        "sales": 2018220,
        "tag": 3603000,
        "discountRate": 0.43985012489592
      },
      "당시즌의류": {
        "sales": 25915836,
        "tag": 27882000,
        "discountRate": 0.07051732300408864
      },
      "차시즌의류": {
        "sales": 63962134,
        "tag": 67192000,
        "discountRate": 0.04806920466722231
      }
    },
    "제휴몰": {
      "Acc_etc": {
        "sales": 4208910,
        "tag": 4208900,
        "discountRate": -2.3759176981386076e-06
      },
      "Bag": {
        "sales": 17360400,
        "tag": 19472000,
        "discountRate": 0.10844289235825799
      },
      "Headwear": {
        "sales": 357289040,
        "tag": 357875000,
        "discountRate": 0.0016373314704855035
      },
      "Shoes": {
        "sales": 273270320,
        "tag": 318118000,
        "discountRate": 0.14097812761302408
      },
      "과시즌의류": {
        "sales": 2150000,
        "tag": 4123000,
        "discountRate": 0.47853504729565854
      },
      "당시즌의류": {
        "sales": 185975000,
        "tag": 185975000,
        "discountRate": 0.0
      },
      "차시즌의류": {
        "sales": 65106000,
        "tag": 65106000,
        "discountRate": 0.0
      }
    },
    "직영몰": {
      "Acc_etc": {
        "sales": 3013710,
        "tag": 3480800,
        "discountRate": 0.13419041599632264
      },
      "Bag": {
        "sales": 5485940,
        "tag": 5691000,
        "discountRate": 0.03603233175188891
      },
      "Headwear": {
        "sales": 72355050,
        "tag": 72995000,
        "discountRate": 0.008767038838276564
      },
      "Shoes": {
        "sales": 37429830,
        "tag": 38202000,
        "discountRate": 0.020212816082927576
      },
      "과시즌의류": {
        "sales": 108500,
        "tag": 158000,
        "discountRate": 0.31329113924050633
      },
      "당시즌의류": {
        "sales": 29300400,
        "tag": 31582000,
        "discountRate": 0.07224368311063267
      },
      "차시즌의류": {
        "sales": 62625860,
        "tag": 63709000,
        "discountRate": 0.017001365584140338
      }
    },
    "직영점(가두)": {
      "Acc_etc": {
        "sales": 23928540,
        "tag": 24038300,
        "discountRate": 0.004566046683833758
      },
      "Bag": {
        "sales": 68973430,
        "tag": 70018000,
        "discountRate": 0.014918592361964023
      },
      "Headwear": {
        "sales": 679807940,
        "tag": 776026000,
        "discountRate": 0.12398819111730797
      },
      "Shoes": {
        "sales": 240726700,
        "tag": 241239000,
        "discountRate": 0.002123620144338201
      },
      "과시즌의류": {
        "sales": 326000,
        "tag": 326000,
        "discountRate": 0.0
      },
      "당시즌의류": {
        "sales": 128133890,
        "tag": 129143000,
        "discountRate": 0.007813896223566097
      },
      "차시즌의류": {
        "sales": 286143530,
        "tag": 286682000,
        "discountRate": 0.0018782832546165862
      }
    }
  },
  "ST": {
    "기타": {
      "Shoes": {
        "sales": 59730,
        "tag": 219000,
        "discountRate": 0.7272602739726027
      },
      "과시즌의류": {
        "sales": 126360,
        "tag": 139000,
        "discountRate": 0.0909352517985611
      },
      "당시즌의류": {
        "sales": 252720,
        "tag": 278000,
        "discountRate": 0.0909352517985611
      }
    },
    "면세점": {
      "Acc_etc": {
        "sales": 294800,
        "tag": 294800,
        "discountRate": 0.0
      },
      "Bag": {
        "sales": 358000,
        "tag": 358000,
        "discountRate": 0.0
      },
      "Headwear": {
        "sales": 246000,
        "tag": 246000,
        "discountRate": 0.0
      },
      "Shoes": {
        "sales": 298800,
        "tag": 996000,
        "discountRate": 0.7
      },
      "과시즌의류": {
        "sales": 1433300,
        "tag": 1784000,
        "discountRate": 0.19658071748878925
      },
      "당시즌의류": {
        "sales": 3326000,
        "tag": 3326000,
        "discountRate": 0.0
      },
      "차시즌의류": {
        "sales": 8560000,
        "tag": 8560000,
        "discountRate": 0.0
      }
    },
    "백화점": {
      "Acc_etc": {
        "sales": 55720,
        "tag": 59700,
        "discountRate": 0.06666666666666665
      },
      "Headwear": {
        "sales": 87200,
        "tag": 98000,
        "discountRate": 0.11020408163265305
      },
      "Shoes": {
        "sales": 232200,
        "tag": 258000,
        "discountRate": 0.09999999999999998
      },
      "과시즌의류": {
        "sales": 288000,
        "tag": 288000,
        "discountRate": 0.0
      },
      "당시즌의류": {
        "sales": 1433500,
        "tag": 1542000,
        "discountRate": 0.07036316472114135
      },
      "차시즌의류": {
        "sales": 0,
        "tag": 0,
        "discountRate": 0.0
      }
    },
    "아울렛": {
      "Acc_etc": {
        "sales": 315460,
        "tag": 348300,
        "discountRate": 0.09428653459661207
      },
      "Bag": {
        "sales": 330660,
        "tag": 447000,
        "discountRate": 0.26026845637583895
      },
      "Headwear": {
        "sales": 651870,
        "tag": 915000,
        "discountRate": 0.2875737704918033
      },
      "Shoes": {
        "sales": 316440,
        "tag": 617000,
        "discountRate": 0.4871312803889789
      },
      "과시즌의류": {
        "sales": 49532770,
        "tag": 109030000,
        "discountRate": 0.5456959552416766
      },
      "당시즌의류": {
        "sales": 161100,
        "tag": 179000,
        "discountRate": 0.09999999999999998
      }
    },
    "자사몰": {
      "Acc_etc": {
        "sales": 591040,
        "tag": 612900,
        "discountRate": 0.03566650350791323
      },
      "Bag": {
        "sales": 1781670,
        "tag": 1929000,
        "discountRate": 0.07637636080870913
      },
      "Headwear": {
        "sales": 1982370,
        "tag": 2245000,
        "discountRate": 0.1169844097995546
      },
      "Shoes": {
        "sales": 1638060,
        "tag": 1791000,
        "discountRate": 0.08539363484087104
      },
      "과시즌의류": {
        "sales": 1915400,
        "tag": 2353000,
        "discountRate": 0.1859753506162346
      },
      "당시즌의류": {
        "sales": 6607930,
        "tag": 7052000,
        "discountRate": 0.06297078842881454
      },
      "차시즌의류": {
        "sales": 17288800,
        "tag": 18809000,
        "discountRate": 0.08082301026104521
      }
    },
    "제휴몰": {
      "Acc_etc": {
        "sales": 670900,
        "tag": 873900,
        "discountRate": 0.23229202425906859
      },
      "Bag": {
        "sales": 3379700,
        "tag": 4339000,
        "discountRate": 0.22108780825074903
      },
      "Headwear": {
        "sales": 1245200,
        "tag": 1466000,
        "discountRate": 0.15061391541609825
      },
      "Shoes": {
        "sales": 6941800,
        "tag": 22277000,
        "discountRate": 0.6883871257350631
      },
      "과시즌의류": {
        "sales": 27330800,
        "tag": 55029000,
        "discountRate": 0.5033382398371767
      },
      "당시즌의류": {
        "sales": 2581000,
        "tag": 2581000,
        "discountRate": 0.0
      },
      "차시즌의류": {
        "sales": 4591000,
        "tag": 4591000,
        "discountRate": 0.0
      }
    },
    "직영몰": {
      "Acc_etc": {
        "sales": 428130,
        "tag": 483700,
        "discountRate": 0.11488525945834194
      },
      "Bag": {
        "sales": 2197670,
        "tag": 2674000,
        "discountRate": 0.17813388182498135
      },
      "Headwear": {
        "sales": 1067900,
        "tag": 1175000,
        "discountRate": 0.0911489361702128
      },
      "Shoes": {
        "sales": 1455980,
        "tag": 1750000,
        "discountRate": 0.1680114285714286
      },
      "과시즌의류": {
        "sales": 7892810,
        "tag": 13098000,
        "discountRate": 0.39740342036952203
      },
      "당시즌의류": {
        "sales": 2578690,
        "tag": 3160000,
        "discountRate": 0.18395886075949364
      },
      "차시즌의류": {
        "sales": 13009540,
        "tag": 14864000,
        "discountRate": 0.12476184068891283
      }
    },
    "직영점(가두)": {
      "Acc_etc": {
        "sales": 108000,
        "tag": 108000,
        "discountRate": 0.0
      },
      "Bag": {
        "sales": 248000,
        "tag": 248000,
        "discountRate": 0.0
      },
      "Headwear": {
        "sales": 53100,
        "tag": 59000,
        "discountRate": 0.09999999999999998
      },
      "Shoes": {
        "sales": 199000,
        "tag": 199000,
        "discountRate": 0.0
      },
      "과시즌의류": {
        "sales": 157000,
        "tag": 157000,
        "discountRate": 0.0
      },
      "당시즌의류": {
        "sales": 4258400,
        "tag": 4336000,
        "discountRate": 0.017896678966789703
      },
      "차시즌의류": {
        "sales": 7680600,
        "tag": 8047000,
        "discountRate": 0.04553249658257741
      }
    }
  },
  "V": {
    "기타": {
      "Acc_etc": {
        "sales": 0,
        "tag": 0,
        "discountRate": 0.0
      },
      "Bag": {
        "sales": 0,
        "tag": 0,
        "discountRate": 0.0
      },
      "Headwear": {
        "sales": 136360,
        "tag": 150000,
        "discountRate": 0.09093333333333331
      },
      "Shoes": {
        "sales": 152180,
        "tag": 279000,
        "discountRate": 0.45455197132616487
      },
      "과시즌의류": {
        "sales": 703640,
        "tag": 1290000,
        "discountRate": 0.45454263565891473
      },
      "당시즌의류": {
        "sales": 0,
        "tag": 0,
        "discountRate": 0.0
      },
      "차시즌의류": {
        "sales": 0,
        "tag": 0,
        "discountRate": 0.0
      }
    },
    "백화점": {
      "Acc_etc": {
        "sales": 1349000,
        "tag": 1475000,
        "discountRate": 0.08542372881355931
      },
      "Bag": {
        "sales": 8724000,
        "tag": 9690000,
        "discountRate": 0.09969040247678018
      },
      "Headwear": {
        "sales": 4126400,
        "tag": 4920000,
        "discountRate": 0.16130081300813004
      },
      "Shoes": {
        "sales": 5247290,
        "tag": 5846000,
        "discountRate": 0.10241361614779332
      },
      "과시즌의류": {
        "sales": 17118910,
        "tag": 31720000,
        "discountRate": 0.46031179066834804
      },
      "당시즌의류": {
        "sales": 496706130,
        "tag": 552480000,
        "discountRate": 0.10095183536055607
      },
      "차시즌의류": {
        "sales": 158266000,
        "tag": 175390000,
        "discountRate": 0.09763384457494728
      }
    },
    "아울렛": {
      "Acc_etc": {
        "sales": 51000,
        "tag": 120000,
        "discountRate": 0.575
      },
      "Bag": {
        "sales": 2912100,
        "tag": 3600000,
        "discountRate": 0.19108333333333338
      },
      "Headwear": {
        "sales": 921200,
        "tag": 1320000,
        "discountRate": 0.3021212121212121
      },
      "Shoes": {
        "sales": 1721200,
        "tag": 4992000,
        "discountRate": 0.6552083333333334
      },
      "과시즌의류": {
        "sales": 242902180,
        "tag": 598250000,
        "discountRate": 0.5939788048474718
      },
      "당시즌의류": {
        "sales": 51881900,
        "tag": 57750000,
        "discountRate": 0.10161212121212126
      },
      "차시즌의류": {
        "sales": 7928000,
        "tag": 8710000,
        "discountRate": 0.08978185993111365
      }
    },
    "자사몰": {
      "Acc_etc": {
        "sales": -75930,
        "tag": -110000,
        "discountRate": 0.0
      },
      "Bag": {
        "sales": 2524900,
        "tag": 2780000,
        "discountRate": 0.09176258992805753
      },
      "Headwear": {
        "sales": 1072910,
        "tag": 1638000,
        "discountRate": 0.34498778998779
      },
      "Shoes": {
        "sales": 1381950,
        "tag": 1658000,
        "discountRate": 0.16649577804583837
      },
      "과시즌의류": {
        "sales": 10068810,
        "tag": 18610000,
        "discountRate": 0.4589570123589468
      },
      "당시즌의류": {
        "sales": 16813960,
        "tag": 18310000,
        "discountRate": 0.08170617149098858
      },
      "차시즌의류": {
        "sales": 14683330,
        "tag": 15460000,
        "discountRate": 0.05023738680465717
      }
    },
    "제휴몰": {
      "Acc_etc": {
        "sales": 1967000,
        "tag": 2515000,
        "discountRate": 0.21789264413518883
      },
      "Bag": {
        "sales": 5511000,
        "tag": 6730000,
        "discountRate": 0.1811292719167905
      },
      "Headwear": {
        "sales": 1945000,
        "tag": 3142000,
        "discountRate": 0.3809675366008911
      },
      "Shoes": {
        "sales": 15694900,
        "tag": 19220000,
        "discountRate": 0.18340790842872012
      },
      "과시즌의류": {
        "sales": 72028600,
        "tag": 145798000,
        "discountRate": 0.5059699035652067
      },
      "당시즌의류": {
        "sales": 76030000,
        "tag": 76030000,
        "discountRate": 0.0
      },
      "차시즌의류": {
        "sales": 13600000,
        "tag": 13600000,
        "discountRate": 0.0
      }
    },
    "직영몰": {
      "Acc_etc": {
        "sales": 342000,
        "tag": 380000,
        "discountRate": 0.09999999999999998
      },
      "Bag": {
        "sales": 2340000,
        "tag": 2600000,
        "discountRate": 0.09999999999999998
      },
      "Headwear": {
        "sales": 324000,
        "tag": 360000,
        "discountRate": 0.09999999999999998
      },
      "Shoes": {
        "sales": 817200,
        "tag": 908000,
        "discountRate": 0.09999999999999998
      },
      "과시즌의류": {
        "sales": 187000,
        "tag": 430000,
        "discountRate": 0.5651162790697675
      },
      "당시즌의류": {
        "sales": 71954900,
        "tag": 80040000,
        "discountRate": 0.10101324337831086
      },
      "차시즌의류": {
        "sales": 33606000,
        "tag": 37340000,
        "discountRate": 0.09999999999999998
      }
    },
    "직영점(가두)": {
      "Bag": {
        "sales": 290000,
        "tag": 290000,
        "discountRate": 0.0
      },
      "Headwear": {
        "sales": 190000,
        "tag": 190000,
        "discountRate": 0.0
      },
      "Shoes": {
        "sales": 1419000,
        "tag": 1419000,
        "discountRate": 0.0
      },
      "당시즌의류": {
        "sales": 16080000,
        "tag": 16080000,
        "discountRate": 0.0
      },
      "차시즌의류": {
        "sales": 3380000,
        "tag": 3380000,
        "discountRate": 0.0
      }
    }
  },
  "W": {
    "기타": {
      "과시즌의류": {
        "sales": 152730,
        "tag": 488000,
        "discountRate": 0.6870286885245902
      }
    },
    "자사몰": {
      "Acc_etc": {
        "sales": 41060,
        "tag": 85000,
        "discountRate": 0.5169411764705882
      },
      "Bag": {
        "sales": 566100,
        "tag": 2771000,
        "discountRate": 0.7957055214723927
      },
      "Headwear": {
        "sales": 1556400,
        "tag": 5927000,
        "discountRate": 0.7374050953264721
      },
      "Shoes": {
        "sales": 1346000,
        "tag": 5302000,
        "discountRate": 0.7461335345152773
      },
      "과시즌의류": {
        "sales": 11234118,
        "tag": 44690000,
        "discountRate": 0.748621212799284
      },
      "당시즌의류": {
        "sales": 19000,
        "tag": 49000,
        "discountRate": 0.6122448979591837
      }
    },
    "제휴몰": {
      "Acc_etc": {
        "sales": 36000,
        "tag": 68000,
        "discountRate": 0.47058823529411764
      },
      "Bag": {
        "sales": 787000,
        "tag": 2707000,
        "discountRate": 0.7092722571111931
      },
      "Headwear": {
        "sales": 410000,
        "tag": 1904000,
        "discountRate": 0.7846638655462185
      },
      "Shoes": {
        "sales": 1541000,
        "tag": 5311000,
        "discountRate": 0.7098474863490868
      },
      "과시즌의류": {
        "sales": 7115000,
        "tag": 24969000,
        "discountRate": 0.7150466578557411
      }
    }
  },
  "X": {
    "기타": {
      "Acc_etc": {
        "sales": 27300,
        "tag": 39000,
        "discountRate": 0.30000000000000004
      },
      "Bag": {
        "sales": 787160,
        "tag": 1083000,
        "discountRate": 0.2731671283471837
      },
      "Headwear": {
        "sales": 65460,
        "tag": 90000,
        "discountRate": 0.2726666666666666
      },
      "Shoes": {
        "sales": 685460,
        "tag": 1012000,
        "discountRate": 0.3226679841897233
      },
      "과시즌의류": {
        "sales": 509180,
        "tag": 826000,
        "discountRate": 0.3835593220338983
      },
      "당시즌의류": {
        "sales": 6195870,
        "tag": 7582000,
        "discountRate": 0.18281851754154577
      },
      "차시즌의류": {
        "sales": 698600,
        "tag": 998000,
        "discountRate": 0.30000000000000004
      }
    },
    "대리점": {
      "Acc_etc": {
        "sales": 28403050,
        "tag": 34030000,
        "discountRate": 0.16535263003232437
      },
      "Bag": {
        "sales": 397051990,
        "tag": 445788000,
        "discountRate": 0.10932553141852186
      },
      "Headwear": {
        "sales": 50286230,
        "tag": 57685000,
        "discountRate": 0.12826159313513041
      },
      "Shoes": {
        "sales": 309845830,
        "tag": 351504000,
        "discountRate": 0.11851407096363054
      },
      "과시즌의류": {
        "sales": 270372320,
        "tag": 492574000,
        "discountRate": 0.45110314389310036
      },
      "당시즌의류": {
        "sales": 2099484760,
        "tag": 2537834000,
        "discountRate": 0.17272573383444312
      },
      "차시즌의류": {
        "sales": 517449330,
        "tag": 534700000,
        "discountRate": 0.03226233401907608
      }
    },
    "면세점": {
      "Acc_etc": {
        "sales": 1071710,
        "tag": 2149000,
        "discountRate": 0.5012982782689623
      },
      "Bag": {
        "sales": 281486640,
        "tag": 288661000,
        "discountRate": 0.02485392900322525
      },
      "Headwear": {
        "sales": 5492460,
        "tag": 6269000,
        "discountRate": 0.12386983569947363
      },
      "Shoes": {
        "sales": 88630320,
        "tag": 101606000,
        "discountRate": 0.1277058441430624
      },
      "당시즌의류": {
        "sales": 667317730,
        "tag": 816259000,
        "discountRate": 0.1824681504277441
      },
      "차시즌의류": {
        "sales": 14151000,
        "tag": 14151000,
        "discountRate": 0.0
      }
    },
    "백화점": {
      "Acc_etc": {
        "sales": 16482710,
        "tag": 22950400,
        "discountRate": 0.2818116459843837
      },
      "Bag": {
        "sales": 1286401570,
        "tag": 1540915000,
        "discountRate": 0.16517032412560073
      },
      "Headwear": {
        "sales": 28264720,
        "tag": 38602000,
        "discountRate": 0.2677913061499404
      },
      "Shoes": {
        "sales": 412467540,
        "tag": 556907000,
        "discountRate": 0.25936010859982006
      },
      "과시즌의류": {
        "sales": 1451403660,
        "tag": 2949107000,
        "discountRate": 0.5078497796112518
      },
      "당시즌의류": {
        "sales": 1876474440,
        "tag": 2209453000,
        "discountRate": 0.15070633319649707
      },
      "차시즌의류": {
        "sales": 354294950,
        "tag": 363525000,
        "discountRate": 0.02539041331407743
      }
    },
    "사입": {
      "Shoes": {
        "sales": 169059990,
        "tag": 359700000,
        "discountRate": 0.5299972477064221
      },
      "과시즌의류": {
        "sales": 1023795740,
        "tag": 7875366000,
        "discountRate": 0.870000233639935
      }
    },
    "아울렛": {
      "Acc_etc": {
        "sales": 2100550,
        "tag": 4256000,
        "discountRate": 0.5064497180451129
      },
      "Bag": {
        "sales": 413084920,
        "tag": 496561000,
        "discountRate": 0.1681084096415143
      },
      "Headwear": {
        "sales": 9771590,
        "tag": 18716000,
        "discountRate": 0.47790179525539644
      },
      "Shoes": {
        "sales": 141122570,
        "tag": 188311000,
        "discountRate": 0.2505877511138489
      },
      "과시즌의류": {
        "sales": 1183064050,
        "tag": 2265836000,
        "discountRate": 0.477868632151665
      },
      "당시즌의류": {
        "sales": 1271208890,
        "tag": 1577308000,
        "discountRate": 0.1940642601191397
      },
      "차시즌의류": {
        "sales": 33342120,
        "tag": 34367000,
        "discountRate": 0.029821631215992128
      }
    },
    "자사몰": {
      "Acc_etc": {
        "sales": 1844100,
        "tag": 3233800,
        "discountRate": 0.4297420990784835
      },
      "Bag": {
        "sales": 147065341,
        "tag": 169711000,
        "discountRate": 0.1334366010453064
      },
      "Headwear": {
        "sales": 3506170,
        "tag": 4402000,
        "discountRate": 0.20350522489777378
      },
      "Shoes": {
        "sales": 83107391,
        "tag": 102645000,
        "discountRate": 0.19034155584782497
      },
      "과시즌의류": {
        "sales": 16969270,
        "tag": 27102000,
        "discountRate": 0.37387388384621056
      },
      "당시즌의류": {
        "sales": 224153080,
        "tag": 276298000,
        "discountRate": 0.1887270990018024
      },
      "차시즌의류": {
        "sales": 34102920,
        "tag": 35872000,
        "discountRate": 0.04931645851917932
      }
    },
    "제휴몰": {
      "Acc_etc": {
        "sales": 44777290,
        "tag": 59102000,
        "discountRate": 0.24237267774356197
      },
      "Bag": {
        "sales": 309006590,
        "tag": 387330000,
        "discountRate": 0.20221364211395965
      },
      "Headwear": {
        "sales": 10580900,
        "tag": 18697000,
        "discountRate": 0.43408568219500454
      },
      "Shoes": {
        "sales": 176081440,
        "tag": 226499000,
        "discountRate": 0.22259506664488582
      },
      "과시즌의류": {
        "sales": 280333400,
        "tag": 530132000,
        "discountRate": 0.47120075754717694
      },
      "당시즌의류": {
        "sales": 713999010,
        "tag": 841478000,
        "discountRate": 0.15149414482612733
      },
      "차시즌의류": {
        "sales": 19079000,
        "tag": 19079000,
        "discountRate": 0.0
      }
    },
    "직영몰": {
      "Acc_etc": {
        "sales": 815480,
        "tag": 882000,
        "discountRate": 0.07541950113378681
      },
      "Bag": {
        "sales": 77762090,
        "tag": 83276000,
        "discountRate": 0.06621247418223741
      },
      "Headwear": {
        "sales": 4084720,
        "tag": 4315000,
        "discountRate": 0.053367323290845925
      },
      "Shoes": {
        "sales": 34236430,
        "tag": 36687000,
        "discountRate": 0.06679668547441875
      },
      "과시즌의류": {
        "sales": 11726400,
        "tag": 22042000,
        "discountRate": 0.46799745939569914
      },
      "당시즌의류": {
        "sales": 175617190,
        "tag": 206610000,
        "discountRate": 0.1500063404481874
      },
      "차시즌의류": {
        "sales": 47225620,
        "tag": 47723000,
        "discountRate": 0.010422228275674184
      }
    },
    "직영점(가두)": {
      "Acc_etc": {
        "sales": 2639100,
        "tag": 2715000,
        "discountRate": 0.027955801104972422
      },
      "Bag": {
        "sales": 10819000,
        "tag": 11262000,
        "discountRate": 0.03933581957023624
      },
      "Headwear": {
        "sales": 5270600,
        "tag": 5710000,
        "discountRate": 0.07695271453590191
      },
      "Shoes": {
        "sales": 12133000,
        "tag": 13109000,
        "discountRate": 0.07445266610725454
      },
      "과시즌의류": {
        "sales": 448800,
        "tag": 748000,
        "discountRate": 0.4
      },
      "당시즌의류": {
        "sales": 180169280,
        "tag": 202838000,
        "discountRate": 0.1117577574221793
      },
      "차시즌의류": {
        "sales": 23126000,
        "tag": 23186000,
        "discountRate": 0.0025877684809798573
      }
    }
  }
};
  var itemMetrics = {
  "I": {
    "Acc_etc": {
      "sales": 18373720,
      "tag": 47722600,
      "discountRate": 0.6149891246495371
    },
    "Bag": {
      "sales": 1580735400,
      "tag": 1703361000,
      "discountRate": 0.0719903766729425
    },
    "Headwear": {
      "sales": 319759872,
      "tag": 495022000,
      "discountRate": 0.35404916953185916
    },
    "Shoes": {
      "sales": 562851170,
      "tag": 1156933000,
      "discountRate": 0.513497177451071
    },
    "과시즌의류": {
      "sales": 871332460,
      "tag": 3971513000,
      "discountRate": 0.7806044044171578
    },
    "당시즌의류": {
      "sales": 416631420,
      "tag": 442455000,
      "discountRate": 0.05836430823473571
    },
    "차시즌의류": {
      "sales": 1085784630,
      "tag": 1145861000,
      "discountRate": 0.05242902062292021
    }
  },
  "M": {
    "Acc_etc": {
      "sales": 84081716,
      "tag": 112580700,
      "discountRate": 0.25314271451501014
    },
    "Bag": {
      "sales": 1581496298,
      "tag": 2615502000,
      "discountRate": 0.39533737768122523
    },
    "Headwear": {
      "sales": 7674306872,
      "tag": 9003539000,
      "discountRate": 0.14763440553764473
    },
    "Shoes": {
      "sales": 5312723462,
      "tag": 7125398000,
      "discountRate": 0.2543962509883658
    },
    "과시즌의류": {
      "sales": 922706750,
      "tag": 4159319000,
      "discountRate": 0.7781591770191226
    },
    "당시즌의류": {
      "sales": 1198606586,
      "tag": 1254640000,
      "discountRate": 0.04466094975451129
    },
    "차시즌의류": {
      "sales": 3086954774,
      "tag": 3162977000,
      "discountRate": 0.02403502333402996
    }
  },
  "ST": {
    "Acc_etc": {
      "sales": 2464050,
      "tag": 2781300,
      "discountRate": 0.11406536511703158
    },
    "Bag": {
      "sales": 8295700,
      "tag": 9995000,
      "discountRate": 0.17001500750375187
    },
    "Headwear": {
      "sales": 5333640,
      "tag": 6204000,
      "discountRate": 0.14029013539651836
    },
    "Shoes": {
      "sales": 11142010,
      "tag": 28107000,
      "discountRate": 0.6035859394456897
    },
    "과시즌의류": {
      "sales": 88676440,
      "tag": 181878000,
      "discountRate": 0.5124399872441967
    },
    "당시즌의류": {
      "sales": 21199340,
      "tag": 22454000,
      "discountRate": 0.055876903892402296
    },
    "차시즌의류": {
      "sales": 51129940,
      "tag": 54871000,
      "discountRate": 0.06817918390406585
    }
  },
  "V": {
    "Acc_etc": {
      "sales": 3633070,
      "tag": 4380000,
      "discountRate": 0.17053196347031963
    },
    "Bag": {
      "sales": 22302000,
      "tag": 25690000,
      "discountRate": 0.13188010899182556
    },
    "Headwear": {
      "sales": 8715870,
      "tag": 11720000,
      "discountRate": 0.25632508532423204
    },
    "Shoes": {
      "sales": 26433720,
      "tag": 34322000,
      "discountRate": 0.2298315948954024
    },
    "과시즌의류": {
      "sales": 343009140,
      "tag": 796098000,
      "discountRate": 0.5691370409170731
    },
    "당시즌의류": {
      "sales": 729466890,
      "tag": 800690000,
      "discountRate": 0.08895216625660363
    },
    "차시즌의류": {
      "sales": 231463330,
      "tag": 253880000,
      "discountRate": 0.08829632109658103
    }
  },
  "W": {
    "Acc_etc": {
      "sales": 77060,
      "tag": 153000,
      "discountRate": 0.4963398692810458
    },
    "Bag": {
      "sales": 1353100,
      "tag": 5478000,
      "discountRate": 0.7529937933552391
    },
    "Headwear": {
      "sales": 1966400,
      "tag": 7831000,
      "discountRate": 0.7488954156557273
    },
    "Shoes": {
      "sales": 2887000,
      "tag": 10613000,
      "discountRate": 0.7279751248468859
    },
    "과시즌의류": {
      "sales": 18501848,
      "tag": 70147000,
      "discountRate": 0.7362417779805266
    },
    "당시즌의류": {
      "sales": 19000,
      "tag": 49000,
      "discountRate": 0.6122448979591837
    }
  },
  "X": {
    "Acc_etc": {
      "sales": 98161290,
      "tag": 129357200,
      "discountRate": 0.2411609867869744
    },
    "Bag": {
      "sales": 2923465301,
      "tag": 3424587000,
      "discountRate": 0.14633054993200645
    },
    "Headwear": {
      "sales": 117322850,
      "tag": 154486000,
      "discountRate": 0.24055998601815054
    },
    "Shoes": {
      "sales": 1427369971,
      "tag": 1937980000,
      "discountRate": 0.26347538622689604
    },
    "과시즌의류": {
      "sales": 4238622820,
      "tag": 14163733000,
      "discountRate": 0.700741123826607
    },
    "당시즌의류": {
      "sales": 7214620250,
      "tag": 8675660000,
      "discountRate": 0.1684067552209284
    },
    "차시즌의류": {
      "sales": 1043469540,
      "tag": 1073601000,
      "discountRate": 0.02806578980459218
    }
  }
};
  var itemChannelMetrics = {
  "I": {
    "Acc_etc": {
      "기타": {
        "sales": 18800,
        "tag": 37600,
        "discountRate": 0.5
      },
      "대리점": {
        "sales": 954200,
        "tag": 991100,
        "discountRate": 0.037231359095953986
      },
      "면세점": {
        "sales": 1380650,
        "tag": 1371700,
        "discountRate": -0.0065247503098344595
      },
      "백화점": {
        "sales": 7772760,
        "tag": 8338000,
        "discountRate": 0.06779083713120648
      },
      "사입": {
        "sales": 3534870,
        "tag": 32135000,
        "discountRate": 0.8899993776256419
      },
      "자사몰": {
        "sales": 697040,
        "tag": 790100,
        "discountRate": 0.11778255916972535
      },
      "제휴몰": {
        "sales": 2415700,
        "tag": 2415700,
        "discountRate": 0.0
      },
      "직영몰": {
        "sales": 975400,
        "tag": 1019100,
        "discountRate": 0.04288097340790897
      },
      "직영점(가두)": {
        "sales": 624300,
        "tag": 624300,
        "discountRate": 0.0
      }
    },
    "Bag": {
      "기타": {
        "sales": 198500,
        "tag": 397000,
        "discountRate": 0.5
      },
      "대리점": {
        "sales": 56380560,
        "tag": 61957000,
        "discountRate": 0.09000500347014861
      },
      "면세점": {
        "sales": 143158280,
        "tag": 144122000,
        "discountRate": 0.006686834764990768
      },
      "백화점": {
        "sales": 1207017240,
        "tag": 1287142000,
        "discountRate": 0.06225013246401723
      },
      "사입": {
        "sales": 248650,
        "tag": 1044000,
        "discountRate": 0.7618295019157089
      },
      "자사몰": {
        "sales": 40289230,
        "tag": 48327000,
        "discountRate": 0.16632048337368344
      },
      "제휴몰": {
        "sales": 84311730,
        "tag": 103749000,
        "discountRate": 0.18734898649625542
      },
      "직영몰": {
        "sales": 42298710,
        "tag": 49671000,
        "discountRate": 0.14842241952044455
      },
      "직영점(가두)": {
        "sales": 6832500,
        "tag": 6952000,
        "discountRate": 0.017189298043728374
      }
    },
    "Headwear": {
      "기타": {
        "sales": 102590,
        "tag": 170000,
        "discountRate": 0.3965294117647059
      },
      "대리점": {
        "sales": 24371460,
        "tag": 24961000,
        "discountRate": 0.023618444773847225
      },
      "면세점": {
        "sales": 103598280,
        "tag": 103619000,
        "discountRate": 0.00019996332718907883
      },
      "백화점": {
        "sales": 85054940,
        "tag": 90786000,
        "discountRate": 0.06312713413962501
      },
      "사입": {
        "sales": 54773770,
        "tag": 221953000,
        "discountRate": 0.753219059891058
      },
      "자사몰": {
        "sales": 3792912,
        "tag": 4636000,
        "discountRate": 0.18185677308024162
      },
      "제휴몰": {
        "sales": 19841000,
        "tag": 19841000,
        "discountRate": 0.0
      },
      "직영몰": {
        "sales": 19749920,
        "tag": 20581000,
        "discountRate": 0.04038093387104613
      },
      "직영점(가두)": {
        "sales": 8475000,
        "tag": 8475000,
        "discountRate": 0.0
      }
    },
    "Shoes": {
      "기타": {
        "sales": 130410,
        "tag": 188000,
        "discountRate": 0.3063297872340426
      },
      "대리점": {
        "sales": 35528730,
        "tag": 36801000,
        "discountRate": 0.034571614901768966
      },
      "면세점": {
        "sales": 41736000,
        "tag": 41736000,
        "discountRate": 0.0
      },
      "백화점": {
        "sales": 188836290,
        "tag": 218030000,
        "discountRate": 0.13389767463193136
      },
      "사입": {
        "sales": 199028930,
        "tag": 753674000,
        "discountRate": 0.7359217247775564
      },
      "자사몰": {
        "sales": 13760490,
        "tag": 16017000,
        "discountRate": 0.14088218767559468
      },
      "제휴몰": {
        "sales": 49434680,
        "tag": 53757000,
        "discountRate": 0.08040478449318234
      },
      "직영몰": {
        "sales": 26938640,
        "tag": 29273000,
        "discountRate": 0.07974447443036248
      },
      "직영점(가두)": {
        "sales": 7457000,
        "tag": 7457000,
        "discountRate": 0.0
      }
    },
    "과시즌의류": {
      "기타": {
        "sales": 44550,
        "tag": 49000,
        "discountRate": 0.09081632653061222
      },
      "대리점": {
        "sales": 808300,
        "tag": 826000,
        "discountRate": 0.021428571428571463
      },
      "면세점": {
        "sales": 188400,
        "tag": 154000,
        "discountRate": -0.22337662337662345
      },
      "백화점": {
        "sales": 86647480,
        "tag": 169397000,
        "discountRate": 0.48849460143922263
      },
      "사입": {
        "sales": 695791280,
        "tag": 3650605000,
        "discountRate": 0.8094038440203747
      },
      "자사몰": {
        "sales": 16707190,
        "tag": 25978000,
        "discountRate": 0.3568715836477019
      },
      "제휴몰": {
        "sales": 69321060,
        "tag": 122668000,
        "discountRate": 0.43488880555646137
      },
      "직영몰": {
        "sales": 467200,
        "tag": 479000,
        "discountRate": 0.024634655532359107
      },
      "직영점(가두)": {
        "sales": 1357000,
        "tag": 1357000,
        "discountRate": 0.0
      }
    },
    "당시즌의류": {
      "기타": {
        "sales": 258500,
        "tag": 517000,
        "discountRate": 0.5
      },
      "대리점": {
        "sales": 36621790,
        "tag": 38459000,
        "discountRate": 0.04777061286044881
      },
      "면세점": {
        "sales": 50655000,
        "tag": 50655000,
        "discountRate": 0.0
      },
      "백화점": {
        "sales": 175182010,
        "tag": 196628000,
        "discountRate": 0.10906885082490791
      },
      "자사몰": {
        "sales": 13668500,
        "tag": 14528000,
        "discountRate": 0.05916161894273131
      },
      "제휴몰": {
        "sales": 110415860,
        "tag": 110416000,
        "discountRate": 1.26793218369059e-06
      },
      "직영몰": {
        "sales": 18463480,
        "tag": 19880000,
        "discountRate": 0.07125352112676053
      },
      "직영점(가두)": {
        "sales": 11366280,
        "tag": 11372000,
        "discountRate": 0.0005029897995075805
      }
    },
    "차시즌의류": {
      "기타": {
        "sales": 273000,
        "tag": 546000,
        "discountRate": 0.5
      },
      "대리점": {
        "sales": 106209300,
        "tag": 110469000,
        "discountRate": 0.038560139043532615
      },
      "면세점": {
        "sales": 125644980,
        "tag": 125645000,
        "discountRate": 1.5917863827041856e-07
      },
      "백화점": {
        "sales": 653145370,
        "tag": 702045000,
        "discountRate": 0.06965312764851261
      },
      "자사몰": {
        "sales": 33972060,
        "tag": 36403000,
        "discountRate": 0.06677856220641154
      },
      "제휴몰": {
        "sales": 69780040,
        "tag": 69780000,
        "discountRate": -5.732301520122718e-07
      },
      "직영몰": {
        "sales": 70273150,
        "tag": 74472000,
        "discountRate": 0.056381593081963666
      },
      "직영점(가두)": {
        "sales": 26486730,
        "tag": 26501000,
        "discountRate": 0.0005384702464057423
      }
    }
  },
  "M": {
    "Acc_etc": {
      "RF": {
        "sales": 7767420,
        "tag": 8040600,
        "discountRate": 0.03397507648682929
      },
      "기타": {
        "sales": 159800,
        "tag": 319600,
        "discountRate": 0.5
      },
      "대리점": {
        "sales": 9914270,
        "tag": 10294500,
        "discountRate": 0.03693525669046582
      },
      "면세점": {
        "sales": 5404110,
        "tag": 5404000,
        "discountRate": -2.0355292376095235e-05
      },
      "백화점": {
        "sales": 18871200,
        "tag": 20022000,
        "discountRate": 0.05747677554689845
      },
      "사입": {
        "sales": 8537820,
        "tag": 34153000,
        "discountRate": 0.7500125904020145
      },
      "자사몰": {
        "sales": 2275936,
        "tag": 2619000,
        "discountRate": 0.1309904543718977
      },
      "제휴몰": {
        "sales": 4208910,
        "tag": 4208900,
        "discountRate": -2.3759176981386076e-06
      },
      "직영몰": {
        "sales": 3013710,
        "tag": 3480800,
        "discountRate": 0.13419041599632264
      },
      "직영점(가두)": {
        "sales": 23928540,
        "tag": 24038300,
        "discountRate": 0.004566046683833758
      }
    },
    "Bag": {
      "RF": {
        "sales": 45649680,
        "tag": 53855000,
        "discountRate": 0.15235948379909015
      },
      "기타": {
        "sales": 159000,
        "tag": 318000,
        "discountRate": 0.5
      },
      "대리점": {
        "sales": 216225080,
        "tag": 219867000,
        "discountRate": 0.01656419562735656
      },
      "면세점": {
        "sales": 560793510,
        "tag": 806219000,
        "discountRate": 0.3044154131817781
      },
      "백화점": {
        "sales": 394843660,
        "tag": 399277000,
        "discountRate": 0.011103419430620876
      },
      "사입": {
        "sales": 260751300,
        "tag": 1026744000,
        "discountRate": 0.746040590449031
      },
      "자사몰": {
        "sales": 11254298,
        "tag": 14041000,
        "discountRate": 0.1984689124706217
      },
      "제휴몰": {
        "sales": 17360400,
        "tag": 19472000,
        "discountRate": 0.10844289235825799
      },
      "직영몰": {
        "sales": 5485940,
        "tag": 5691000,
        "discountRate": 0.03603233175188891
      },
      "직영점(가두)": {
        "sales": 68973430,
        "tag": 70018000,
        "discountRate": 0.014918592361964023
      }
    },
    "Headwear": {
      "RF": {
        "sales": 596010860,
        "tag": 777352000,
        "discountRate": 0.23328059875063034
      },
      "기타": {
        "sales": 771180,
        "tag": 1427000,
        "discountRate": 0.45957953749124036
      },
      "대리점": {
        "sales": 871297430,
        "tag": 901274000,
        "discountRate": 0.03326021831318782
      },
      "면세점": {
        "sales": 3997032700,
        "tag": 3997049000,
        "discountRate": 4.078008550845169e-06
      },
      "백화점": {
        "sales": 646841880,
        "tag": 664125000,
        "discountRate": 0.026023896103896105
      },
      "사입": {
        "sales": 352309620,
        "tag": 1337705000,
        "discountRate": 0.7366313051083759
      },
      "자사몰": {
        "sales": 100591172,
        "tag": 117711000,
        "discountRate": 0.14543949163629566
      },
      "제휴몰": {
        "sales": 357289040,
        "tag": 357875000,
        "discountRate": 0.0016373314704855035
      },
      "직영몰": {
        "sales": 72355050,
        "tag": 72995000,
        "discountRate": 0.008767038838276564
      },
      "직영점(가두)": {
        "sales": 679807940,
        "tag": 776026000,
        "discountRate": 0.12398819111730797
      }
    },
    "Shoes": {
      "RF": {
        "sales": 571877290,
        "tag": 687273000,
        "discountRate": 0.16790374421809096
      },
      "기타": {
        "sales": 851860,
        "tag": 1599000,
        "discountRate": 0.46725453408380235
      },
      "대리점": {
        "sales": 1317825910,
        "tag": 1402440000,
        "discountRate": 0.06033348307235964
      },
      "면세점": {
        "sales": 482163810,
        "tag": 521928000,
        "discountRate": 0.07618711776336962
      },
      "백화점": {
        "sales": 1950296100,
        "tag": 2084020000,
        "discountRate": 0.06416632278001166
      },
      "사입": {
        "sales": 389571470,
        "tag": 1769559000,
        "discountRate": 0.7798482729312783
      },
      "자사몰": {
        "sales": 48710172,
        "tag": 61020000,
        "discountRate": 0.2017343166175024
      },
      "제휴몰": {
        "sales": 273270320,
        "tag": 318118000,
        "discountRate": 0.14097812761302408
      },
      "직영몰": {
        "sales": 37429830,
        "tag": 38202000,
        "discountRate": 0.020212816082927576
      },
      "직영점(가두)": {
        "sales": 240726700,
        "tag": 241239000,
        "discountRate": 0.002123620144338201
      }
    },
    "과시즌의류": {
      "기타": {
        "sales": 40460,
        "tag": 89000,
        "discountRate": 0.5453932584269663
      },
      "대리점": {
        "sales": 790160,
        "tag": 1064000,
        "discountRate": 0.2573684210526316
      },
      "면세점": {
        "sales": 119000,
        "tag": 119000,
        "discountRate": 0.0
      },
      "백화점": {
        "sales": 4349340,
        "tag": 8926000,
        "discountRate": 0.5127335872731347
      },
      "사입": {
        "sales": 912805070,
        "tag": 4140911000,
        "discountRate": 0.7795641901021297
      },
      "자사몰": {
        "sales": 2018220,
        "tag": 3603000,
        "discountRate": 0.43985012489592
      },
      "제휴몰": {
        "sales": 2150000,
        "tag": 4123000,
        "discountRate": 0.47853504729565854
      },
      "직영몰": {
        "sales": 108500,
        "tag": 158000,
        "discountRate": 0.31329113924050633
      },
      "직영점(가두)": {
        "sales": 326000,
        "tag": 326000,
        "discountRate": 0.0
      }
    },
    "당시즌의류": {
      "RF": {
        "sales": 77023720,
        "tag": 82913000,
        "discountRate": 0.07102963347122893
      },
      "기타": {
        "sales": 1322680,
        "tag": 2125000,
        "discountRate": 0.37756235294117646
      },
      "대리점": {
        "sales": 205787540,
        "tag": 224393000,
        "discountRate": 0.08291461854870696
      },
      "면세점": {
        "sales": 183614010,
        "tag": 183614000,
        "discountRate": -5.4462077958561395e-08
      },
      "백화점": {
        "sales": 361533510,
        "tag": 387013000,
        "discountRate": 0.06583626389811192
      },
      "자사몰": {
        "sales": 25915836,
        "tag": 27882000,
        "discountRate": 0.07051732300408864
      },
      "제휴몰": {
        "sales": 185975000,
        "tag": 185975000,
        "discountRate": 0.0
      },
      "직영몰": {
        "sales": 29300400,
        "tag": 31582000,
        "discountRate": 0.07224368311063267
      },
      "직영점(가두)": {
        "sales": 128133890,
        "tag": 129143000,
        "discountRate": 0.007813896223566097
      }
    },
    "차시즌의류": {
      "RF": {
        "sales": 202515570,
        "tag": 232762000,
        "discountRate": 0.12994573856557345
      },
      "기타": {
        "sales": 892500,
        "tag": 1785000,
        "discountRate": 0.5
      },
      "대리점": {
        "sales": 445248690,
        "tag": 459695000,
        "discountRate": 0.0314258584496242
      },
      "면세점": {
        "sales": 1151548560,
        "tag": 1151537000,
        "discountRate": -1.0038756896202372e-05
      },
      "백화점": {
        "sales": 808911930,
        "tag": 834509000,
        "discountRate": 0.03067321023500047
      },
      "자사몰": {
        "sales": 63962134,
        "tag": 67192000,
        "discountRate": 0.04806920466722231
      },
      "제휴몰": {
        "sales": 65106000,
        "tag": 65106000,
        "discountRate": 0.0
      },
      "직영몰": {
        "sales": 62625860,
        "tag": 63709000,
        "discountRate": 0.017001365584140338
      },
      "직영점(가두)": {
        "sales": 286143530,
        "tag": 286682000,
        "discountRate": 0.0018782832546165862
      }
    }
  },
  "ST": {
    "Acc_etc": {
      "면세점": {
        "sales": 294800,
        "tag": 294800,
        "discountRate": 0.0
      },
      "백화점": {
        "sales": 55720,
        "tag": 59700,
        "discountRate": 0.06666666666666665
      },
      "아울렛": {
        "sales": 315460,
        "tag": 348300,
        "discountRate": 0.09428653459661207
      },
      "자사몰": {
        "sales": 591040,
        "tag": 612900,
        "discountRate": 0.03566650350791323
      },
      "제휴몰": {
        "sales": 670900,
        "tag": 873900,
        "discountRate": 0.23229202425906859
      },
      "직영몰": {
        "sales": 428130,
        "tag": 483700,
        "discountRate": 0.11488525945834194
      },
      "직영점(가두)": {
        "sales": 108000,
        "tag": 108000,
        "discountRate": 0.0
      }
    },
    "Bag": {
      "면세점": {
        "sales": 358000,
        "tag": 358000,
        "discountRate": 0.0
      },
      "아울렛": {
        "sales": 330660,
        "tag": 447000,
        "discountRate": 0.26026845637583895
      },
      "자사몰": {
        "sales": 1781670,
        "tag": 1929000,
        "discountRate": 0.07637636080870913
      },
      "제휴몰": {
        "sales": 3379700,
        "tag": 4339000,
        "discountRate": 0.22108780825074903
      },
      "직영몰": {
        "sales": 2197670,
        "tag": 2674000,
        "discountRate": 0.17813388182498135
      },
      "직영점(가두)": {
        "sales": 248000,
        "tag": 248000,
        "discountRate": 0.0
      }
    },
    "Headwear": {
      "면세점": {
        "sales": 246000,
        "tag": 246000,
        "discountRate": 0.0
      },
      "백화점": {
        "sales": 87200,
        "tag": 98000,
        "discountRate": 0.11020408163265305
      },
      "아울렛": {
        "sales": 651870,
        "tag": 915000,
        "discountRate": 0.2875737704918033
      },
      "자사몰": {
        "sales": 1982370,
        "tag": 2245000,
        "discountRate": 0.1169844097995546
      },
      "제휴몰": {
        "sales": 1245200,
        "tag": 1466000,
        "discountRate": 0.15061391541609825
      },
      "직영몰": {
        "sales": 1067900,
        "tag": 1175000,
        "discountRate": 0.0911489361702128
      },
      "직영점(가두)": {
        "sales": 53100,
        "tag": 59000,
        "discountRate": 0.09999999999999998
      }
    },
    "Shoes": {
      "기타": {
        "sales": 59730,
        "tag": 219000,
        "discountRate": 0.7272602739726027
      },
      "면세점": {
        "sales": 298800,
        "tag": 996000,
        "discountRate": 0.7
      },
      "백화점": {
        "sales": 232200,
        "tag": 258000,
        "discountRate": 0.09999999999999998
      },
      "아울렛": {
        "sales": 316440,
        "tag": 617000,
        "discountRate": 0.4871312803889789
      },
      "자사몰": {
        "sales": 1638060,
        "tag": 1791000,
        "discountRate": 0.08539363484087104
      },
      "제휴몰": {
        "sales": 6941800,
        "tag": 22277000,
        "discountRate": 0.6883871257350631
      },
      "직영몰": {
        "sales": 1455980,
        "tag": 1750000,
        "discountRate": 0.1680114285714286
      },
      "직영점(가두)": {
        "sales": 199000,
        "tag": 199000,
        "discountRate": 0.0
      }
    },
    "과시즌의류": {
      "기타": {
        "sales": 126360,
        "tag": 139000,
        "discountRate": 0.0909352517985611
      },
      "면세점": {
        "sales": 1433300,
        "tag": 1784000,
        "discountRate": 0.19658071748878925
      },
      "백화점": {
        "sales": 288000,
        "tag": 288000,
        "discountRate": 0.0
      },
      "아울렛": {
        "sales": 49532770,
        "tag": 109030000,
        "discountRate": 0.5456959552416766
      },
      "자사몰": {
        "sales": 1915400,
        "tag": 2353000,
        "discountRate": 0.1859753506162346
      },
      "제휴몰": {
        "sales": 27330800,
        "tag": 55029000,
        "discountRate": 0.5033382398371767
      },
      "직영몰": {
        "sales": 7892810,
        "tag": 13098000,
        "discountRate": 0.39740342036952203
      },
      "직영점(가두)": {
        "sales": 157000,
        "tag": 157000,
        "discountRate": 0.0
      }
    },
    "당시즌의류": {
      "기타": {
        "sales": 252720,
        "tag": 278000,
        "discountRate": 0.0909352517985611
      },
      "면세점": {
        "sales": 3326000,
        "tag": 3326000,
        "discountRate": 0.0
      },
      "백화점": {
        "sales": 1433500,
        "tag": 1542000,
        "discountRate": 0.07036316472114135
      },
      "아울렛": {
        "sales": 161100,
        "tag": 179000,
        "discountRate": 0.09999999999999998
      },
      "자사몰": {
        "sales": 6607930,
        "tag": 7052000,
        "discountRate": 0.06297078842881454
      },
      "제휴몰": {
        "sales": 2581000,
        "tag": 2581000,
        "discountRate": 0.0
      },
      "직영몰": {
        "sales": 2578690,
        "tag": 3160000,
        "discountRate": 0.18395886075949364
      },
      "직영점(가두)": {
        "sales": 4258400,
        "tag": 4336000,
        "discountRate": 0.017896678966789703
      }
    },
    "차시즌의류": {
      "면세점": {
        "sales": 8560000,
        "tag": 8560000,
        "discountRate": 0.0
      },
      "백화점": {
        "sales": 0,
        "tag": 0,
        "discountRate": 0.0
      },
      "자사몰": {
        "sales": 17288800,
        "tag": 18809000,
        "discountRate": 0.08082301026104521
      },
      "제휴몰": {
        "sales": 4591000,
        "tag": 4591000,
        "discountRate": 0.0
      },
      "직영몰": {
        "sales": 13009540,
        "tag": 14864000,
        "discountRate": 0.12476184068891283
      },
      "직영점(가두)": {
        "sales": 7680600,
        "tag": 8047000,
        "discountRate": 0.04553249658257741
      }
    }
  },
  "V": {
    "Acc_etc": {
      "기타": {
        "sales": 0,
        "tag": 0,
        "discountRate": 0.0
      },
      "백화점": {
        "sales": 1349000,
        "tag": 1475000,
        "discountRate": 0.08542372881355931
      },
      "아울렛": {
        "sales": 51000,
        "tag": 120000,
        "discountRate": 0.575
      },
      "자사몰": {
        "sales": -75930,
        "tag": -110000,
        "discountRate": 0.0
      },
      "제휴몰": {
        "sales": 1967000,
        "tag": 2515000,
        "discountRate": 0.21789264413518883
      },
      "직영몰": {
        "sales": 342000,
        "tag": 380000,
        "discountRate": 0.09999999999999998
      }
    },
    "Bag": {
      "기타": {
        "sales": 0,
        "tag": 0,
        "discountRate": 0.0
      },
      "백화점": {
        "sales": 8724000,
        "tag": 9690000,
        "discountRate": 0.09969040247678018
      },
      "아울렛": {
        "sales": 2912100,
        "tag": 3600000,
        "discountRate": 0.19108333333333338
      },
      "자사몰": {
        "sales": 2524900,
        "tag": 2780000,
        "discountRate": 0.09176258992805753
      },
      "제휴몰": {
        "sales": 5511000,
        "tag": 6730000,
        "discountRate": 0.1811292719167905
      },
      "직영몰": {
        "sales": 2340000,
        "tag": 2600000,
        "discountRate": 0.09999999999999998
      },
      "직영점(가두)": {
        "sales": 290000,
        "tag": 290000,
        "discountRate": 0.0
      }
    },
    "Headwear": {
      "기타": {
        "sales": 136360,
        "tag": 150000,
        "discountRate": 0.09093333333333331
      },
      "백화점": {
        "sales": 4126400,
        "tag": 4920000,
        "discountRate": 0.16130081300813004
      },
      "아울렛": {
        "sales": 921200,
        "tag": 1320000,
        "discountRate": 0.3021212121212121
      },
      "자사몰": {
        "sales": 1072910,
        "tag": 1638000,
        "discountRate": 0.34498778998779
      },
      "제휴몰": {
        "sales": 1945000,
        "tag": 3142000,
        "discountRate": 0.3809675366008911
      },
      "직영몰": {
        "sales": 324000,
        "tag": 360000,
        "discountRate": 0.09999999999999998
      },
      "직영점(가두)": {
        "sales": 190000,
        "tag": 190000,
        "discountRate": 0.0
      }
    },
    "Shoes": {
      "기타": {
        "sales": 152180,
        "tag": 279000,
        "discountRate": 0.45455197132616487
      },
      "백화점": {
        "sales": 5247290,
        "tag": 5846000,
        "discountRate": 0.10241361614779332
      },
      "아울렛": {
        "sales": 1721200,
        "tag": 4992000,
        "discountRate": 0.6552083333333334
      },
      "자사몰": {
        "sales": 1381950,
        "tag": 1658000,
        "discountRate": 0.16649577804583837
      },
      "제휴몰": {
        "sales": 15694900,
        "tag": 19220000,
        "discountRate": 0.18340790842872012
      },
      "직영몰": {
        "sales": 817200,
        "tag": 908000,
        "discountRate": 0.09999999999999998
      },
      "직영점(가두)": {
        "sales": 1419000,
        "tag": 1419000,
        "discountRate": 0.0
      }
    },
    "과시즌의류": {
      "기타": {
        "sales": 703640,
        "tag": 1290000,
        "discountRate": 0.45454263565891473
      },
      "백화점": {
        "sales": 17118910,
        "tag": 31720000,
        "discountRate": 0.46031179066834804
      },
      "아울렛": {
        "sales": 242902180,
        "tag": 598250000,
        "discountRate": 0.5939788048474718
      },
      "자사몰": {
        "sales": 10068810,
        "tag": 18610000,
        "discountRate": 0.4589570123589468
      },
      "제휴몰": {
        "sales": 72028600,
        "tag": 145798000,
        "discountRate": 0.5059699035652067
      },
      "직영몰": {
        "sales": 187000,
        "tag": 430000,
        "discountRate": 0.5651162790697675
      }
    },
    "당시즌의류": {
      "기타": {
        "sales": 0,
        "tag": 0,
        "discountRate": 0.0
      },
      "백화점": {
        "sales": 496706130,
        "tag": 552480000,
        "discountRate": 0.10095183536055607
      },
      "아울렛": {
        "sales": 51881900,
        "tag": 57750000,
        "discountRate": 0.10161212121212126
      },
      "자사몰": {
        "sales": 16813960,
        "tag": 18310000,
        "discountRate": 0.08170617149098858
      },
      "제휴몰": {
        "sales": 76030000,
        "tag": 76030000,
        "discountRate": 0.0
      },
      "직영몰": {
        "sales": 71954900,
        "tag": 80040000,
        "discountRate": 0.10101324337831086
      },
      "직영점(가두)": {
        "sales": 16080000,
        "tag": 16080000,
        "discountRate": 0.0
      }
    },
    "차시즌의류": {
      "기타": {
        "sales": 0,
        "tag": 0,
        "discountRate": 0.0
      },
      "백화점": {
        "sales": 158266000,
        "tag": 175390000,
        "discountRate": 0.09763384457494728
      },
      "아울렛": {
        "sales": 7928000,
        "tag": 8710000,
        "discountRate": 0.08978185993111365
      },
      "자사몰": {
        "sales": 14683330,
        "tag": 15460000,
        "discountRate": 0.05023738680465717
      },
      "제휴몰": {
        "sales": 13600000,
        "tag": 13600000,
        "discountRate": 0.0
      },
      "직영몰": {
        "sales": 33606000,
        "tag": 37340000,
        "discountRate": 0.09999999999999998
      },
      "직영점(가두)": {
        "sales": 3380000,
        "tag": 3380000,
        "discountRate": 0.0
      }
    }
  },
  "W": {
    "Acc_etc": {
      "자사몰": {
        "sales": 41060,
        "tag": 85000,
        "discountRate": 0.5169411764705882
      },
      "제휴몰": {
        "sales": 36000,
        "tag": 68000,
        "discountRate": 0.47058823529411764
      }
    },
    "Bag": {
      "자사몰": {
        "sales": 566100,
        "tag": 2771000,
        "discountRate": 0.7957055214723927
      },
      "제휴몰": {
        "sales": 787000,
        "tag": 2707000,
        "discountRate": 0.7092722571111931
      }
    },
    "Headwear": {
      "자사몰": {
        "sales": 1556400,
        "tag": 5927000,
        "discountRate": 0.7374050953264721
      },
      "제휴몰": {
        "sales": 410000,
        "tag": 1904000,
        "discountRate": 0.7846638655462185
      }
    },
    "Shoes": {
      "자사몰": {
        "sales": 1346000,
        "tag": 5302000,
        "discountRate": 0.7461335345152773
      },
      "제휴몰": {
        "sales": 1541000,
        "tag": 5311000,
        "discountRate": 0.7098474863490868
      }
    },
    "과시즌의류": {
      "기타": {
        "sales": 152730,
        "tag": 488000,
        "discountRate": 0.6870286885245902
      },
      "자사몰": {
        "sales": 11234118,
        "tag": 44690000,
        "discountRate": 0.748621212799284
      },
      "제휴몰": {
        "sales": 7115000,
        "tag": 24969000,
        "discountRate": 0.7150466578557411
      }
    },
    "당시즌의류": {
      "자사몰": {
        "sales": 19000,
        "tag": 49000,
        "discountRate": 0.6122448979591837
      }
    }
  },
  "X": {
    "Acc_etc": {
      "기타": {
        "sales": 27300,
        "tag": 39000,
        "discountRate": 0.30000000000000004
      },
      "대리점": {
        "sales": 28403050,
        "tag": 34030000,
        "discountRate": 0.16535263003232437
      },
      "면세점": {
        "sales": 1071710,
        "tag": 2149000,
        "discountRate": 0.5012982782689623
      },
      "백화점": {
        "sales": 16482710,
        "tag": 22950400,
        "discountRate": 0.2818116459843837
      },
      "아울렛": {
        "sales": 2100550,
        "tag": 4256000,
        "discountRate": 0.5064497180451129
      },
      "자사몰": {
        "sales": 1844100,
        "tag": 3233800,
        "discountRate": 0.4297420990784835
      },
      "제휴몰": {
        "sales": 44777290,
        "tag": 59102000,
        "discountRate": 0.24237267774356197
      },
      "직영몰": {
        "sales": 815480,
        "tag": 882000,
        "discountRate": 0.07541950113378681
      },
      "직영점(가두)": {
        "sales": 2639100,
        "tag": 2715000,
        "discountRate": 0.027955801104972422
      }
    },
    "Bag": {
      "기타": {
        "sales": 787160,
        "tag": 1083000,
        "discountRate": 0.2731671283471837
      },
      "대리점": {
        "sales": 397051990,
        "tag": 445788000,
        "discountRate": 0.10932553141852186
      },
      "면세점": {
        "sales": 281486640,
        "tag": 288661000,
        "discountRate": 0.02485392900322525
      },
      "백화점": {
        "sales": 1286401570,
        "tag": 1540915000,
        "discountRate": 0.16517032412560073
      },
      "아울렛": {
        "sales": 413084920,
        "tag": 496561000,
        "discountRate": 0.1681084096415143
      },
      "자사몰": {
        "sales": 147065341,
        "tag": 169711000,
        "discountRate": 0.1334366010453064
      },
      "제휴몰": {
        "sales": 309006590,
        "tag": 387330000,
        "discountRate": 0.20221364211395965
      },
      "직영몰": {
        "sales": 77762090,
        "tag": 83276000,
        "discountRate": 0.06621247418223741
      },
      "직영점(가두)": {
        "sales": 10819000,
        "tag": 11262000,
        "discountRate": 0.03933581957023624
      }
    },
    "Headwear": {
      "기타": {
        "sales": 65460,
        "tag": 90000,
        "discountRate": 0.2726666666666666
      },
      "대리점": {
        "sales": 50286230,
        "tag": 57685000,
        "discountRate": 0.12826159313513041
      },
      "면세점": {
        "sales": 5492460,
        "tag": 6269000,
        "discountRate": 0.12386983569947363
      },
      "백화점": {
        "sales": 28264720,
        "tag": 38602000,
        "discountRate": 0.2677913061499404
      },
      "아울렛": {
        "sales": 9771590,
        "tag": 18716000,
        "discountRate": 0.47790179525539644
      },
      "자사몰": {
        "sales": 3506170,
        "tag": 4402000,
        "discountRate": 0.20350522489777378
      },
      "제휴몰": {
        "sales": 10580900,
        "tag": 18697000,
        "discountRate": 0.43408568219500454
      },
      "직영몰": {
        "sales": 4084720,
        "tag": 4315000,
        "discountRate": 0.053367323290845925
      },
      "직영점(가두)": {
        "sales": 5270600,
        "tag": 5710000,
        "discountRate": 0.07695271453590191
      }
    },
    "Shoes": {
      "기타": {
        "sales": 685460,
        "tag": 1012000,
        "discountRate": 0.3226679841897233
      },
      "대리점": {
        "sales": 309845830,
        "tag": 351504000,
        "discountRate": 0.11851407096363054
      },
      "면세점": {
        "sales": 88630320,
        "tag": 101606000,
        "discountRate": 0.1277058441430624
      },
      "백화점": {
        "sales": 412467540,
        "tag": 556907000,
        "discountRate": 0.25936010859982006
      },
      "사입": {
        "sales": 169059990,
        "tag": 359700000,
        "discountRate": 0.5299972477064221
      },
      "아울렛": {
        "sales": 141122570,
        "tag": 188311000,
        "discountRate": 0.2505877511138489
      },
      "자사몰": {
        "sales": 83107391,
        "tag": 102645000,
        "discountRate": 0.19034155584782497
      },
      "제휴몰": {
        "sales": 176081440,
        "tag": 226499000,
        "discountRate": 0.22259506664488582
      },
      "직영몰": {
        "sales": 34236430,
        "tag": 36687000,
        "discountRate": 0.06679668547441875
      },
      "직영점(가두)": {
        "sales": 12133000,
        "tag": 13109000,
        "discountRate": 0.07445266610725454
      }
    },
    "과시즌의류": {
      "기타": {
        "sales": 509180,
        "tag": 826000,
        "discountRate": 0.3835593220338983
      },
      "대리점": {
        "sales": 270372320,
        "tag": 492574000,
        "discountRate": 0.45110314389310036
      },
      "백화점": {
        "sales": 1451403660,
        "tag": 2949107000,
        "discountRate": 0.5078497796112518
      },
      "사입": {
        "sales": 1023795740,
        "tag": 7875366000,
        "discountRate": 0.870000233639935
      },
      "아울렛": {
        "sales": 1183064050,
        "tag": 2265836000,
        "discountRate": 0.477868632151665
      },
      "자사몰": {
        "sales": 16969270,
        "tag": 27102000,
        "discountRate": 0.37387388384621056
      },
      "제휴몰": {
        "sales": 280333400,
        "tag": 530132000,
        "discountRate": 0.47120075754717694
      },
      "직영몰": {
        "sales": 11726400,
        "tag": 22042000,
        "discountRate": 0.46799745939569914
      },
      "직영점(가두)": {
        "sales": 448800,
        "tag": 748000,
        "discountRate": 0.4
      }
    },
    "당시즌의류": {
      "기타": {
        "sales": 6195870,
        "tag": 7582000,
        "discountRate": 0.18281851754154577
      },
      "대리점": {
        "sales": 2099484760,
        "tag": 2537834000,
        "discountRate": 0.17272573383444312
      },
      "면세점": {
        "sales": 667317730,
        "tag": 816259000,
        "discountRate": 0.1824681504277441
      },
      "백화점": {
        "sales": 1876474440,
        "tag": 2209453000,
        "discountRate": 0.15070633319649707
      },
      "아울렛": {
        "sales": 1271208890,
        "tag": 1577308000,
        "discountRate": 0.1940642601191397
      },
      "자사몰": {
        "sales": 224153080,
        "tag": 276298000,
        "discountRate": 0.1887270990018024
      },
      "제휴몰": {
        "sales": 713999010,
        "tag": 841478000,
        "discountRate": 0.15149414482612733
      },
      "직영몰": {
        "sales": 175617190,
        "tag": 206610000,
        "discountRate": 0.1500063404481874
      },
      "직영점(가두)": {
        "sales": 180169280,
        "tag": 202838000,
        "discountRate": 0.1117577574221793
      }
    },
    "차시즌의류": {
      "기타": {
        "sales": 698600,
        "tag": 998000,
        "discountRate": 0.30000000000000004
      },
      "대리점": {
        "sales": 517449330,
        "tag": 534700000,
        "discountRate": 0.03226233401907608
      },
      "면세점": {
        "sales": 14151000,
        "tag": 14151000,
        "discountRate": 0.0
      },
      "백화점": {
        "sales": 354294950,
        "tag": 363525000,
        "discountRate": 0.02539041331407743
      },
      "아울렛": {
        "sales": 33342120,
        "tag": 34367000,
        "discountRate": 0.029821631215992128
      },
      "자사몰": {
        "sales": 34102920,
        "tag": 35872000,
        "discountRate": 0.04931645851917932
      },
      "제휴몰": {
        "sales": 19079000,
        "tag": 19079000,
        "discountRate": 0.0
      },
      "직영몰": {
        "sales": 47225620,
        "tag": 47723000,
        "discountRate": 0.010422228275674184
      },
      "직영점(가두)": {
        "sales": 23126000,
        "tag": 23186000,
        "discountRate": 0.0025877684809798573
      }
    }
  }
};
  var brandKPI = {
  "ST": {
    "revenue": 188241120,
    "tag": 306290300,
    "cogs": 70841707,
    "grossProfit": 117399413,
    "grossProfitRate": 62.366507912830095,
    "directProfit": -157389604,
    "directProfitRate": -91.97,
    "discountRate": 38.54,
    "progressRate": 0.0,
    "progressRateForecast": 0.0,
    "revenueForecast": 358304725,
    "directProfitForecast": -160914447,
    "directProfitRateForecast": -49.4,
    "discountRateForecast": 38.54,
    "operatingProfit": -824574604,
    "operatingProfitForecast": -828099447,
    "operatingProfitRate": -481.85,
    "operatingProfitRateForecast": -254.23,
    "revenuePrevious": 547119450,
    "directProfitPrevious": -1257567683,
    "operatingProfitPrevious": -1960617400,
    "revenuePlan": 590000000,
    "directProfitPlan": -52161000,
    "directProfitRatePlan": 0.0,
    "operatingProfitPlan": -719346000,
    "revenueVsPlan": -39.3,
    "revenueVsPrevious": -34.5,
    "profitVsPlan": 0,
    "profitVsPrevious": 0,
    "channelPlan": {
      "백화점": 10000000.0,
      "면세점": 70000000.0,
      "직영점(가두)": 80000000.0,
      "제휴몰": 130000000.0,
      "자사몰": 120000000.0,
      "직영몰": 75000000.0,
      "아울렛": 105000000.0
    },
    "channelYoy": {
      "공통": 0.0,
      "백화점": 63214180.0,
      "면세점": 43177470.0,
      "제휴몰": 193405170.0,
      "자사몰": 139755830.0,
      "직영몰": 65298230.0,
      "아울렛": 40832730.0,
      "기타": 1435840.0
    },
    "channelCurrent": {
      "백화점": 3990780.0,
      "면세점": 27631975.0,
      "직영점(가두)": 24181428.0,
      "자사몰": 60539262.0,
      "제휴몰": 88967310.0,
      "아울렛": 97662011.0,
      "직영몰": 54496713.0,
      "기타": 835246.0,
      "미지정": 0.0
    },
    "itemPlan": {
      "기타": 60000.0,
      "가방": 30000.0,
      "모자": 527000.0,
      "과시즌의류": 345471000.0,
      "당시즌의류": 83912000.0,
      "차시즌의류": 160000000.0
    },
    "itemYoy": {
      "기타": 7807760.0,
      "가방": 34661590.0,
      "모자": 20031730.0,
      "신발": 59726840.0,
      "과시즌의류": 349874820.0,
      "차시즌의류": 75016710.0
    },
    "itemCurrent": {
      "기타": 4690159.0,
      "모자": 10152236.0,
      "신발": 21208092.0,
      "과시즌의류": 168789835.0,
      "당시즌의류": 40351562.0,
      "차시즌의류": 97322518.0,
      "가방": 15790325.0
    }
  },
  "W": {
    "revenue": 24804408,
    "tag": 94271000,
    "cogs": 26862417,
    "grossProfit": -2058009,
    "grossProfitRate": -8.296948671381314,
    "directProfit": -29942676,
    "directProfitRate": -132.79,
    "discountRate": 73.69,
    "progressRate": 0.0,
    "progressRateForecast": 0.0,
    "revenueForecast": 47213577,
    "directProfitForecast": -35844523,
    "directProfitRateForecast": -83.51,
    "discountRateForecast": 73.69,
    "operatingProfit": -49541676,
    "operatingProfitForecast": -55443523,
    "operatingProfitRate": -219.7,
    "operatingProfitRateForecast": -129.17,
    "revenuePrevious": 232082688,
    "directProfitPrevious": -1228305703,
    "operatingProfitPrevious": -1771471705,
    "revenuePlan": 110000000,
    "directProfitPlan": -25673000,
    "directProfitRatePlan": 0.0,
    "operatingProfitPlan": -45272000,
    "revenueVsPlan": -57.1,
    "revenueVsPrevious": -79.7,
    "profitVsPlan": 0,
    "profitVsPrevious": 0,
    "channelPlan": {
      "제휴몰": 70000000.0,
      "자사몰": 40000000.0
    },
    "channelYoy": {
      "공통": 0.0,
      "백화점": 4781120.0,
      "면세점": 123239310.0,
      "직영점(가두)": 40524640.0,
      "제휴몰": 28001720.0,
      "자사몰": 18147878.0,
      "직영몰": 16564060.0,
      "기타": 823960.0
    },
    "channelCurrent": {
      "자사몰": 28099797.0,
      "제휴몰": 18823068.0,
      "기타": 290712.0,
      "미지정": 0.0
    },
    "itemPlan": {
      "가방": 3763000.0,
      "모자": 1302000.0,
      "신발": 30437000.0,
      "과시즌의류": 74242000.0,
      "당시즌의류": 256000.0
    },
    "itemYoy": {
      "신발": 48833173.0,
      "과시즌의류": 70355730.0,
      "가방": 7999630.0,
      "모자": 6157690.0,
      "당시즌의류": 32392930.0,
      "기타": 688290.0,
      "차시즌의류": 65655245.0
    },
    "itemCurrent": {
      "기타": 146679.0,
      "가방": 2575539.0,
      "모자": 3742915.0,
      "신발": 5495217.0,
      "과시즌의류": 35217068.0,
      "당시즌의류": 36165.0
    }
  },
  "I": {
    "revenue": 4855468672,
    "tag": 8962867600,
    "cogs": 1902932205,
    "grossProfit": 2952536467,
    "grossProfitRate": 60.808475277090615,
    "directProfit": 338949440,
    "directProfitRate": 7.68,
    "discountRate": 45.83,
    "progressRate": 42.0,
    "progressRateForecast": 99.1,
    "revenueForecast": 9242068713,
    "directProfitForecast": 799262591,
    "directProfitRateForecast": 9.51,
    "discountRateForecast": 45.83,
    "operatingProfit": -859085560,
    "operatingProfitForecast": -398772409,
    "operatingProfitRate": -19.46,
    "operatingProfitRateForecast": -4.75,
    "revenuePrevious": 6902509237,
    "directProfitPrevious": 609973544,
    "operatingProfitPrevious": -479342593,
    "revenuePlan": 8061600000,
    "directProfitPlan": 806606000,
    "directProfitRatePlan": 0.0,
    "operatingProfitPlan": -391429000,
    "revenueVsPlan": 14.6,
    "revenueVsPrevious": 33.9,
    "profitVsPlan": -0.9,
    "profitVsPrevious": 31.0,
    "channelPlan": {
      "백화점": 3537000000.0,
      "면세점": 517000000.0,
      "직영점(가두)": 126000000.0,
      "대리점": 614000000.0,
      "제휴몰": 1119000000.0,
      "자사몰": 381000000.0,
      "직영몰": 442000000.0,
      "사입": 1325600000.0
    },
    "channelYoy": {
      "공통": 0.0,
      "백화점": 3078626000.0,
      "면세점": 647465030.0,
      "직영점(가두)": 99315430.0,
      "대리점": 493064870.0,
      "제휴몰": 825012900.0,
      "자사몰": 271967587.0,
      "직영몰": 296340830.0,
      "사입": 1187333410.0,
      "기타": 3383180.0
    },
    "channelCurrent": {
      "백화점": 4575202982.0,
      "면세점": 887688944.0,
      "직영점(가두)": 119152762.0,
      "자사몰": 233908213.0,
      "제휴몰": 771881070.0,
      "대리점": 496557333.0,
      "사입": 1814692043.0,
      "직영몰": 341031776.0,
      "기타": 1953590.0,
      "미지정": 0.0
    },
    "itemPlan": {
      "가방": 1930248000.0,
      "모자": 619988000.0,
      "신발": 1131639000.0,
      "과시즌의류": 961720000.0,
      "당시즌의류": 799998000.0,
      "차시즌의류": 2618007000.0
    },
    "itemYoy": {
      "기타": 39353430.0,
      "가방": 1598233727.0,
      "모자": 557451420.0,
      "신발": 1169536510.0,
      "과시즌의류": 1019406590.0,
      "차시즌의류": 1876591640.0,
      "당시즌의류": 641935920.0
    },
    "itemCurrent": {
      "기타": 34973179.0,
      "가방": 3008826988.0,
      "모자": 608642113.0,
      "신발": 1071350584.0,
      "과시즌의류": 1658524645.0,
      "당시즌의류": 793030806.0,
      "차시즌의류": 2066720399.0
    }
  },
  "X": {
    "revenue": 17063032022,
    "tag": 29559404200,
    "cogs": 6248481380,
    "grossProfit": 10814550642,
    "grossProfitRate": 63.38000554682426,
    "directProfit": 2483371374,
    "directProfitRate": 16.01,
    "discountRate": 42.28,
    "progressRate": 37.9,
    "progressRateForecast": 84.7,
    "revenueForecast": 32478371311,
    "directProfitForecast": 5545089229,
    "directProfitRateForecast": 18.78,
    "discountRateForecast": 42.28,
    "operatingProfit": -2152963626,
    "operatingProfitForecast": 908754229,
    "operatingProfitRate": -13.88,
    "operatingProfitRateForecast": 3.08,
    "revenuePrevious": 31436897330,
    "directProfitPrevious": 6523123660,
    "operatingProfitPrevious": 1876153750,
    "revenuePlan": 33118029000,
    "directProfitPlan": 6544822000,
    "directProfitRatePlan": 0.0,
    "operatingProfitPlan": 1908487000,
    "revenueVsPlan": -1.9,
    "revenueVsPrevious": 3.3,
    "profitVsPlan": -15.3,
    "profitVsPrevious": -15.0,
    "channelPlan": {
      "백화점": 10597524000.0,
      "면세점": 1250000000.0,
      "직영점(가두)": 466000000.0,
      "대리점": 7418330000.0,
      "제휴몰": 3926857000.0,
      "자사몰": 1333143000.0,
      "직영몰": 887000000.0,
      "아울렛": 5921146000.0,
      "사입": 1318030000.0
    },
    "channelYoy": {
      "공통": 0.0,
      "백화점": 9873822000.0,
      "면세점": 1410434340.0,
      "직영점(가두)": 69084400.0,
      "대리점": 7880991030.0,
      "제휴몰": 3501054870.0,
      "자사몰": 1410050880.0,
      "직영몰": 688930970.0,
      "아울렛": 5783883210.0,
      "사입": 781199680.0,
      "기타": 37445950.0
    },
    "channelCurrent": {
      "백화점": 10327637476.0,
      "면세점": 2014119414.0,
      "직영점(가두)": 446556838.0,
      "자사몰": 972176106.0,
      "제휴몰": 2957666903.0,
      "대리점": 6991113833.0,
      "아울렛": 5812509165.0,
      "사입": 2270523273.0,
      "직영몰": 668996338.0,
      "기타": 17071965.0,
      "미지정": 0.0
    },
    "itemPlan": {
      "기타": 766800000.0,
      "가방": 4446859000.0,
      "모자": 864943000.0,
      "신발": 5911942000.0,
      "과시즌의류": 6021694000.0,
      "당시즌의류": 11649997000.0,
      "차시즌의류": 3455794000.0
    },
    "itemYoy": {
      "기타": 118802860.0,
      "가방": 7450352170.0,
      "모자": 196046320.0,
      "신발": 3875516510.0,
      "과시즌의류": 6180520460.0,
      "당시즌의류": 11240527420.0,
      "차시즌의류": 2375131590.0
    },
    "itemCurrent": {
      "기타": 186843630.0,
      "가방": 5564625996.0,
      "모자": 223316412.0,
      "신발": 2716905873.0,
      "과시즌의류": 8067942767.0,
      "당시즌의류": 13732560254.0,
      "차시즌의류": 1986176376.0
    }
  },
  "V": {
    "revenue": 1365024020,
    "tag": 1926780000,
    "cogs": 330252407,
    "grossProfit": 1034771613,
    "grossProfitRate": 75.80611021042692,
    "directProfit": 238153191,
    "directProfitRate": 19.19,
    "discountRate": 29.16,
    "progressRate": 34.7,
    "progressRateForecast": 80.9,
    "revenueForecast": 2598234412,
    "directProfitForecast": 554630240,
    "directProfitRateForecast": 23.48,
    "discountRateForecast": 29.16,
    "operatingProfit": -443971809,
    "operatingProfitForecast": -127494760,
    "operatingProfitRate": -35.78,
    "operatingProfitRateForecast": -5.4,
    "revenuePrevious": 1732266250,
    "directProfitPrevious": 308002531,
    "operatingProfitPrevious": -568220916,
    "revenuePlan": 2650000000,
    "directProfitPlan": 685411000,
    "directProfitRatePlan": 0.0,
    "operatingProfitPlan": 3286000,
    "revenueVsPlan": -2.0,
    "revenueVsPrevious": 50.0,
    "profitVsPlan": -19.1,
    "profitVsPrevious": 80.1,
    "channelPlan": {
      "백화점": 1245000000.0,
      "직영점(가두)": 145000000.0,
      "제휴몰": 496074000.0,
      "자사몰": 185000000.0,
      "직영몰": 40000000.0,
      "아울렛": 538926000.0
    },
    "channelYoy": {
      "공통": 0.0,
      "백화점": 636816370.0,
      "제휴몰": 388468200.0,
      "자사몰": 53319220.0,
      "직영몰": 119307690.0,
      "아울렛": 532719770.0,
      "기타": 1635000.0
    },
    "channelCurrent": {
      "백화점": 1316297077.0,
      "직영점(가두)": 40655467.0,
      "자사몰": 88452488.0,
      "제휴몰": 355516916.0,
      "아울렛": 586862454.0,
      "직영몰": 208561460.0,
      "기타": 1888550.0,
      "미지정": 0.0
    },
    "itemPlan": {
      "기타": 10007000.0,
      "가방": 58225000.0,
      "모자": 6573000.0,
      "신발": 87592000.0,
      "과시즌의류": 696821000.0,
      "당시즌의류": 1540782000.0,
      "차시즌의류": 250000000.0
    },
    "itemYoy": {
      "기타": 5195810.0,
      "가방": 26032310.0,
      "모자": 18000010.0,
      "과시즌의류": 576678760.0,
      "신발": 55659260.0,
      "당시즌의류": 812444190.0,
      "차시즌의류": 238255910.0
    },
    "itemCurrent": {
      "기타": 6915309.0,
      "가방": 42450406.0,
      "모자": 16590092.0,
      "신발": 50314867.0,
      "과시즌의류": 652895583.0,
      "당시즌의류": 1388492767.0,
      "차시즌의류": 440575390.0
    }
  },
  "M": {
    "revenue": 19860876458,
    "tag": 27433955700,
    "cogs": 4592333206,
    "grossProfit": 15268543252,
    "grossProfitRate": 76.87748969331008,
    "directProfit": 4663541953,
    "directProfitRate": 25.83,
    "discountRate": 27.6,
    "progressRate": 64.8,
    "progressRateForecast": 135.6,
    "revenueForecast": 37803886163,
    "directProfitForecast": 9761028997,
    "directProfitRateForecast": 28.4,
    "discountRateForecast": 27.6,
    "operatingProfit": 962418953,
    "operatingProfitForecast": 6059905997,
    "operatingProfitRate": 5.33,
    "operatingProfitRateForecast": 17.63,
    "revenuePrevious": 29147454659,
    "directProfitPrevious": 6436313228,
    "operatingProfitPrevious": 2705537561,
    "revenuePlan": 29159055000,
    "directProfitPlan": 7196822000,
    "directProfitRatePlan": 0.0,
    "operatingProfitPlan": 3495699000,
    "revenueVsPlan": 29.6,
    "revenueVsPrevious": 29.7,
    "profitVsPlan": 35.6,
    "profitVsPrevious": 51.7,
    "channelPlan": {
      "백화점": 6402680000.0,
      "면세점": 8750000000.0,
      "RF": 1923490000.0,
      "직영점(가두)": 2168142000.0,
      "대리점": 4210813000.0,
      "제휴몰": 1677000000.0,
      "자사몰": 622875000.0,
      "직영몰": 555000000.0,
      "사입": 2849055000.0
    },
    "channelYoy": {
      "공통": 0.0,
      "백화점": 6460690860.0,
      "면세점": 9839154720.0,
      "RF": 1729279370.0,
      "직영점(가두)": 1145329040.0,
      "대리점": 4098266320.0,
      "제휴몰": 1489579570.0,
      "자사몰": 558609349.0,
      "직영몰": 464169970.0,
      "사입": 3351773220.0,
      "기타": 10602240.0
    },
    "channelCurrent": {
      "RF": 2856759935.0,
      "백화점": 7967107921.0,
      "면세점": 12145201060.0,
      "직영점(가두)": 2718181287.0,
      "자사몰": 484857733.0,
      "제휴몰": 1723293228.0,
      "대리점": 5838004515.0,
      "사입": 3662161769.0,
      "직영몰": 400329085.0,
      "기타": 7989630.0,
      "미지정": 0.0
    },
    "itemPlan": {
      "가방": 2652613000.0,
      "모자": 10110045000.0,
      "신발": 8886416000.0,
      "과시즌의류": 1458678000.0,
      "당시즌의류": 1052401000.0,
      "차시즌의류": 4998902000.0
    },
    "itemYoy": {
      "기타": 104038950.0,
      "가방": 3966896429.0,
      "모자": 9488360499.0,
      "신발": 8039287240.0,
      "과시즌의류": 1443224350.0,
      "당시즌의류": 1123905305.0,
      "차시즌의류": 4981741886.0
    },
    "itemCurrent": {
      "기타": 160044078.0,
      "가방": 3010275309.0,
      "모자": 14607543828.0,
      "신발": 10112423461.0,
      "당시즌의류": 2281469659.0,
      "차시즌의류": 5875817567.0,
      "과시즌의류": 1756312268.0
    }
  }
};
  var channelPL = {
  "I": {
    "기타": {
      "revenue": 1026350,
      "tag": 1904600,
      "cogs": 420335,
      "grossProfit": 606015,
      "grossProfitRate": 59.045647196375505,
      "discountRate": 0.46112044523784523
    },
    "대리점": {
      "revenue": 260874340,
      "tag": 274464100,
      "cogs": 59790396,
      "grossProfit": 201083944,
      "grossProfitRate": 77.08076769834857,
      "discountRate": 0.049513797979407914
    },
    "면세점": {
      "revenue": 466361590,
      "tag": 467302700,
      "cogs": 98609649,
      "grossProfit": 367751941,
      "grossProfitRate": 78.85553803862793,
      "discountRate": 0.0020139194573453034
    },
    "백화점": {
      "revenue": 2403656090,
      "tag": 2672366000,
      "cogs": 592713853,
      "grossProfit": 1810942237,
      "grossProfitRate": 75.3411540250752,
      "discountRate": 0.10055131295638398
    },
    "사입": {
      "revenue": 953377500,
      "tag": 4659411000,
      "cogs": 956654895,
      "grossProfit": -3277395,
      "grossProfitRate": -0.34376676605017426,
      "discountRate": 0.7953866915796868
    },
    "자사몰": {
      "revenue": 122887422,
      "tag": 146679100,
      "cogs": 32292634,
      "grossProfit": 90594788,
      "grossProfitRate": 73.72177438957097,
      "discountRate": 0.16220223603771766
    },
    "제휴몰": {
      "revenue": 405520070,
      "tag": 482626700,
      "cogs": 106441165,
      "grossProfit": 299078905,
      "grossProfitRate": 73.75193661808157,
      "discountRate": 0.15976453436993854
    },
    "직영몰": {
      "revenue": 179166500,
      "tag": 195375100,
      "cogs": 42356158,
      "grossProfit": 136810342,
      "grossProfitRate": 76.35933168309924,
      "discountRate": 0.08296144186234578
    },
    "직영점(가두)": {
      "revenue": 62598810,
      "tag": 62738300,
      "cogs": 13653120,
      "grossProfit": 48945690,
      "grossProfitRate": 78.18948954460956,
      "discountRate": 0.002223362762459269
    }
  },
  "M": {
    "RF": {
      "revenue": 1500844540,
      "tag": 1842195600,
      "cogs": 306359863,
      "grossProfit": 1194484677,
      "grossProfitRate": 79.58750191408899,
      "discountRate": 0.18529577423808852
    },
    "기타": {
      "revenue": 4197480,
      "tag": 7662600,
      "cogs": 1291915,
      "grossProfit": 2905565,
      "grossProfitRate": 69.22165203884235,
      "discountRate": 0.4522120429097173
    },
    "대리점": {
      "revenue": 3067089080,
      "tag": 3219027500,
      "cogs": 550176771,
      "grossProfit": 2516912309,
      "grossProfitRate": 82.06192397255055,
      "discountRate": 0.04720010003021102
    },
    "면세점": {
      "revenue": 6380675700,
      "tag": 6665870000,
      "cogs": 1132179052,
      "grossProfit": 5248496648,
      "grossProfitRate": 82.25612607141278,
      "discountRate": 0.04278425771879735
    },
    "백화점": {
      "revenue": 4185647620,
      "tag": 4397892000,
      "cogs": 747253933,
      "grossProfit": 3438393687,
      "grossProfitRate": 82.14723261868852,
      "discountRate": 0.04826048024826435
    },
    "사입": {
      "revenue": 1923975280,
      "tag": 8309072000,
      "cogs": 1367766255,
      "grossProfit": 556209025,
      "grossProfitRate": 28.909364417613514,
      "discountRate": 0.768448837607858
    },
    "자사몰": {
      "revenue": 254727768,
      "tag": 294068000,
      "cogs": 48268534,
      "grossProfit": 206459234,
      "grossProfitRate": 81.05093355978372,
      "discountRate": 0.1337793707577839
    },
    "제휴몰": {
      "revenue": 905359670,
      "tag": 954877900,
      "cogs": 158964985,
      "grossProfit": 746394685,
      "grossProfitRate": 82.44178636762118,
      "discountRate": 0.051858179983011454
    },
    "직영몰": {
      "revenue": 210319290,
      "tag": 215817800,
      "cogs": 35583638,
      "grossProfit": 174735652,
      "grossProfitRate": 83.08113440284056,
      "discountRate": 0.02547755560477405
    },
    "직영점(가두)": {
      "revenue": 1428040030,
      "tag": 1527472300,
      "cogs": 244488260,
      "grossProfit": 1183551770,
      "grossProfitRate": 82.8794533161651,
      "discountRate": 0.06509595624090858
    }
  },
  "ST": {
    "기타": {
      "revenue": 438810,
      "tag": 636000,
      "cogs": 122410,
      "grossProfit": 316400,
      "grossProfitRate": 72.10409972425424,
      "discountRate": 0.31004716981132074
    },
    "면세점": {
      "revenue": 14516900,
      "tag": 15564800,
      "cogs": 3647510,
      "grossProfit": 10869390,
      "grossProfitRate": 74.87404335636396,
      "discountRate": 0.06732498972039469
    },
    "백화점": {
      "revenue": 2096620,
      "tag": 2245700,
      "cogs": 596380,
      "grossProfit": 1500240,
      "grossProfitRate": 71.55516974940619,
      "discountRate": 0.06638464621276219
    },
    "아울렛": {
      "revenue": 51308300,
      "tag": 111536300,
      "cogs": 25599523,
      "grossProfit": 25708777,
      "grossProfitRate": 50.10646815427523,
      "discountRate": 0.5399856369630336
    },
    "자사몰": {
      "revenue": 31805270,
      "tag": 34791900,
      "cogs": 8693930,
      "grossProfit": 23111340,
      "grossProfitRate": 72.66512750874304,
      "discountRate": 0.08584268177363119
    },
    "제휴몰": {
      "revenue": 46740400,
      "tag": 91156900,
      "cogs": 19704349,
      "grossProfit": 27036051,
      "grossProfitRate": 57.84300305517283,
      "discountRate": 0.48725329623978
    },
    "직영몰": {
      "revenue": 28630720,
      "tag": 37204700,
      "cogs": 8996665,
      "grossProfit": 19634055,
      "grossProfitRate": 68.57688175498207,
      "discountRate": 0.23045421680594114
    },
    "직영점(가두)": {
      "revenue": 12704100,
      "tag": 13154000,
      "cogs": 3480940,
      "grossProfit": 9223160,
      "grossProfitRate": 72.59986933352225,
      "discountRate": 0.03420252394708834
    }
  },
  "V": {
    "기타": {
      "revenue": 992180,
      "tag": 1719000,
      "cogs": 304370,
      "grossProfit": 687810,
      "grossProfitRate": 69.32310669434982,
      "discountRate": 0.4228155904595695
    },
    "백화점": {
      "revenue": 691537730,
      "tag": 781521000,
      "cogs": 126761756,
      "grossProfit": 564775974,
      "grossProfitRate": 81.6695820776113,
      "discountRate": 0.11513864630636927
    },
    "아울렛": {
      "revenue": 308317580,
      "tag": 674742000,
      "cogs": 119845087,
      "grossProfit": 188472493,
      "grossProfitRate": 61.129337159431515,
      "discountRate": 0.5430585616428205
    },
    "자사몰": {
      "revenue": 46469930,
      "tag": 58346000,
      "cogs": 10522464,
      "grossProfit": 35947466,
      "grossProfitRate": 77.35640230144526,
      "discountRate": 0.20354557296129983
    },
    "제휴몰": {
      "revenue": 186776500,
      "tag": 267035000,
      "cogs": 50114958,
      "grossProfit": 136661542,
      "grossProfitRate": 73.16848854111733,
      "discountRate": 0.30055423446364704
    },
    "직영몰": {
      "revenue": 109571100,
      "tag": 122058000,
      "cogs": 18898842,
      "grossProfit": 90672258,
      "grossProfitRate": 82.75198295901018,
      "discountRate": 0.10230300349014398
    },
    "직영점(가두)": {
      "revenue": 21359000,
      "tag": 21359000,
      "cogs": 3804930,
      "grossProfit": 17554070,
      "grossProfitRate": 82.18582330633457,
      "discountRate": 0.0
    }
  },
  "W": {
    "기타": {
      "revenue": 152730,
      "tag": 488000,
      "cogs": 129920,
      "grossProfit": 22810,
      "grossProfitRate": 14.934852353827017,
      "discountRate": 0.6870286885245902
    },
    "자사몰": {
      "revenue": 14762678,
      "tag": 58824000,
      "cogs": 16753321,
      "grossProfit": -1990643,
      "grossProfitRate": -13.484294651688536,
      "discountRate": 0.7490364817081463
    },
    "제휴몰": {
      "revenue": 9889000,
      "tag": 34959000,
      "cogs": 9979176,
      "grossProfit": -90176,
      "grossProfitRate": -0.9118818889675396,
      "discountRate": 0.7171257759089219
    }
  },
  "X": {
    "기타": {
      "revenue": 8969030,
      "tag": 11630000,
      "cogs": 2711195,
      "grossProfit": 6257835,
      "grossProfitRate": 69.77159179978214,
      "discountRate": 0.22880223559759238
    },
    "대리점": {
      "revenue": 3672893510,
      "tag": 4454115000,
      "cogs": 993668931,
      "grossProfit": 2679224579,
      "grossProfitRate": 72.94588235965492,
      "discountRate": 0.17539320156753924
    },
    "면세점": {
      "revenue": 1058149860,
      "tag": 1229095000,
      "cogs": 289492840,
      "grossProfit": 768657020,
      "grossProfitRate": 72.64160295782679,
      "discountRate": 0.1390821213982646
    },
    "백화점": {
      "revenue": 5425789590,
      "tag": 7681459400,
      "cogs": 1658185606,
      "grossProfit": 3767603984,
      "grossProfitRate": 69.43881478455931,
      "discountRate": 0.29365120513427434
    },
    "사입": {
      "revenue": 1192855730,
      "tag": 8235066000,
      "cogs": 1603490420,
      "grossProfit": -410634690,
      "grossProfitRate": -34.42450580339669,
      "discountRate": 0.8551492204191199
    },
    "아울렛": {
      "revenue": 3053694690,
      "tag": 4585355000,
      "cogs": 968549312,
      "grossProfit": 2085145378,
      "grossProfitRate": 68.28270635005754,
      "discountRate": 0.33403309231237277
    },
    "자사몰": {
      "revenue": 510748272,
      "tag": 619263800,
      "cogs": 136015450,
      "grossProfit": 374732822,
      "grossProfitRate": 73.36937637255481,
      "discountRate": 0.1752331203600146
    },
    "제휴몰": {
      "revenue": 1553857630,
      "tag": 2082317000,
      "cogs": 445361279,
      "grossProfit": 1108496351,
      "grossProfitRate": 71.33834719465257,
      "discountRate": 0.25378430373473393
    },
    "직영몰": {
      "revenue": 351467930,
      "tag": 401535000,
      "cogs": 89994190,
      "grossProfit": 261473740,
      "grossProfitRate": 74.39476483672351,
      "discountRate": 0.12468918027071119
    },
    "직영점(가두)": {
      "revenue": 234605780,
      "tag": 259568000,
      "cogs": 61012157,
      "grossProfit": 173593623,
      "grossProfitRate": 73.99375369183147,
      "discountRate": 0.09616832583369295
    }
  }
};
  var brandPLData = {
  "MLB": {
    "tagRevenue": {
      "prev": 409.23,
      "target": 398.72,
      "forecast": 522.19,
      "yoy": 128,
      "achievement": 131
    },
    "revenue": {
      "prev": 291.47,
      "target": 291.59,
      "forecast": 378.04,
      "yoy": 130,
      "achievement": 130
    },
    "discountRate": {
      "prev": 28.8,
      "target": 26.9,
      "forecast": 27.6,
      "yoy": 0,
      "achievement": 0
    },
    "cog": {
      "prev": 74.79,
      "target": 70.3,
      "forecast": 87.33,
      "yoy": 117,
      "achievement": 124
    },
    "grossProfit": {
      "prev": 118.55,
      "target": 126.68,
      "forecast": 163.9,
      "yoy": 138,
      "achievement": 129
    },
    "directCost": {
      "prev": 54.18,
      "target": 54.71,
      "forecast": 66.29,
      "yoy": 122,
      "achievement": 121
    },
    "directCostDetail": {
      "인건비": {
        "prev": 13.47,
        "target": 14.38,
        "forecast": 18.48,
        "yoy": 137,
        "achievement": 129
      },
      "임차관리비": {
        "prev": 7.03,
        "target": 8.13,
        "forecast": 7.95,
        "yoy": 113,
        "achievement": 98
      },
      "물류운송비": {
        "prev": 14.61,
        "target": 13.09,
        "forecast": 16.97,
        "yoy": 116,
        "achievement": 130
      },
      "로열티": {
        "prev": 12.57,
        "target": 12.57,
        "forecast": 16.17,
        "yoy": 129,
        "achievement": 129
      },
      "감가상각비": {
        "prev": 2.34,
        "target": 1.93,
        "forecast": 1.81,
        "yoy": 77,
        "achievement": 94
      },
      "기타": {
        "prev": 4.17,
        "target": 4.62,
        "forecast": 4.91,
        "yoy": 118,
        "achievement": 106
      }
    },
    "directProfit": {
      "prev": 64.37,
      "target": 71.97,
      "forecast": 97.61,
      "yoy": 152,
      "achievement": 136
    },
    "operatingExpense": {
      "prev": 37.31,
      "target": 37.01,
      "forecast": 37.01,
      "yoy": 99,
      "achievement": 100
    },
    "opProfit": {
      "prev": 27.06,
      "target": 34.96,
      "forecast": 60.6,
      "yoy": 224,
      "achievement": 173
    }
  },
  "MLB_KIDS": {
    "tagRevenue": {
      "prev": 120.67,
      "target": 135.99,
      "forecast": 170.6,
      "yoy": 141,
      "achievement": 125
    },
    "revenue": {
      "prev": 69.03,
      "target": 80.62,
      "forecast": 92.42,
      "yoy": 134,
      "achievement": 115
    },
    "discountRate": {
      "prev": 42.8,
      "target": 40.7,
      "forecast": 45.8,
      "yoy": 0,
      "achievement": 0
    },
    "cog": {
      "prev": 27.6,
      "target": 33.42,
      "forecast": 37.58,
      "yoy": 136,
      "achievement": 112
    },
    "grossProfit": {
      "prev": 21.09,
      "target": 25.76,
      "forecast": 26.48,
      "yoy": 126,
      "achievement": 103
    },
    "directCost": {
      "prev": 14.99,
      "target": 17.7,
      "forecast": 19.31,
      "yoy": 129,
      "achievement": 109
    },
    "directCostDetail": {
      "인건비": {
        "prev": 5.11,
        "target": 5.87,
        "forecast": 7.59,
        "yoy": 149,
        "achievement": 129
      },
      "임차관리비": {
        "prev": 0.87,
        "target": 1.2,
        "forecast": 0.94,
        "yoy": 108,
        "achievement": 78
      },
      "물류운송비": {
        "prev": 3.43,
        "target": 4.01,
        "forecast": 4.59,
        "yoy": 134,
        "achievement": 114
      },
      "로열티": {
        "prev": 2.64,
        "target": 3.07,
        "forecast": 3.56,
        "yoy": 135,
        "achievement": 116
      },
      "감가상각비": {
        "prev": 0.7,
        "target": 0.52,
        "forecast": 0.52,
        "yoy": 74,
        "achievement": 100
      },
      "기타": {
        "prev": 2.25,
        "target": 3.04,
        "forecast": 2.1,
        "yoy": 93,
        "achievement": 69
      }
    },
    "directProfit": {
      "prev": 6.1,
      "target": 8.06,
      "forecast": 7.17,
      "yoy": 118,
      "achievement": 89
    },
    "operatingExpense": {
      "prev": 10.89,
      "target": 11.98,
      "forecast": 11.98,
      "yoy": 110,
      "achievement": 100
    },
    "opProfit": {
      "prev": -4.79,
      "target": -3.91,
      "forecast": -4.81,
      "yoy": 0,
      "achievement": 0
    }
  },
  "DISCOVERY": {
    "tagRevenue": {
      "prev": 459.28,
      "target": 482.91,
      "forecast": 562.64,
      "yoy": 123,
      "achievement": 117
    },
    "revenue": {
      "prev": 314.37,
      "target": 331.18,
      "forecast": 324.78,
      "yoy": 103,
      "achievement": 98
    },
    "discountRate": {
      "prev": 31.6,
      "target": 31.4,
      "forecast": 42.3,
      "yoy": 0,
      "achievement": 0
    },
    "cog": {
      "prev": 93.84,
      "target": 107.98,
      "forecast": 115.72,
      "yoy": 123,
      "achievement": 107
    },
    "grossProfit": {
      "prev": 132.65,
      "target": 131.97,
      "forecast": 119.7,
      "yoy": 90,
      "achievement": 91
    },
    "directCost": {
      "prev": 67.42,
      "target": 66.52,
      "forecast": 64.23,
      "yoy": 95,
      "achievement": 97
    },
    "directCostDetail": {
      "인건비": {
        "prev": 18.81,
        "target": 19.15,
        "forecast": 19.08,
        "yoy": 101,
        "achievement": 100
      },
      "임차관리비": {
        "prev": 14.5,
        "target": 14.83,
        "forecast": 14.7,
        "yoy": 101,
        "achievement": 99
      },
      "물류운송비": {
        "prev": 16.44,
        "target": 13.74,
        "forecast": 13.47,
        "yoy": 82,
        "achievement": 98
      },
      "로열티": {
        "prev": 6.49,
        "target": 7.15,
        "forecast": 7.62,
        "yoy": 117,
        "achievement": 107
      },
      "감가상각비": {
        "prev": 2.66,
        "target": 2.09,
        "forecast": 2.09,
        "yoy": 79,
        "achievement": 100
      },
      "기타": {
        "prev": 8.51,
        "target": 9.56,
        "forecast": 7.27,
        "yoy": 85,
        "achievement": 76
      }
    },
    "directProfit": {
      "prev": 65.23,
      "target": 65.45,
      "forecast": 55.47,
      "yoy": 85,
      "achievement": 85
    },
    "operatingExpense": {
      "prev": 46.47,
      "target": 46.36,
      "forecast": 46.36,
      "yoy": 100,
      "achievement": 100
    },
    "opProfit": {
      "prev": 18.76,
      "target": 19.08,
      "forecast": 9.11,
      "yoy": 49,
      "achievement": 48
    }
  },
  "DUVETICA": {
    "tagRevenue": {
      "prev": 30.26,
      "target": 40.14,
      "forecast": 36.68,
      "yoy": 121,
      "achievement": 91
    },
    "revenue": {
      "prev": 17.32,
      "target": 26.5,
      "forecast": 25.98,
      "yoy": 150,
      "achievement": 98
    },
    "discountRate": {
      "prev": 42.7,
      "target": 34.0,
      "forecast": 29.2,
      "yoy": 0,
      "achievement": 0
    },
    "cog": {
      "prev": 5.84,
      "target": 8.1,
      "forecast": 6.78,
      "yoy": 116,
      "achievement": 84
    },
    "grossProfit": {
      "prev": 8.4,
      "target": 13.89,
      "forecast": 13.69,
      "yoy": 163,
      "achievement": 99
    },
    "directCost": {
      "prev": 5.32,
      "target": 7.04,
      "forecast": 8.15,
      "yoy": 153,
      "achievement": 116
    },
    "directCostDetail": {
      "인건비": {
        "prev": 1.96,
        "target": 2.49,
        "forecast": 3.06,
        "yoy": 156,
        "achievement": 123
      },
      "임차관리비": {
        "prev": 1.0,
        "target": 1.19,
        "forecast": 2.16,
        "yoy": 216,
        "achievement": 182
      },
      "물류운송비": {
        "prev": 0.75,
        "target": 1.46,
        "forecast": 1.43,
        "yoy": 191,
        "achievement": 98
      },
      "로열티": {
        "prev": 0.27,
        "target": 0.6,
        "forecast": 0.46,
        "yoy": 170,
        "achievement": 77
      },
      "감가상각비": {
        "prev": 0.31,
        "target": 0.29,
        "forecast": 0.29,
        "yoy": 94,
        "achievement": 100
      },
      "기타": {
        "prev": 1.02,
        "target": 1.0,
        "forecast": 0.74,
        "yoy": 73,
        "achievement": 74
      }
    },
    "directProfit": {
      "prev": 3.08,
      "target": 6.85,
      "forecast": 5.54,
      "yoy": 180,
      "achievement": 81
    },
    "operatingExpense": {
      "prev": 8.76,
      "target": 6.82,
      "forecast": 6.82,
      "yoy": 78,
      "achievement": 100
    },
    "opProfit": {
      "prev": -5.68,
      "target": 0.03,
      "forecast": -1.28,
      "yoy": 0,
      "achievement": -4267
    }
  },
  "SERGIO": {
    "tagRevenue": {
      "prev": 8.99,
      "target": 9.34,
      "forecast": 5.83,
      "yoy": 65,
      "achievement": 62
    },
    "revenue": {
      "prev": 5.47,
      "target": 5.9,
      "forecast": 3.58,
      "yoy": 65,
      "achievement": 61
    },
    "discountRate": {
      "prev": 39.2,
      "target": 36.8,
      "forecast": 38.5,
      "yoy": 0,
      "achievement": 0
    },
    "cog": {
      "prev": 14.03,
      "target": 2.27,
      "forecast": 2.16,
      "yoy": 15,
      "achievement": 95
    },
    "grossProfit": {
      "prev": -8.56,
      "target": 3.34,
      "forecast": 0.98,
      "yoy": 0,
      "achievement": 29
    },
    "directCost": {
      "prev": 3.16,
      "target": 3.86,
      "forecast": 2.59,
      "yoy": 82,
      "achievement": 67
    },
    "directCostDetail": {
      "인건비": {
        "prev": 0.99,
        "target": 0.75,
        "forecast": 0.46,
        "yoy": 46,
        "achievement": 61
      },
      "임차관리비": {
        "prev": 0.59,
        "target": 0.68,
        "forecast": 0.52,
        "yoy": 88,
        "achievement": 76
      },
      "물류운송비": {
        "prev": 0.54,
        "target": 1.55,
        "forecast": 0.94,
        "yoy": 174,
        "achievement": 61
      },
      "로열티": {
        "prev": 0.18,
        "target": 0.19,
        "forecast": 0.12,
        "yoy": 67,
        "achievement": 63
      },
      "감가상각비": {
        "prev": 0.34,
        "target": 0.27,
        "forecast": 0.27,
        "yoy": 79,
        "achievement": 100
      },
      "기타": {
        "prev": 0.52,
        "target": 0.42,
        "forecast": 0.28,
        "yoy": 54,
        "achievement": 67
      }
    },
    "directProfit": {
      "prev": -11.72,
      "target": -0.52,
      "forecast": -1.61,
      "yoy": 0,
      "achievement": 0
    },
    "operatingExpense": {
      "prev": 7.03,
      "target": 6.67,
      "forecast": 6.67,
      "yoy": 95,
      "achievement": 100
    },
    "opProfit": {
      "prev": -18.75,
      "target": -7.19,
      "forecast": -8.28,
      "yoy": 0,
      "achievement": 0
    }
  },
  "SUPRA": {
    "tagRevenue": {
      "prev": 4.86,
      "target": 7.33,
      "forecast": 1.79,
      "yoy": 37,
      "achievement": 24
    },
    "revenue": {
      "prev": 2.32,
      "target": 1.1,
      "forecast": 0.47,
      "yoy": 20,
      "achievement": 43
    },
    "discountRate": {
      "prev": 52.3,
      "target": 85.0,
      "forecast": 73.7,
      "yoy": 0,
      "achievement": 0
    },
    "cog": {
      "prev": 12.1,
      "target": 1.13,
      "forecast": 0.52,
      "yoy": 4,
      "achievement": 46
    },
    "grossProfit": {
      "prev": -9.78,
      "target": 0.44,
      "forecast": -0.09,
      "yoy": 0,
      "achievement": -20
    },
    "directCost": {
      "prev": 1.8,
      "target": 0.7,
      "forecast": 0.27,
      "yoy": 15,
      "achievement": 39
    },
    "directCostDetail": {
      "인건비": {
        "prev": 0.52,
        "target": 0.0,
        "forecast": 0.0,
        "yoy": 0,
        "achievement": 0
      },
      "임차관리비": {
        "prev": 0.65,
        "target": 0.0,
        "forecast": 0.0,
        "yoy": 0,
        "achievement": 0
      },
      "물류운송비": {
        "prev": 0.26,
        "target": 0.47,
        "forecast": 0.2,
        "yoy": 77,
        "achievement": 43
      },
      "로열티": {
        "prev": 0.08,
        "target": 0.04,
        "forecast": 0.02,
        "yoy": 25,
        "achievement": 50
      },
      "감가상각비": {
        "prev": 0.19,
        "target": 0.0,
        "forecast": 0.0,
        "yoy": 0,
        "achievement": 0
      },
      "기타": {
        "prev": 0.11,
        "target": 0.19,
        "forecast": 0.05,
        "yoy": 45,
        "achievement": 26
      }
    },
    "directProfit": {
      "prev": -11.58,
      "target": -0.26,
      "forecast": -0.36,
      "yoy": 0,
      "achievement": 0
    },
    "operatingExpense": {
      "prev": 5.43,
      "target": 0.2,
      "forecast": 0.2,
      "yoy": 4,
      "achievement": 100
    },
    "opProfit": {
      "prev": -17.01,
      "target": -0.45,
      "forecast": -0.56,
      "yoy": 0,
      "achievement": 0
    }
  }
};
  if (typeof window !== 'undefined') {
    window.brandNames = brandNames;
    window.channelItemSalesData = channelItemSalesData;
    window.channelMetrics = channelMetrics;
    window.channelItemMetrics = channelItemMetrics;
    window.itemMetrics = itemMetrics;
    window.itemChannelMetrics = itemChannelMetrics;
    window.brandKPI = brandKPI;
    window.channelPL = channelPL;
    window.brandPLData = brandPLData;
  }
  // D 객체에 brandPLData 추가
  if (typeof window !== 'undefined') {
    if (typeof window.DASHBOARD_DATA === 'undefined') {
      window.DASHBOARD_DATA = {};
    }
    window.DASHBOARD_DATA.brandPLData = brandPLData;
  }
  // 전역 D 객체에 할당 (Dashboard.html에서 사용)
  if (typeof window !== 'undefined') {
    if (typeof window.D === 'undefined') {
      window.D = window.DASHBOARD_DATA || {};
    }
    window.D.brandPLData = brandPLData;
  }
  console.log('[Data.js] 모든 대시보드 데이터 로드 완료');
})();

// === 채널별 손익 데이터 (자동 생성) ===
// 생성일: 2026-02-19 16:17:22
// 기준일: 20260216, 대상월: 202602
// 매출: prevRate/targetRate/forecastRate = 할인율(%)
// 직접이익: prevRate/targetRate/forecastRate = 직접이익율(%)

var channelProfitLossData = {
  channelRevenueData: {
  "MLB": [
    {
      "channel": "백화점",
      "prev": 64.61,
      "target": 64.03,
      "forecast": 79.67,
      "prevRate": 4.7,
      "targetRate": 3.8,
      "forecastRate": 4.8,
      "yoy": 123,
      "achievement": 124
    },
    {
      "channel": "면세점",
      "prev": 98.39,
      "target": 87.5,
      "forecast": 121.45,
      "prevRate": 0.7,
      "targetRate": 1.6,
      "forecastRate": 4.3,
      "yoy": 123,
      "achievement": 139
    },
    {
      "channel": "RF",
      "prev": 17.29,
      "target": 19.23,
      "forecast": 28.57,
      "prevRate": 19.6,
      "targetRate": 8.3,
      "forecastRate": 18.5,
      "yoy": 165,
      "achievement": 149
    },
    {
      "channel": "직영점(가두)",
      "prev": 11.45,
      "target": 21.68,
      "forecast": 27.18,
      "prevRate": 8.9,
      "targetRate": 14.0,
      "forecastRate": 6.5,
      "yoy": 237,
      "achievement": 125
    },
    {
      "channel": "자사몰",
      "prev": 5.59,
      "target": 6.23,
      "forecast": 4.85,
      "prevRate": 10.4,
      "targetRate": 18.5,
      "forecastRate": 13.4,
      "yoy": 87,
      "achievement": 78
    },
    {
      "channel": "제휴몰",
      "prev": 14.9,
      "target": 16.77,
      "forecast": 17.23,
      "prevRate": 6.0,
      "targetRate": 2.7,
      "forecastRate": 5.2,
      "yoy": 116,
      "achievement": 103
    },
    {
      "channel": "대리점",
      "prev": 40.98,
      "target": 42.11,
      "forecast": 58.38,
      "prevRate": 4.7,
      "targetRate": 4.9,
      "forecastRate": 4.7,
      "yoy": 142,
      "achievement": 139
    },
    {
      "channel": "사입",
      "prev": 33.52,
      "target": 28.49,
      "forecast": 36.62,
      "prevRate": 75.5,
      "targetRate": 76.5,
      "forecastRate": 76.8,
      "yoy": 109,
      "achievement": 129
    },
    {
      "channel": "직영몰",
      "prev": 4.64,
      "target": 5.55,
      "forecast": 4.0,
      "prevRate": 22.1,
      "targetRate": 17.6,
      "forecastRate": 2.5,
      "yoy": 86,
      "achievement": 72
    },
    {
      "channel": "기타",
      "prev": 0.11,
      "target": 0.0,
      "forecast": 0.08,
      "prevRate": 48.2,
      "targetRate": 0.0,
      "forecastRate": 45.2,
      "yoy": 73,
      "achievement": 0
    }
  ],
  "MLB_KIDS": [
    {
      "channel": "백화점",
      "prev": 30.79,
      "target": 35.37,
      "forecast": 45.75,
      "prevRate": 9.7,
      "targetRate": 6.7,
      "forecastRate": 10.1,
      "yoy": 149,
      "achievement": 129
    },
    {
      "channel": "면세점",
      "prev": 6.47,
      "target": 5.17,
      "forecast": 8.88,
      "prevRate": 1.0,
      "targetRate": 1.4,
      "forecastRate": 0.2,
      "yoy": 137,
      "achievement": 172
    },
    {
      "channel": "직영점(가두)",
      "prev": 0.99,
      "target": 1.26,
      "forecast": 1.19,
      "prevRate": 2.2,
      "targetRate": 4.1,
      "forecastRate": 0.2,
      "yoy": 120,
      "achievement": 94
    },
    {
      "channel": "자사몰",
      "prev": 2.72,
      "target": 3.81,
      "forecast": 2.34,
      "prevRate": 14.6,
      "targetRate": 13.4,
      "forecastRate": 16.2,
      "yoy": 86,
      "achievement": 61
    },
    {
      "channel": "제휴몰",
      "prev": 8.25,
      "target": 11.19,
      "forecast": 7.72,
      "prevRate": 9.8,
      "targetRate": 2.2,
      "forecastRate": 16.0,
      "yoy": 94,
      "achievement": 69
    },
    {
      "channel": "대리점",
      "prev": 4.93,
      "target": 6.14,
      "forecast": 4.97,
      "prevRate": 6.5,
      "targetRate": 6.2,
      "forecastRate": 5.0,
      "yoy": 101,
      "achievement": 81
    },
    {
      "channel": "사입",
      "prev": 11.87,
      "target": 13.26,
      "forecast": 18.15,
      "prevRate": 79.6,
      "targetRate": 79.4,
      "forecastRate": 79.5,
      "yoy": 153,
      "achievement": 137
    },
    {
      "channel": "직영몰",
      "prev": 2.96,
      "target": 4.42,
      "forecast": 3.41,
      "prevRate": 6.8,
      "targetRate": 6.8,
      "forecastRate": 8.3,
      "yoy": 115,
      "achievement": 77
    },
    {
      "channel": "기타",
      "prev": 0.03,
      "target": 0.0,
      "forecast": 0.02,
      "prevRate": 59.6,
      "targetRate": 0.0,
      "forecastRate": 46.1,
      "yoy": 67,
      "achievement": 0
    }
  ],
  "DISCOVERY": [
    {
      "channel": "백화점",
      "prev": 98.74,
      "target": 105.98,
      "forecast": 103.28,
      "prevRate": 27.9,
      "targetRate": 23.3,
      "forecastRate": 29.4,
      "yoy": 105,
      "achievement": 97
    },
    {
      "channel": "면세점",
      "prev": 14.1,
      "target": 12.5,
      "forecast": 20.14,
      "prevRate": 11.7,
      "targetRate": 9.8,
      "forecastRate": 13.9,
      "yoy": 143,
      "achievement": 161
    },
    {
      "channel": "직영점(가두)",
      "prev": 0.69,
      "target": 4.66,
      "forecast": 4.47,
      "prevRate": 5.4,
      "targetRate": 5.8,
      "forecastRate": 9.6,
      "yoy": 648,
      "achievement": 96
    },
    {
      "channel": "자사몰",
      "prev": 14.1,
      "target": 13.33,
      "forecast": 9.72,
      "prevRate": 18.7,
      "targetRate": 13.6,
      "forecastRate": 17.5,
      "yoy": 69,
      "achievement": 73
    },
    {
      "channel": "제휴몰",
      "prev": 35.01,
      "target": 39.27,
      "forecast": 29.58,
      "prevRate": 24.8,
      "targetRate": 19.1,
      "forecastRate": 25.4,
      "yoy": 84,
      "achievement": 75
    },
    {
      "channel": "대리점",
      "prev": 78.81,
      "target": 74.18,
      "forecast": 69.91,
      "prevRate": 13.1,
      "targetRate": 8.8,
      "forecastRate": 17.5,
      "yoy": 89,
      "achievement": 94
    },
    {
      "channel": "사입",
      "prev": 7.81,
      "target": 13.18,
      "forecast": 22.71,
      "prevRate": 85.1,
      "targetRate": 83.1,
      "forecastRate": 85.5,
      "yoy": 291,
      "achievement": 172
    },
    {
      "channel": "직영몰",
      "prev": 6.89,
      "target": 8.87,
      "forecast": 6.69,
      "prevRate": 5.7,
      "targetRate": 7.5,
      "forecastRate": 12.5,
      "yoy": 97,
      "achievement": 75
    },
    {
      "channel": "아울렛",
      "prev": 57.84,
      "target": 59.21,
      "forecast": 58.13,
      "prevRate": 36.0,
      "targetRate": 36.2,
      "forecastRate": 33.4,
      "yoy": 101,
      "achievement": 98
    },
    {
      "channel": "기타",
      "prev": 0.37,
      "target": 0.0,
      "forecast": 0.17,
      "prevRate": 66.9,
      "targetRate": 0.0,
      "forecastRate": 22.9,
      "yoy": 46,
      "achievement": 0
    }
  ],
  "DUVETICA": [
    {
      "channel": "백화점",
      "prev": 6.37,
      "target": 12.45,
      "forecast": 13.16,
      "prevRate": 33.5,
      "targetRate": 16.4,
      "forecastRate": 11.5,
      "yoy": 207,
      "achievement": 106
    },
    {
      "channel": "직영점(가두)",
      "prev": 0.0,
      "target": 1.45,
      "forecast": 0.41,
      "prevRate": 0.0,
      "targetRate": 13.4,
      "forecastRate": 0.0,
      "yoy": 0,
      "achievement": 28
    },
    {
      "channel": "자사몰",
      "prev": 0.53,
      "target": 1.85,
      "forecast": 0.88,
      "prevRate": 32.8,
      "targetRate": 16.5,
      "forecastRate": 20.4,
      "yoy": 166,
      "achievement": 48
    },
    {
      "channel": "제휴몰",
      "prev": 3.88,
      "target": 4.96,
      "forecast": 3.56,
      "prevRate": 46.7,
      "targetRate": 32.5,
      "forecastRate": 30.1,
      "yoy": 92,
      "achievement": 72
    },
    {
      "channel": "직영몰",
      "prev": 1.19,
      "target": 0.4,
      "forecast": 2.09,
      "prevRate": 31.4,
      "targetRate": 16.8,
      "forecastRate": 10.2,
      "yoy": 176,
      "achievement": 522
    },
    {
      "channel": "아울렛",
      "prev": 5.33,
      "target": 5.39,
      "forecast": 5.87,
      "prevRate": 50.8,
      "targetRate": 60.2,
      "forecastRate": 54.3,
      "yoy": 110,
      "achievement": 109
    },
    {
      "channel": "기타",
      "prev": 0.02,
      "target": 0.0,
      "forecast": 0.02,
      "prevRate": 63.3,
      "targetRate": 0.0,
      "forecastRate": 42.3,
      "yoy": 100,
      "achievement": 0
    }
  ],
  "SERGIO": [
    {
      "channel": "백화점",
      "prev": 0.63,
      "target": 0.1,
      "forecast": 0.04,
      "prevRate": 33.0,
      "targetRate": 14.4,
      "forecastRate": 6.6,
      "yoy": 6,
      "achievement": 40
    },
    {
      "channel": "면세점",
      "prev": 0.43,
      "target": 0.7,
      "forecast": 0.28,
      "prevRate": 23.6,
      "targetRate": 4.8,
      "forecastRate": 6.7,
      "yoy": 65,
      "achievement": 40
    },
    {
      "channel": "직영점(가두)",
      "prev": 0.0,
      "target": 0.8,
      "forecast": 0.24,
      "prevRate": 0.0,
      "targetRate": 6.2,
      "forecastRate": 3.4,
      "yoy": 0,
      "achievement": 30
    },
    {
      "channel": "자사몰",
      "prev": 1.4,
      "target": 1.2,
      "forecast": 0.61,
      "prevRate": 13.6,
      "targetRate": 28.5,
      "forecastRate": 8.6,
      "yoy": 44,
      "achievement": 51
    },
    {
      "channel": "제휴몰",
      "prev": 1.93,
      "target": 1.3,
      "forecast": 0.89,
      "prevRate": 49.7,
      "targetRate": 49.8,
      "forecastRate": 48.7,
      "yoy": 46,
      "achievement": 68
    },
    {
      "channel": "직영몰",
      "prev": 0.65,
      "target": 0.75,
      "forecast": 0.54,
      "prevRate": 44.4,
      "targetRate": 11.7,
      "forecastRate": 23.0,
      "yoy": 83,
      "achievement": 72
    },
    {
      "channel": "아울렛",
      "prev": 0.41,
      "target": 1.05,
      "forecast": 0.98,
      "prevRate": 49.9,
      "targetRate": 58.3,
      "forecastRate": 54.0,
      "yoy": 239,
      "achievement": 93
    },
    {
      "channel": "기타",
      "prev": 0.01,
      "target": 0.0,
      "forecast": 0.01,
      "prevRate": 56.6,
      "targetRate": 0.0,
      "forecastRate": 31.0,
      "yoy": 100,
      "achievement": 0
    }
  ],
  "SUPRA": [
    {
      "channel": "백화점",
      "prev": 0.05,
      "target": 0.0,
      "forecast": 0.0,
      "prevRate": 76.2,
      "targetRate": 0.0,
      "forecastRate": 0.0,
      "yoy": 0,
      "achievement": 0
    },
    {
      "channel": "면세점",
      "prev": 1.23,
      "target": 0.0,
      "forecast": 0.0,
      "prevRate": 56.4,
      "targetRate": 0.0,
      "forecastRate": 0.0,
      "yoy": 0,
      "achievement": 0
    },
    {
      "channel": "직영점(가두)",
      "prev": 0.41,
      "target": 0.0,
      "forecast": 0.0,
      "prevRate": 53.6,
      "targetRate": 0.0,
      "forecastRate": 0.0,
      "yoy": 0,
      "achievement": 0
    },
    {
      "channel": "자사몰",
      "prev": 0.18,
      "target": 0.4,
      "forecast": 0.28,
      "prevRate": 36.7,
      "targetRate": 85.0,
      "forecastRate": 74.9,
      "yoy": 156,
      "achievement": 70
    },
    {
      "channel": "제휴몰",
      "prev": 0.28,
      "target": 0.7,
      "forecast": 0.19,
      "prevRate": 30.6,
      "targetRate": 85.0,
      "forecastRate": 71.7,
      "yoy": 68,
      "achievement": 27
    },
    {
      "channel": "직영몰",
      "prev": 0.17,
      "target": 0.0,
      "forecast": 0.0,
      "prevRate": 36.7,
      "targetRate": 0.0,
      "forecastRate": 0.0,
      "yoy": 0,
      "achievement": 0
    },
    {
      "channel": "기타",
      "prev": 0.01,
      "target": 0.0,
      "forecast": 0.0,
      "prevRate": 42.3,
      "targetRate": 0.0,
      "forecastRate": 68.7,
      "yoy": 0,
      "achievement": 0
    }
  ]
},
  channelProfitData: {
  "MLB": [
    {
      "channel": "백화점",
      "prev": 12.17,
      "target": 13.89,
      "forecast": 17.18,
      "prevRate": 20.7,
      "targetRate": 23.9,
      "forecastRate": 23.7,
      "yoy": 141,
      "achievement": 124
    },
    {
      "channel": "면세점",
      "prev": 25.73,
      "target": 21.8,
      "forecast": 31.3,
      "prevRate": 28.8,
      "targetRate": 27.4,
      "forecastRate": 28.3,
      "yoy": 122,
      "achievement": 144
    },
    {
      "channel": "RF",
      "prev": 4.32,
      "target": 5.65,
      "forecast": 8.31,
      "prevRate": 27.5,
      "targetRate": 32.3,
      "forecastRate": 32.0,
      "yoy": 192,
      "achievement": 147
    },
    {
      "channel": "직영점(가두)",
      "prev": 1.42,
      "target": 6.03,
      "forecast": 9.48,
      "prevRate": 13.7,
      "targetRate": 30.6,
      "forecastRate": 38.4,
      "yoy": 668,
      "achievement": 157
    },
    {
      "channel": "자사몰",
      "prev": 2.97,
      "target": 3.63,
      "forecast": 2.92,
      "prevRate": 58.6,
      "targetRate": 64.2,
      "forecastRate": 66.2,
      "yoy": 98,
      "achievement": 80
    },
    {
      "channel": "제휴몰",
      "prev": 5.45,
      "target": 7.12,
      "forecast": 7.2,
      "prevRate": 40.3,
      "targetRate": 46.7,
      "forecastRate": 46.0,
      "yoy": 132,
      "achievement": 101
    },
    {
      "channel": "대리점",
      "prev": 11.99,
      "target": 14.46,
      "forecast": 17.79,
      "prevRate": 32.2,
      "targetRate": 37.8,
      "forecastRate": 33.5,
      "yoy": 148,
      "achievement": 123
    },
    {
      "channel": "사입",
      "prev": 4.52,
      "target": 0.75,
      "forecast": 4.8,
      "prevRate": 14.8,
      "targetRate": 2.9,
      "forecastRate": 14.4,
      "yoy": 106,
      "achievement": 640
    },
    {
      "channel": "직영몰",
      "prev": 0.04,
      "target": 0.84,
      "forecast": 0.67,
      "prevRate": 1.0,
      "targetRate": 16.6,
      "forecastRate": 18.4,
      "yoy": 1675,
      "achievement": 80
    },
    {
      "channel": "기타",
      "prev": 0.05,
      "target": 0.0,
      "forecast": 0.04,
      "prevRate": 52.9,
      "targetRate": 0.0,
      "forecastRate": 56.6,
      "yoy": 80,
      "achievement": 0
    }
  ],
  "MLB_KIDS": [
    {
      "channel": "백화점",
      "prev": 2.42,
      "target": 3.17,
      "forecast": 4.08,
      "prevRate": 8.6,
      "targetRate": 9.9,
      "forecastRate": 9.8,
      "yoy": 169,
      "achievement": 129
    },
    {
      "channel": "면세점",
      "prev": 0.83,
      "target": 0.15,
      "forecast": 1.41,
      "prevRate": 14.1,
      "targetRate": 3.2,
      "forecastRate": 17.4,
      "yoy": 170,
      "achievement": 940
    },
    {
      "channel": "직영점(가두)",
      "prev": 0.58,
      "target": 0.34,
      "forecast": 0.53,
      "prevRate": 64.0,
      "targetRate": 29.3,
      "forecastRate": 48.5,
      "yoy": 91,
      "achievement": 156
    },
    {
      "channel": "자사몰",
      "prev": 1.38,
      "target": 2.01,
      "forecast": 1.26,
      "prevRate": 55.9,
      "targetRate": 58.2,
      "forecastRate": 59.2,
      "yoy": 91,
      "achievement": 63
    },
    {
      "channel": "제휴몰",
      "prev": 2.23,
      "target": 3.38,
      "forecast": 2.05,
      "prevRate": 29.8,
      "targetRate": 33.3,
      "forecastRate": 29.2,
      "yoy": 92,
      "achievement": 61
    },
    {
      "channel": "대리점",
      "prev": 1.2,
      "target": 1.42,
      "forecast": 1.23,
      "prevRate": 26.9,
      "targetRate": 25.5,
      "forecastRate": 27.3,
      "yoy": 103,
      "achievement": 87
    },
    {
      "channel": "사입",
      "prev": -1.14,
      "target": 1.95,
      "forecast": -1.79,
      "prevRate": -10.6,
      "targetRate": 16.2,
      "forecastRate": -10.9,
      "yoy": 157,
      "achievement": -92
    },
    {
      "channel": "직영몰",
      "prev": 0.29,
      "target": 0.71,
      "forecast": 0.41,
      "prevRate": 10.8,
      "targetRate": 17.7,
      "forecastRate": 13.1,
      "yoy": 141,
      "achievement": 58
    },
    {
      "channel": "기타",
      "prev": 0.01,
      "target": 0.0,
      "forecast": 0.01,
      "prevRate": 48.0,
      "targetRate": 0.0,
      "forecastRate": 41.0,
      "yoy": 100,
      "achievement": 0
    }
  ],
  "DISCOVERY": [
    {
      "channel": "백화점",
      "prev": 15.82,
      "target": 14.85,
      "forecast": 14.2,
      "prevRate": 17.6,
      "targetRate": 15.4,
      "forecastRate": 15.1,
      "yoy": 90,
      "achievement": 96
    },
    {
      "channel": "면세점",
      "prev": 2.13,
      "target": 2.06,
      "forecast": 2.54,
      "prevRate": 16.6,
      "targetRate": 18.1,
      "forecastRate": 13.9,
      "yoy": 119,
      "achievement": 123
    },
    {
      "channel": "직영점(가두)",
      "prev": -0.41,
      "target": 0.03,
      "forecast": -0.26,
      "prevRate": -64.7,
      "targetRate": 0.6,
      "forecastRate": -6.4,
      "yoy": 63,
      "achievement": -867
    },
    {
      "channel": "자사몰",
      "prev": 7.39,
      "target": 7.42,
      "forecast": 5.21,
      "prevRate": 57.6,
      "targetRate": 61.2,
      "forecastRate": 58.9,
      "yoy": 71,
      "achievement": 70
    },
    {
      "channel": "제휴몰",
      "prev": 11.97,
      "target": 14.16,
      "forecast": 10.18,
      "prevRate": 37.6,
      "targetRate": 39.7,
      "forecastRate": 37.9,
      "yoy": 85,
      "achievement": 72
    },
    {
      "channel": "대리점",
      "prev": 23.28,
      "target": 21.42,
      "forecast": 18.12,
      "prevRate": 32.5,
      "targetRate": 31.8,
      "forecastRate": 28.5,
      "yoy": 78,
      "achievement": 85
    },
    {
      "channel": "사입",
      "prev": -0.52,
      "target": 6.18,
      "forecast": -4.1,
      "prevRate": -7.3,
      "targetRate": 51.6,
      "forecastRate": -19.9,
      "yoy": 788,
      "achievement": -66
    },
    {
      "channel": "직영몰",
      "prev": 1.1,
      "target": 1.89,
      "forecast": 1.22,
      "prevRate": 17.6,
      "targetRate": 23.5,
      "forecastRate": 20.1,
      "yoy": 111,
      "achievement": 65
    },
    {
      "channel": "아울렛",
      "prev": 13.55,
      "target": 15.2,
      "forecast": 13.59,
      "prevRate": 25.8,
      "targetRate": 28.2,
      "forecastRate": 25.7,
      "yoy": 100,
      "achievement": 89
    },
    {
      "channel": "기타",
      "prev": 0.1,
      "target": 0.0,
      "forecast": 0.09,
      "prevRate": 28.6,
      "targetRate": 0.0,
      "forecastRate": 60.4,
      "yoy": 90,
      "achievement": 0
    }
  ],
  "DUVETICA": [
    {
      "channel": "백화점",
      "prev": 0.98,
      "target": 2.87,
      "forecast": 3.22,
      "prevRate": 16.9,
      "targetRate": 25.3,
      "forecastRate": 26.9,
      "yoy": 329,
      "achievement": 112
    },
    {
      "channel": "직영점(가두)",
      "prev": 0.0,
      "target": 0.58,
      "forecast": 0.18,
      "prevRate": 0.0,
      "targetRate": 44.2,
      "forecastRate": 47.4,
      "yoy": 0,
      "achievement": 31
    },
    {
      "channel": "자사몰",
      "prev": 0.31,
      "target": 1.31,
      "forecast": 0.51,
      "prevRate": 63.1,
      "targetRate": 78.0,
      "forecastRate": 63.1,
      "yoy": 165,
      "achievement": 39
    },
    {
      "channel": "제휴몰",
      "prev": 1.61,
      "target": 1.93,
      "forecast": 1.45,
      "prevRate": 45.7,
      "targetRate": 42.9,
      "forecastRate": 44.9,
      "yoy": 90,
      "achievement": 75
    },
    {
      "channel": "직영몰",
      "prev": 0.16,
      "target": 0.19,
      "forecast": -0.68,
      "prevRate": 14.4,
      "targetRate": 53.4,
      "forecastRate": -35.8,
      "yoy": -425,
      "achievement": -358
    },
    {
      "channel": "아울렛",
      "prev": 1.77,
      "target": 1.18,
      "forecast": 1.68,
      "prevRate": 36.5,
      "targetRate": 24.1,
      "forecastRate": 31.6,
      "yoy": 95,
      "achievement": 142
    },
    {
      "channel": "기타",
      "prev": 0.02,
      "target": 0.0,
      "forecast": 0.01,
      "prevRate": 133.6,
      "targetRate": 0.0,
      "forecastRate": 65.5,
      "yoy": 50,
      "achievement": 0
    }
  ],
  "SERGIO": [
    {
      "channel": "백화점",
      "prev": -0.58,
      "target": 0.1,
      "forecast": -0.09,
      "prevRate": -101.4,
      "targetRate": 110.8,
      "forecastRate": -257.3,
      "yoy": 16,
      "achievement": -90
    },
    {
      "channel": "면세점",
      "prev": -0.17,
      "target": 0.04,
      "forecast": -0.09,
      "prevRate": -42.3,
      "targetRate": 6.0,
      "forecastRate": -35.6,
      "yoy": 53,
      "achievement": -225
    },
    {
      "channel": "직영점(가두)",
      "prev": 0.0,
      "target": 0.07,
      "forecast": 0.02,
      "prevRate": 0.0,
      "targetRate": 9.3,
      "forecastRate": 8.2,
      "yoy": 0,
      "achievement": 29
    },
    {
      "channel": "자사몰",
      "prev": 0.7,
      "target": 0.57,
      "forecast": 0.19,
      "prevRate": 55.0,
      "targetRate": 51.8,
      "forecastRate": 35.1,
      "yoy": 27,
      "achievement": 33
    },
    {
      "channel": "제휴몰",
      "prev": 0.2,
      "target": 0.6,
      "forecast": 0.07,
      "prevRate": 11.4,
      "targetRate": 51.1,
      "forecastRate": 9.2,
      "yoy": 35,
      "achievement": 12
    },
    {
      "channel": "직영몰",
      "prev": -0.64,
      "target": 0.35,
      "forecast": -0.46,
      "prevRate": -107.3,
      "targetRate": 51.4,
      "forecastRate": -92.2,
      "yoy": 72,
      "achievement": -131
    },
    {
      "channel": "아울렛",
      "prev": -0.07,
      "target": 0.04,
      "forecast": -0.03,
      "prevRate": -18.3,
      "targetRate": 4.3,
      "forecastRate": -3.7,
      "yoy": 43,
      "achievement": -75
    },
    {
      "channel": "기타",
      "prev": 0.0,
      "target": 0.0,
      "forecast": 0.01,
      "prevRate": 37.6,
      "targetRate": 0.0,
      "forecastRate": 70.5,
      "yoy": 0,
      "achievement": 0
    }
  ],
  "SUPRA": [
    {
      "channel": "백화점",
      "prev": -0.04,
      "target": 0.0,
      "forecast": 0.0,
      "prevRate": -94.6,
      "targetRate": 0.0,
      "forecastRate": 0.0,
      "yoy": 0,
      "achievement": 0
    },
    {
      "channel": "면세점",
      "prev": -0.66,
      "target": 0.0,
      "forecast": 0.0,
      "prevRate": -58.8,
      "targetRate": 0.0,
      "forecastRate": 0.0,
      "yoy": 0,
      "achievement": 0
    },
    {
      "channel": "직영점(가두)",
      "prev": -0.54,
      "target": 0.0,
      "forecast": 0.0,
      "prevRate": -145.3,
      "targetRate": 0.0,
      "forecastRate": 0.0,
      "yoy": 0,
      "achievement": 0
    },
    {
      "channel": "자사몰",
      "prev": 0.05,
      "target": 0.05,
      "forecast": -0.05,
      "prevRate": 32.1,
      "targetRate": 14.3,
      "forecastRate": -18.4,
      "yoy": -100,
      "achievement": -100
    },
    {
      "channel": "제휴몰",
      "prev": 0.02,
      "target": 0.07,
      "forecast": -0.08,
      "prevRate": 5.9,
      "targetRate": 11.7,
      "forecastRate": -46.0,
      "yoy": -400,
      "achievement": -114
    },
    {
      "channel": "직영몰",
      "prev": -0.32,
      "target": 0.0,
      "forecast": 0.0,
      "prevRate": -211.6,
      "targetRate": 0.0,
      "forecastRate": 0.0,
      "yoy": 0,
      "achievement": 0
    }
  ]
},
  channelDiscountData: {
  "MLB": [
    {
      "channel": "백화점",
      "prev": 4.7,
      "target": 3.8,
      "forecast": 4.8
    },
    {
      "channel": "면세점",
      "prev": 0.7,
      "target": 1.6,
      "forecast": 4.3
    },
    {
      "channel": "RF",
      "prev": 19.6,
      "target": 8.3,
      "forecast": 18.5
    },
    {
      "channel": "직영점(가두)",
      "prev": 8.9,
      "target": 14.0,
      "forecast": 6.5
    },
    {
      "channel": "자사몰",
      "prev": 10.4,
      "target": 18.5,
      "forecast": 13.4
    },
    {
      "channel": "제휴몰",
      "prev": 6.0,
      "target": 2.7,
      "forecast": 5.2
    },
    {
      "channel": "대리점",
      "prev": 4.7,
      "target": 4.9,
      "forecast": 4.7
    },
    {
      "channel": "사입",
      "prev": 75.5,
      "target": 76.5,
      "forecast": 76.8
    },
    {
      "channel": "직영몰",
      "prev": 22.1,
      "target": 17.6,
      "forecast": 2.5
    },
    {
      "channel": "기타",
      "prev": 48.2,
      "target": 0.0,
      "forecast": 45.2
    }
  ],
  "MLB_KIDS": [
    {
      "channel": "백화점",
      "prev": 9.7,
      "target": 6.7,
      "forecast": 10.1
    },
    {
      "channel": "면세점",
      "prev": 1.0,
      "target": 1.4,
      "forecast": 0.2
    },
    {
      "channel": "직영점(가두)",
      "prev": 2.2,
      "target": 4.1,
      "forecast": 0.2
    },
    {
      "channel": "자사몰",
      "prev": 14.6,
      "target": 13.4,
      "forecast": 16.2
    },
    {
      "channel": "제휴몰",
      "prev": 9.8,
      "target": 2.2,
      "forecast": 16.0
    },
    {
      "channel": "대리점",
      "prev": 6.5,
      "target": 6.2,
      "forecast": 5.0
    },
    {
      "channel": "사입",
      "prev": 79.6,
      "target": 79.4,
      "forecast": 79.5
    },
    {
      "channel": "직영몰",
      "prev": 6.8,
      "target": 6.8,
      "forecast": 8.3
    },
    {
      "channel": "기타",
      "prev": 59.6,
      "target": 0.0,
      "forecast": 46.1
    }
  ],
  "DISCOVERY": [
    {
      "channel": "백화점",
      "prev": 27.9,
      "target": 23.3,
      "forecast": 29.4
    },
    {
      "channel": "면세점",
      "prev": 11.7,
      "target": 9.8,
      "forecast": 13.9
    },
    {
      "channel": "직영점(가두)",
      "prev": 5.4,
      "target": 5.8,
      "forecast": 9.6
    },
    {
      "channel": "자사몰",
      "prev": 18.7,
      "target": 13.6,
      "forecast": 17.5
    },
    {
      "channel": "제휴몰",
      "prev": 24.8,
      "target": 19.1,
      "forecast": 25.4
    },
    {
      "channel": "대리점",
      "prev": 13.1,
      "target": 8.8,
      "forecast": 17.5
    },
    {
      "channel": "사입",
      "prev": 85.1,
      "target": 83.1,
      "forecast": 85.5
    },
    {
      "channel": "직영몰",
      "prev": 5.7,
      "target": 7.5,
      "forecast": 12.5
    },
    {
      "channel": "아울렛",
      "prev": 36.0,
      "target": 36.2,
      "forecast": 33.4
    },
    {
      "channel": "기타",
      "prev": 66.9,
      "target": 0.0,
      "forecast": 22.9
    }
  ],
  "DUVETICA": [
    {
      "channel": "백화점",
      "prev": 33.5,
      "target": 16.4,
      "forecast": 11.5
    },
    {
      "channel": "직영점(가두)",
      "prev": 0.0,
      "target": 13.4,
      "forecast": 0.0
    },
    {
      "channel": "자사몰",
      "prev": 32.8,
      "target": 16.5,
      "forecast": 20.4
    },
    {
      "channel": "제휴몰",
      "prev": 46.7,
      "target": 32.5,
      "forecast": 30.1
    },
    {
      "channel": "직영몰",
      "prev": 31.4,
      "target": 16.8,
      "forecast": 10.2
    },
    {
      "channel": "아울렛",
      "prev": 50.8,
      "target": 60.2,
      "forecast": 54.3
    },
    {
      "channel": "기타",
      "prev": 63.3,
      "target": 0.0,
      "forecast": 42.3
    }
  ],
  "SERGIO": [
    {
      "channel": "백화점",
      "prev": 33.0,
      "target": 14.4,
      "forecast": 6.6
    },
    {
      "channel": "면세점",
      "prev": 23.6,
      "target": 4.8,
      "forecast": 6.7
    },
    {
      "channel": "직영점(가두)",
      "prev": 0.0,
      "target": 6.2,
      "forecast": 3.4
    },
    {
      "channel": "자사몰",
      "prev": 13.6,
      "target": 28.5,
      "forecast": 8.6
    },
    {
      "channel": "제휴몰",
      "prev": 49.7,
      "target": 49.8,
      "forecast": 48.7
    },
    {
      "channel": "직영몰",
      "prev": 44.4,
      "target": 11.7,
      "forecast": 23.0
    },
    {
      "channel": "아울렛",
      "prev": 49.9,
      "target": 58.3,
      "forecast": 54.0
    },
    {
      "channel": "기타",
      "prev": 56.6,
      "target": 0.0,
      "forecast": 31.0
    }
  ],
  "SUPRA": [
    {
      "channel": "백화점",
      "prev": 76.2,
      "target": 0.0,
      "forecast": 0.0
    },
    {
      "channel": "면세점",
      "prev": 56.4,
      "target": 0.0,
      "forecast": 0.0
    },
    {
      "channel": "직영점(가두)",
      "prev": 53.6,
      "target": 0.0,
      "forecast": 0.0
    },
    {
      "channel": "자사몰",
      "prev": 36.7,
      "target": 85.0,
      "forecast": 74.9
    },
    {
      "channel": "제휴몰",
      "prev": 30.6,
      "target": 85.0,
      "forecast": 71.7
    },
    {
      "channel": "직영몰",
      "prev": 36.7,
      "target": 0.0,
      "forecast": 0.0
    },
    {
      "channel": "기타",
      "prev": 42.3,
      "target": 0.0,
      "forecast": 68.7
    }
  ]
},
  channelProfitRateData: {
  "MLB": [
    {
      "channel": "백화점",
      "prev": 20.7,
      "target": 23.9,
      "forecast": 23.7
    },
    {
      "channel": "면세점",
      "prev": 28.8,
      "target": 27.4,
      "forecast": 28.3
    },
    {
      "channel": "RF",
      "prev": 27.5,
      "target": 32.3,
      "forecast": 32.0
    },
    {
      "channel": "직영점(가두)",
      "prev": 13.7,
      "target": 30.6,
      "forecast": 38.4
    },
    {
      "channel": "자사몰",
      "prev": 58.6,
      "target": 64.2,
      "forecast": 66.2
    },
    {
      "channel": "제휴몰",
      "prev": 40.3,
      "target": 46.7,
      "forecast": 46.0
    },
    {
      "channel": "대리점",
      "prev": 32.2,
      "target": 37.8,
      "forecast": 33.5
    },
    {
      "channel": "사입",
      "prev": 14.8,
      "target": 2.9,
      "forecast": 14.4
    },
    {
      "channel": "직영몰",
      "prev": 1.0,
      "target": 16.6,
      "forecast": 18.4
    },
    {
      "channel": "기타",
      "prev": 52.9,
      "target": 0.0,
      "forecast": 56.6
    }
  ],
  "MLB_KIDS": [
    {
      "channel": "백화점",
      "prev": 8.6,
      "target": 9.9,
      "forecast": 9.8
    },
    {
      "channel": "면세점",
      "prev": 14.1,
      "target": 3.2,
      "forecast": 17.4
    },
    {
      "channel": "직영점(가두)",
      "prev": 64.0,
      "target": 29.3,
      "forecast": 48.5
    },
    {
      "channel": "자사몰",
      "prev": 55.9,
      "target": 58.2,
      "forecast": 59.2
    },
    {
      "channel": "제휴몰",
      "prev": 29.8,
      "target": 33.3,
      "forecast": 29.2
    },
    {
      "channel": "대리점",
      "prev": 26.9,
      "target": 25.5,
      "forecast": 27.3
    },
    {
      "channel": "사입",
      "prev": -10.6,
      "target": 16.2,
      "forecast": -10.9
    },
    {
      "channel": "직영몰",
      "prev": 10.8,
      "target": 17.7,
      "forecast": 13.1
    },
    {
      "channel": "기타",
      "prev": 48.0,
      "target": 0.0,
      "forecast": 41.0
    }
  ],
  "DISCOVERY": [
    {
      "channel": "백화점",
      "prev": 17.6,
      "target": 15.4,
      "forecast": 15.1
    },
    {
      "channel": "면세점",
      "prev": 16.6,
      "target": 18.1,
      "forecast": 13.9
    },
    {
      "channel": "직영점(가두)",
      "prev": -64.7,
      "target": 0.6,
      "forecast": -6.4
    },
    {
      "channel": "자사몰",
      "prev": 57.6,
      "target": 61.2,
      "forecast": 58.9
    },
    {
      "channel": "제휴몰",
      "prev": 37.6,
      "target": 39.7,
      "forecast": 37.9
    },
    {
      "channel": "대리점",
      "prev": 32.5,
      "target": 31.8,
      "forecast": 28.5
    },
    {
      "channel": "사입",
      "prev": -7.3,
      "target": 51.6,
      "forecast": -19.9
    },
    {
      "channel": "직영몰",
      "prev": 17.6,
      "target": 23.5,
      "forecast": 20.1
    },
    {
      "channel": "아울렛",
      "prev": 25.8,
      "target": 28.2,
      "forecast": 25.7
    },
    {
      "channel": "기타",
      "prev": 28.6,
      "target": 0.0,
      "forecast": 60.4
    }
  ],
  "DUVETICA": [
    {
      "channel": "백화점",
      "prev": 16.9,
      "target": 25.3,
      "forecast": 26.9
    },
    {
      "channel": "직영점(가두)",
      "prev": 0.0,
      "target": 44.2,
      "forecast": 47.4
    },
    {
      "channel": "자사몰",
      "prev": 63.1,
      "target": 78.0,
      "forecast": 63.1
    },
    {
      "channel": "제휴몰",
      "prev": 45.7,
      "target": 42.9,
      "forecast": 44.9
    },
    {
      "channel": "직영몰",
      "prev": 14.4,
      "target": 53.4,
      "forecast": -35.8
    },
    {
      "channel": "아울렛",
      "prev": 36.5,
      "target": 24.1,
      "forecast": 31.6
    },
    {
      "channel": "기타",
      "prev": 133.6,
      "target": 0.0,
      "forecast": 65.5
    }
  ],
  "SERGIO": [
    {
      "channel": "백화점",
      "prev": -101.4,
      "target": 110.8,
      "forecast": -257.3
    },
    {
      "channel": "면세점",
      "prev": -42.3,
      "target": 6.0,
      "forecast": -35.6
    },
    {
      "channel": "직영점(가두)",
      "prev": 0.0,
      "target": 9.3,
      "forecast": 8.2
    },
    {
      "channel": "자사몰",
      "prev": 55.0,
      "target": 51.8,
      "forecast": 35.1
    },
    {
      "channel": "제휴몰",
      "prev": 11.4,
      "target": 51.1,
      "forecast": 9.2
    },
    {
      "channel": "직영몰",
      "prev": -107.3,
      "target": 51.4,
      "forecast": -92.2
    },
    {
      "channel": "아울렛",
      "prev": -18.3,
      "target": 4.3,
      "forecast": -3.7
    },
    {
      "channel": "기타",
      "prev": 37.6,
      "target": 0.0,
      "forecast": 70.5
    }
  ],
  "SUPRA": [
    {
      "channel": "백화점",
      "prev": -94.6,
      "target": 0.0,
      "forecast": 0.0
    },
    {
      "channel": "면세점",
      "prev": -58.8,
      "target": 0.0,
      "forecast": 0.0
    },
    {
      "channel": "직영점(가두)",
      "prev": -145.3,
      "target": 0.0,
      "forecast": 0.0
    },
    {
      "channel": "자사몰",
      "prev": 32.1,
      "target": 14.3,
      "forecast": -18.4
    },
    {
      "channel": "제휴몰",
      "prev": 5.9,
      "target": 11.7,
      "forecast": -46.0
    },
    {
      "channel": "직영몰",
      "prev": -211.6,
      "target": 0.0,
      "forecast": 0.0
    }
  ]
},
  brandRevenueTotals: {
  "MLB": {
    "prev": 291.5,
    "target": 291.6,
    "forecast": 378.0
  },
  "MLB_KIDS": {
    "prev": 69.0,
    "target": 80.6,
    "forecast": 92.4
  },
  "DISCOVERY": {
    "prev": 314.4,
    "target": 331.2,
    "forecast": 324.8
  },
  "DUVETICA": {
    "prev": 17.3,
    "target": 26.5,
    "forecast": 26.0
  },
  "SERGIO": {
    "prev": 5.5,
    "target": 5.9,
    "forecast": 3.6
  },
  "SUPRA": {
    "prev": 2.3,
    "target": 1.1,
    "forecast": 0.5
  }
},
  brandProfitTotals: {
  "MLB": {
    "prev": 68.7,
    "target": 74.2,
    "forecast": 99.7
  },
  "MLB_KIDS": {
    "prev": 7.8,
    "target": 13.1,
    "forecast": 9.2
  },
  "DISCOVERY": {
    "prev": 74.4,
    "target": 83.2,
    "forecast": 60.8
  },
  "DUVETICA": {
    "prev": 4.8,
    "target": 8.1,
    "forecast": 6.4
  },
  "SERGIO": {
    "prev": -0.6,
    "target": 1.8,
    "forecast": -0.4
  },
  "SUPRA": {
    "prev": -1.5,
    "target": 0.1,
    "forecast": -0.1
  }
}
};

if (typeof window !== 'undefined') {
  window.channelProfitLossData = channelProfitLossData;
}
// === 채널별 손익 데이터 끝 ===
